{
  "name": "docs-collaboration",
  "slug": "docs",
  "tagline": null,
  "description": "Suite Numerique Docs is the documentation portal for the Suite Numerique project. It provides structured guides, API references, and usage examples for users deploying or integrating the suite into their own environments.",
  "categories": [
    152
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v4.1.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-10",
    "date_last_commit": "2025-12-12",
    "github_stars": 15007
  },
  "resources": {
    "website": "https://docs.numerique.gouv.fr",
    "documentation": "https://github.com/suitenumerique/docs",
    "source_code": "https://github.com/suitenumerique/docs",
    "logo": "/icons/docs.webp",
    "issues": "https://github.com/suitenumerique/docs/issues",
    "releases": "https://github.com/suitenumerique/docs/releases"
  },
  "features": [
    "Documentation Portal: Comprehensive documentation hub with structured guides, tutorials, and reference materials.",
    "API Documentation: Interactive API references with code examples, parameter descriptions, and response schemas.",
    "Search Functionality: Full-text search across all documentation with filtering and categorization options.",
    "Version Control: Maintain multiple documentation versions with easy switching and comparison features.",
    "Collaborative Editing: Enable multiple contributors to edit and review documentation with approval workflows.",
    "Custom Themes: Apply organization branding with customizable themes, logos, and styling options.",
    "Multi-language Support: Provide documentation in multiple languages with translation management tools.",
    "Interactive Examples: Include live code examples and interactive demos within documentation pages.",
    "Export Options: Generate PDF, HTML, and other formats for offline distribution and archival purposes.",
    "Analytics Integration: Track documentation usage, popular pages, and user engagement with detailed analytics.",
    "Comment System: Allow readers to provide feedback and ask questions directly on documentation pages.",
    "Mobile Optimization: Responsive design ensuring excellent reading experience on all devices and screen sizes."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
