{
  "name": "docuseal",
  "slug": "docuseal",
  "tagline": null,
  "description": "DocuSeal is a document signing and form-filling platform that can be self-hosted. It supports templates, workflows, audit trails, and a user-friendly signing experience, making it suitable for contracts, agreements, and HR paperwork automation.",
  "categories": [
    49
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "2.2.5",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-08",
    "date_last_commit": "2025-12-08",
    "github_stars": 10996
  },
  "resources": {
    "website": "https://www.docuseal.com",
    "documentation": "https://github.com/docusealco/docuseal",
    "source_code": "https://github.com/docusealco/docuseal",
    "logo": "/icons/docuseal.webp",
    "issues": "https://github.com/docusealco/docuseal/issues",
    "releases": "https://github.com/docusealco/docuseal/releases"
  },
  "features": [
    "Document Templates: Create reusable document templates with predefined fields, signatures, and workflows for consistent processing.",
    "Digital Signatures: Capture legally binding electronic signatures with timestamp verification and certificate validation.",
    "Multi-party Workflows: Route documents through sequential approval chains with automated notifications and status tracking.",
    "Form Builder: Design custom forms with drag-and-drop fields, validation rules, and conditional logic for data collection.",
    "Audit Trails: Maintain comprehensive logs of all document actions, signatures, and modifications for compliance tracking.",
    "API Integration: Connect with external systems through REST APIs for automated document generation and processing workflows.",
    "Real-time Collaboration: Enable simultaneous editing and review with live updates, comments, and version control.",
    "Mobile Optimization: Access and sign documents on any device with responsive design and touch-friendly interfaces.",
    "Bulk Processing: Handle large document volumes with batch operations, automated routing, and progress monitoring.",
    "Custom Branding: Apply organization logos, colors, and styling to maintain brand consistency across all documents.",
    "Advanced Analytics: Track completion rates, processing times, and user engagement with detailed reporting dashboards.",
    "Secure Storage: Encrypt documents at rest and in transit with role-based access controls and retention policies."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
