{
  "name": "dub",
  "slug": "dub",
  "tagline": null,
  "description": "Dub is an open-source link management and URL shortening platform. It supports branded links, analytics, workspaces, and API access, offering a privacy-friendly alternative to commercial link management tools.",
  "categories": [
    171
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-13",
    "github_stars": 22757
  },
  "resources": {
    "website": "https://dub.co",
    "documentation": "https://github.com/dubinc/dub",
    "source_code": "https://github.com/dubinc/dub",
    "logo": "/icons/dub.webp",
    "issues": "https://github.com/dubinc/dub/issues",
    "releases": null
  },
  "features": [
    "URL Shortening: Create short, branded links with custom domains and memorable aliases for better brand recognition.",
    "Click Analytics: Track detailed click statistics including geographic location, device types, and referrer information.",
    "Custom Domains: Use your own domain names for shortened links to maintain brand consistency and trust.",
    "Workspace Management: Organize links into separate workspaces for different projects, teams, or clients.",
    "QR Code Generation: Automatically generate QR codes for shortened links with customizable styling and branding.",
    "Link Expiration: Set automatic expiration dates for links with optional redirect destinations after expiry.",
    "Password Protection: Secure sensitive links with password requirements before allowing access to destinations.",
    "Bulk Operations: Create, edit, and manage multiple links simultaneously through CSV import and batch processing.",
    "API Integration: Access all functionality through comprehensive REST APIs for automation and application integration.",
    "Team Collaboration: Share workspaces with team members and control access permissions for different user roles.",
    "UTM Parameters: Automatically add tracking parameters to links for better campaign attribution and analytics.",
    "Link Preview: Generate social media previews with custom titles, descriptions, and images for better engagement."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
