{
  "name": "dweebui",
  "slug": "dweebui",
  "tagline": null,
  "description": "DweebUI is a playful, customizable web dashboard for presenting information widgets, links, and status blocks. It’s designed for self-hosted homepages, homelabs, or personal start pages with a retro-inspired style.",
  "categories": [
    82
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.60",
    "date_app_added": "2025-11-23",
    "date_last_released": "2024-06-09",
    "date_last_commit": "2025-06-25",
    "github_stars": 1037
  },
  "resources": {
    "website": "https://www.dweebui.com/",
    "documentation": "https://github.com/lllllllillllllillll/DweebUI",
    "source_code": "https://github.com/lllllllillllllillll/DweebUI",
    "logo": "/icons/dweebui.webp",
    "issues": "https://github.com/lllllllillllllillll/DweebUI/issues",
    "releases": "https://github.com/lllllllillllllillll/DweebUI/releases"
  },
  "features": [
    "Retro Dashboard: Playful, retro-inspired interface design with customizable themes and nostalgic styling elements.",
    "Widget System: Create custom information widgets displaying system stats, weather, links, and personal content.",
    "Link Management: Organize frequently used links and bookmarks with custom icons and categorization options.",
    "Status Blocks: Display service status, system health, and custom metrics with color-coded visual indicators.",
    "Customizable Layout: Drag-and-drop interface builder with flexible grid system and responsive design options.",
    "Personal Homepage: Perfect for browser start pages, homelab dashboards, and personal information centers.",
    "Theme Engine: Multiple built-in themes with support for custom CSS and color scheme modifications.",
    "Quick Access: Fast loading times and keyboard shortcuts for efficient navigation and productivity.",
    "Mobile Friendly: Responsive design that works seamlessly on smartphones, tablets, and desktop devices.",
    "No Dependencies: Lightweight implementation with minimal external dependencies and fast deployment.",
    "Configuration Files: Simple JSON-based configuration for easy setup and version control integration.",
    "Privacy Focused: Self-hosted solution with no external tracking or data collection requirements."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
