{
  "name": "kanba",
  "slug": "kanba",
  "tagline": null,
  "description": "Kanba is a kanban style project and task management application with multi user support. It lets teams organize boards, track work in progress and comment on tasks, offering a Trello like experience on self hosted infrastructure.",
  "categories": [
    85
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "1.0.8",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-08-11",
    "date_last_commit": "2025-10-20",
    "github_stars": 468
  },
  "resources": {
    "website": "https://kanba.co",
    "documentation": "https://github.com/Kanba-co/kanba",
    "source_code": "https://github.com/Kanba-co/kanba",
    "logo": "/icons/kanba.webp",
    "issues": "https://github.com/Kanba-co/kanba/issues",
    "releases": "https://github.com/Kanba-co/kanba/releases",
    "logo_light": "/icons/kanba-light.webp"
  },
  "features": [
    "Kanban Boards: Visual task management with drag-and-drop cards and multiple boards. Organize work Trello-style.",
    "Team Collaboration: Multi-user support with task comments and activity tracking. Coordinate team projects effectively.",
    "Task Management: Labels, tags, due dates, and assignees for comprehensive task tracking. Monitor work in progress with clarity.",
    "Board Templates: Pre-configured board layouts for common workflows and project types. Start projects faster.",
    "Card Attachments: Upload files and images directly to task cards. Keep all project assets in one place.",
    "Activity Feed: Real-time updates on task changes, comments, and team actions. Stay informed about project progress.",
    "Custom Fields: Add custom metadata to cards for project-specific information. Tailor boards to your needs.",
    "Archive & History: Archive completed tasks and view historical changes. Maintain project records over time.",
    "Mobile Responsive: Access boards from any device with responsive web design. Manage tasks on the go.",
    "Export Data: Export boards and tasks to various formats for backup or reporting. Own your project data.",
    "Search & Filter: Find tasks quickly with advanced search and filtering options. Navigate large projects efficiently.",
    "Notifications: Get alerts for task assignments, comments, and due dates. Stay on top of your work."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
