{
  "name": "kanboard",
  "slug": "kanboard",
  "tagline": null,
  "description": "Kanboard is a lean project management tool focused on visualizing work. It offers swimlanes, automations, subtasks and plugins, with a self hosted web interface designed for teams adopting kanban methodologies.",
  "categories": [
    85
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v1.2.48",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-18",
    "date_last_commit": "2025-12-13",
    "github_stars": 9343
  },
  "resources": {
    "website": "https://kanboard.org",
    "documentation": "https://github.com/kanboard/kanboard",
    "source_code": "https://github.com/kanboard/kanboard",
    "logo": "/icons/kanboard.webp",
    "issues": "https://github.com/kanboard/kanboard/issues",
    "releases": "https://github.com/kanboard/kanboard/releases"
  },
  "features": [
    "Visual Workflow: Kanban boards with swimlanes, drag-and-drop cards, and customizable columns. Visualize work in progress effectively.",
    "Task Automation: Automatic actions, workflow triggers, and event-based rules. Reduce manual work with smart automation.",
    "Subtasks: Break down complex tasks into manageable subtasks with progress tracking. Organize work hierarchically.",
    "Time Tracking: Built-in time tracking, task duration estimates, and time spent reports. Monitor project hours accurately.",
    "Plugin System: Extend functionality with plugins, custom integrations, and third-party extensions. Adapt to your workflow needs.",
    "Multi-User: User roles, permissions, and team collaboration features. Coordinate work across teams.",
    "Analytics: Burndown charts, cycle time, and lead time metrics. Measure team performance and productivity.",
    "Search & Filter: Advanced search, custom filters, and saved queries. Find tasks quickly in large projects.",
    "Recurring Tasks: Automatically create tasks on schedules for routine work. Automate repetitive project activities.",
    "Custom Fields: Add project-specific metadata to tasks with custom fields. Track information relevant to your workflow.",
    "Email Integration: Create tasks from emails and receive notifications. Stay connected to your projects.",
    "Export & Import: Backup projects and migrate data with export/import tools. Maintain data portability."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
