{
  "name": "kanidm",
  "slug": "kanidm",
  "tagline": null,
  "description": "Kanidm is an identity management system and LDAP compatible directory service. It aims to provide secure, modern authentication and authorization features for self hosted infrastructure with both CLI and web administration tools.",
  "categories": [
    79
  ],
  "metadata": {
    "sponsored": false,
    "license": "MPL-2.0",
    "version": "v1.8.5",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-13",
    "date_last_commit": "2025-12-13",
    "github_stars": 4320
  },
  "resources": {
    "website": "https://kanidm.com",
    "documentation": "https://github.com/kanidm/kanidm",
    "source_code": "https://github.com/kanidm/kanidm",
    "logo": "/icons/kanidm.webp",
    "issues": "https://github.com/kanidm/kanidm/issues",
    "releases": "https://github.com/kanidm/kanidm/releases"
  },
  "features": [
    "Identity Management: User and group administration with LDAP compatibility and modern authentication protocols. Centralize identity infrastructure.",
    "OAuth2 & OIDC: Standards-based authentication for web applications and APIs. Enable single sign-on across services.",
    "Multi-Factor Authentication: Support for TOTP, WebAuthn, and hardware security keys. Strengthen account security.",
    "LDAP Server: LDAP-compatible directory service for legacy application integration. Bridge modern and traditional systems.",
    "Role-Based Access: Fine-grained permissions and policy-based authorization. Control resource access precisely.",
    "CLI & Web UI: Manage identities through command-line tools or web interface. Choose your preferred workflow.",
    "API Access: RESTful API for programmatic identity management and automation. Integrate with existing tools.",
    "Audit Logging: Comprehensive logs of authentication events and administrative actions. Track security-relevant activities.",
    "Password Policies: Enforce password complexity, expiration, and history requirements. Maintain security standards.",
    "Group Management: Nested groups, dynamic membership, and group-based permissions. Organize users efficiently.",
    "Session Management: Control active sessions, force logouts, and manage device trust. Maintain security posture.",
    "Self-Service: Users can update profiles, reset passwords, and manage MFA devices. Reduce administrative overhead."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
