{
  "name": "kapowarr",
  "slug": "kapowarr",
  "tagline": null,
  "description": "Kapowarr is a request manager and automation companion for comic book libraries. It integrates with downloaders and indexers to fetch issues, tracks series and requests, and provides a web UI for users to submit and monitor requests.",
  "categories": [
    166
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "V1.2.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-04-16",
    "date_last_commit": "2025-12-11",
    "github_stars": 777
  },
  "resources": {
    "website": "https://casvt.github.io/Kapowarr/",
    "documentation": "https://github.com/Casvt/Kapowarr",
    "source_code": "https://github.com/Casvt/Kapowarr",
    "logo": "/icons/kapowarr.webp",
    "issues": "https://github.com/Casvt/Kapowarr/issues",
    "releases": "https://github.com/Casvt/Kapowarr/releases"
  },
  "features": [
    "Automated Downloads: Automatically fetch new comic issues from configured sources. Keep your library up to date.",
    "Series Tracking: Monitor ongoing series and automatically download new releases. Never miss an issue.",
    "Indexer Integration: Connect to multiple comic indexers and search aggregators. Access vast comic catalogs.",
    "Metadata Management: Fetch and organize comic metadata, cover art, and series information. Maintain rich library details.",
    "Quality Profiles: Define preferred formats, resolutions, and file sizes for downloads. Control library quality.",
    "Request System: Web interface for users to request comics and track fulfillment. Manage library additions collaboratively.",
    "Download Client Support: Integrate with popular download clients for automated fetching. Seamless download workflow.",
    "Library Organization: Automatic file renaming, folder structure, and organization. Keep comics neatly arranged.",
    "Search & Filter: Find comics in your library with advanced search and filtering. Navigate large collections easily.",
    "Calendar View: See upcoming comic releases and scheduled downloads. Plan library growth.",
    "Notifications: Get alerts for new downloads, failed searches, and system events. Stay informed about library activity.",
    "API Access: Programmatic control and integration with other automation tools. Extend functionality as needed."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
