{
  "name": "karakeep-homedash",
  "slug": "karakeep-homedash",
  "tagline": "",
  "description": "Karakeep Homedash is a personal dashboard for managing smart home or server resources. It displays widgets, stats and quick links, letting users build a customized control panel for self hosted services.",
  "categories": [
    34
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-07-13",
    "github_stars": 115
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://github.com/CodeJawn/karakeep-homedash",
    "logo": "/icons/karakeep-homedash.webp",
    "issues": "https://github.com/CodeJawn/karakeep-homedash/issues",
    "releases": null
  },
  "features": [
    "Customizable Dashboard: Drag-and-drop widgets and personalized layout configuration. Build your ideal control center.",
    "Service Links: Quick access bookmarks to all your self-hosted services. Navigate your infrastructure easily.",
    "Status Monitoring: Real-time health checks and uptime displays for services. Monitor availability at a glance.",
    "Smart Home Controls: Integrate with home automation platforms for device management. Control lights, sensors, and more.",
    "Resource Metrics: Display CPU, memory, disk, and network usage statistics. Track server performance.",
    "Weather Widget: Local weather information and forecasts on your dashboard. Stay informed about conditions.",
    "Calendar Integration: View upcoming events and appointments from calendar services. Keep track of your schedule.",
    "RSS Feeds: Display news and updates from favorite RSS sources. Stay informed without leaving your dashboard.",
    "Custom Themes: Choose from multiple themes or create custom color schemes. Match your aesthetic preferences.",
    "Multi-User: Separate dashboards and preferences for different household members. Personalized experience for everyone."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
