{
  "name": "karakeep",
  "slug": "karakeep",
  "tagline": null,
  "description": "Karakeep is a home automation dashboard and control interface. It aggregates device statuses, scenes and automations into a single web UI, aiming to simplify management of self hosted smart home stacks.",
  "categories": [
    111
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v0.29.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-12",
    "date_last_commit": "2025-12-12",
    "github_stars": 21825
  },
  "resources": {
    "website": "https://karakeep.app",
    "documentation": "https://github.com/karakeep-app/karakeep",
    "source_code": "https://github.com/karakeep-app/karakeep",
    "logo": "/icons/karakeep.webp",
    "issues": "https://github.com/karakeep-app/karakeep/issues",
    "releases": "https://github.com/karakeep-app/karakeep/releases",
    "logo_light": "/icons/karakeep-light.webp"
  },
  "features": [
    "Unified Dashboard: Control all smart home devices from a single interface. Simplify home automation management.",
    "Device Control: Toggle lights, adjust thermostats, and control switches directly. Manage devices with one click.",
    "Scene Management: Create and trigger scenes that control multiple devices simultaneously. Automate common scenarios.",
    "Automation Interface: Build and manage automation rules with visual workflow editor. Create smart home logic easily.",
    "Real-Time Status: Live updates of device states and sensor readings. Monitor your home instantly.",
    "Room Organization: Group devices by room or area for logical organization. Navigate your home structure intuitively.",
    "Mobile Responsive: Access and control your home from smartphones and tablets. Manage from anywhere.",
    "Custom Widgets: Add specialized widgets for specific device types or functions. Tailor interface to your needs.",
    "Integration Support: Connect with popular smart home platforms and protocols. Work with existing devices.",
    "Energy Monitoring: Track power consumption and energy usage across devices. Optimize home efficiency.",
    "Notification System: Receive alerts for device events, automation triggers, and system issues. Stay informed about home status.",
    "User Permissions: Control access levels for different household members. Secure your smart home system."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
