{
  "name": "karrot",
  "slug": "karrot",
  "tagline": "",
  "description": "Karrot is a community organizing platform focused on food sharing and mutual aid. The backend powers groups, activities, messaging and notifications, enabling local communities to coordinate pickups and events using self hosted instances.",
  "categories": [
    73
  ],
  "metadata": {
    "sponsored": false,
    "license": null,
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": null,
    "github_stars": null
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://codeberg.org/karrot/karrot-backend",
    "logo": "/icons/karrot.webp",
    "issues": null,
    "releases": null
  },
  "features": [
    "Group Management: Create and manage community groups with member roles and permissions. Organize local initiatives.",
    "Pickup Coordination: Schedule food pickups from stores and distribution points. Reduce food waste systematically.",
    "Activity Planning: Create events, activities, and meetings with RSVP tracking. Coordinate community gatherings.",
    "Location Management: Map pickup locations and meeting points for easy navigation. Help members find places.",
    "Messaging System: Group chat and direct messaging for member communication. Stay connected with community.",
    "Notification System: Email and push notifications for pickups, events, and messages. Keep members informed.",
    "Member Profiles: User profiles with activity history and trust indicators. Build community reputation.",
    "Feedback System: Rate and review pickups and activities to maintain quality. Foster accountability.",
    "Statistics: Track food saved, pickups completed, and community impact. Measure collective achievement.",
    "Mobile Apps: Native mobile applications for iOS and Android platforms. Manage on the go.",
    "Multi-Language: Interface available in multiple languages for diverse communities. Accessible to all members.",
    "Privacy Controls: Manage visibility of personal information and activity. Protect member privacy."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
