{
  "name": "kavita",
  "slug": "kavita",
  "tagline": null,
  "description": "Kavita is a self hosted digital library for manga, comics, light novels and books. It supports reading progress, collections, metadata and multiple users with a rich responsive reader optimized for various devices.",
  "categories": [
    95
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v0.8.8.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-23",
    "date_last_commit": "2025-12-12",
    "github_stars": 9375
  },
  "resources": {
    "website": "http://www.kavitareader.com",
    "documentation": "https://github.com/Kareadita/Kavita",
    "source_code": "https://github.com/Kareadita/Kavita",
    "logo": "/icons/kavita.webp",
    "issues": "https://github.com/Kareadita/Kavita/issues",
    "releases": "https://github.com/Kareadita/Kavita/releases"
  },
  "features": [
    "Multi-Format Support: Read manga, comics, books, and light novels in various formats. Unified library for all reading material.",
    "Web Reader: Built-in responsive reader with page-by-page and continuous scroll modes. Read comfortably on any device.",
    "Reading Progress: Automatic progress tracking with resume from where you left off. Never lose your place.",
    "Library Organization: Automatic series detection, metadata fetching, and collection management. Keep library organized effortlessly.",
    "User Management: Multiple user accounts with individual reading progress and preferences. Share library with family safely.",
    "Collections: Create custom collections and reading lists to organize content. Curate your reading experience.",
    "OPDS Support: Access library through OPDS-compatible apps and readers. Use your preferred reading app.",
    "Metadata Editing: Manually edit series information, covers, and metadata. Maintain accurate library details.",
    "Reading Statistics: Track reading time, pages read, and completion rates. Understand your reading habits.",
    "Smart Lists: Automatically generated lists for recently added, in progress, and recommended content. Discover what to read next.",
    "Search & Filter: Advanced search with filters for genres, formats, and reading status. Find content quickly.",
    "Dark Mode: Eye-friendly dark theme for comfortable night reading. Reduce eye strain."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
