{
  "name": "keepassxc",
  "slug": "keepassxc",
  "tagline": null,
  "description": "KeePassXC is a cross platform password manager that stores credentials in encrypted local databases. It supports browser integration, auto typing, hardware keys and syncing via self chosen storage, giving users full control over their secrets.",
  "categories": [
    117
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "2.7.11",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-23",
    "date_last_commit": "2025-12-06",
    "github_stars": 25138
  },
  "resources": {
    "website": "https://keepassxc.org/",
    "documentation": "https://github.com/keepassxreboot/keepassxc",
    "source_code": "https://github.com/keepassxreboot/keepassxc",
    "logo": "/icons/keepassxc.webp",
    "issues": "https://github.com/keepassxreboot/keepassxc/issues",
    "releases": "https://github.com/keepassxreboot/keepassxc/releases"
  },
  "features": [
    "Encrypted Database: AES-256 encryption for password database with master password protection. Military-grade security for credentials.",
    "Password Generator: Create strong, random passwords with customizable rules and patterns. Never use weak passwords again.",
    "Browser Integration: Auto-fill credentials in browsers with official extensions for Chrome, Firefox, and Edge. Seamless login experience.",
    "Auto-Type: Simulate keyboard input to fill credentials in any application. Works beyond web browsers.",
    "Hardware Key Support: YubiKey and other FIDO2 devices for additional authentication layer. Maximum security for sensitive data.",
    "Database Sync: Store database in cloud storage for access across devices. Your choice of sync provider.",
    "Entry Organization: Groups, tags, and custom icons for organizing password entries. Keep credentials organized.",
    "Secure Notes: Store sensitive text information beyond just passwords. Protect all confidential data.",
    "Password Health: Identify weak, reused, or compromised passwords with security reports. Maintain strong credential hygiene.",
    "TOTP Generator: Built-in two-factor authentication code generator. Eliminate need for separate authenticator app.",
    "Cross-Platform: Native applications for Windows, macOS, and Linux with consistent interface. Use on any desktop system.",
    "Import & Export: Migrate from other password managers with import tools. Switch without losing data."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
