{
  "name": "keila",
  "slug": "keila",
  "tagline": null,
  "description": "Keila is an open source email marketing and newsletter tool. It enables list management, campaign design and sending, and basic analytics, providing a self hosted alternative for small organizations that want control over subscriber data.",
  "categories": [
    109
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "0.17.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-03-14",
    "date_last_commit": "2025-12-13",
    "github_stars": 1899
  },
  "resources": {
    "website": "https://keila.io",
    "documentation": "https://github.com/pentacent/keila",
    "source_code": "https://github.com/pentacent/keila",
    "logo": "/icons/keila.webp",
    "issues": "https://github.com/pentacent/keila/issues",
    "releases": "https://github.com/pentacent/keila/releases"
  },
  "features": [
    "Email Campaigns: Create and send newsletters with visual template editor. Send professional emails to subscribers.",
    "List Management: Organize subscribers into lists with import and export tools. Manage your audience effectively.",
    "Campaign Scheduling: Schedule emails for optimal delivery times and automate sends. Plan campaigns in advance.",
    "Template Editor: Design email templates with drag-and-drop or HTML editing. Create beautiful newsletters easily.",
    "Analytics: Track open rates, click-through rates, and campaign performance. Measure email marketing success.",
    "Segmentation: Target specific subscriber groups with custom segments. Send relevant content to audiences.",
    "Double Opt-In: Confirm subscriptions with double opt-in workflow. Maintain clean subscriber lists.",
    "Unsubscribe Management: Automatic unsubscribe handling and preference centers. Respect subscriber choices.",
    "SMTP Integration: Connect to any SMTP server or email service provider. Use your preferred email delivery.",
    "Self-Hosted Privacy: Own your data with GDPR-compliant, self-hosted solution. Control subscriber information completely.",
    "API Access: Programmatic campaign management and subscriber operations. Integrate with existing systems.",
    "Multi-User: Team accounts with role-based permissions for collaboration. Manage campaigns together."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
