{
  "name": "kestra",
  "slug": "kestra",
  "tagline": null,
  "description": "Kestra is an event driven orchestration and workflow platform. It lets teams define data pipelines and tasks as code, schedule and monitor them, and run at scale on self hosted or managed infrastructure with a comprehensive web UI.",
  "categories": [
    16
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v1.1.9",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-11",
    "date_last_commit": "2025-12-12",
    "github_stars": 26097
  },
  "resources": {
    "website": "https://kestra.io",
    "documentation": "https://github.com/kestra-io/kestra",
    "source_code": "https://github.com/kestra-io/kestra",
    "logo": "/icons/kestra.webp",
    "issues": "https://github.com/kestra-io/kestra/issues",
    "releases": "https://github.com/kestra-io/kestra/releases"
  },
  "features": [
    "Workflow Orchestration: Event-driven pipelines with task scheduling and dependencies. Automate complex data workflows.",
    "Visual Flow Editor: Design workflows with drag-and-drop interface or YAML code. Build pipelines visually or programmatically.",
    "Data Pipelines: ETL operations with database, API, and file system connectors. Build scalable data processing.",
    "Task Library: Pre-built tasks for common operations and integrations. Accelerate workflow development.",
    "Execution Monitoring: Real-time tracking of workflow runs with detailed logs. Monitor pipeline health continuously.",
    "Error Handling: Automatic retries, failure notifications, and recovery strategies. Build resilient workflows.",
    "Scheduling: Cron-based scheduling and event triggers for workflow execution. Run pipelines on your schedule.",
    "Version Control: YAML workflow definitions with Git integration. Track changes and collaborate on pipelines.",
    "Reusable Templates: Create workflow templates for common patterns. Standardize pipeline development.",
    "Multi-Tenancy: Namespace isolation for teams and projects. Organize workflows by department or project.",
    "API & CLI: Programmatic workflow management and execution control. Integrate with existing tools.",
    "Performance Metrics: Track execution times, resource usage, and throughput. Optimize pipeline performance."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
