{
  "name": "keycloak",
  "slug": "keycloak",
  "tagline": null,
  "description": "Keycloak is an open source identity and access management solution. It provides SSO, OAuth2 and OpenID Connect, user federation and fine grained authorization policies, and can be self hosted or used as part of managed offerings.",
  "categories": [
    79
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "26.4.7",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-01",
    "date_last_commit": "2025-12-13",
    "github_stars": 31609
  },
  "resources": {
    "website": "https://www.keycloak.org",
    "documentation": "https://github.com/keycloak/keycloak",
    "source_code": "https://github.com/keycloak/keycloak",
    "logo": "/icons/keycloak.webp",
    "issues": "https://github.com/keycloak/keycloak/issues",
    "releases": "https://github.com/keycloak/keycloak/releases"
  },
  "features": [
    "Single Sign-On: SSO across applications with OAuth2, OIDC, and SAML protocols. One login for all services.",
    "Identity Brokering: Integrate with external identity providers like Google, GitHub, and LDAP. Federate authentication sources.",
    "User Federation: Connect to existing user databases and LDAP directories. Leverage existing identity stores.",
    "Social Login: Enable login with social providers like Facebook, Twitter, and LinkedIn. Simplify user onboarding.",
    "Multi-Factor Authentication: Support for OTP, SMS, and hardware tokens. Strengthen account security.",
    "Fine-Grained Authorization: Role-based access control with custom policies and permissions. Control resource access precisely.",
    "Admin Console: Web-based interface for managing users, roles, and realms. Centralize identity administration.",
    "User Account Management: Self-service account management with password reset and profile updates. Empower users to manage accounts.",
    "Customizable Themes: Brand login pages and emails with custom themes. Match your organization's identity.",
    "Event Logging: Comprehensive audit logs of authentication and admin events. Track security-relevant activities.",
    "Client Adapters: Official adapters for Java, JavaScript, and other platforms. Easy application integration.",
    "High Availability: Clustering support for scalable, fault-tolerant deployments. Run at enterprise scale."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
