{
  "name": "kimai",
  "slug": "kimai",
  "tagline": null,
  "description": "Kimai is a web based time tracking application for individuals and teams. It logs working hours against projects and activities, produces invoices and reports, and can be self hosted for agencies or freelancers needing detailed time records.",
  "categories": [
    55
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "2.44.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-20",
    "date_last_commit": "2025-12-12",
    "github_stars": 4313
  },
  "resources": {
    "website": "https://www.kimai.org",
    "documentation": "https://github.com/kimai/kimai",
    "source_code": "https://github.com/kimai/kimai",
    "logo": "/icons/kimai.webp",
    "issues": "https://github.com/kimai/kimai/issues",
    "releases": "https://github.com/kimai/kimai/releases"
  },
  "features": [
    "Time Tracking: Log work hours against projects and activities with start/stop timer. Record time spent accurately.",
    "Project Management: Organize work into projects, activities, and tasks. Structure time tracking logically.",
    "Invoicing: Generate invoices from tracked time with customizable templates. Turn hours into revenue.",
    "Client Management: Manage clients, billing rates, and contact information. Organize customer relationships.",
    "Team Timesheets: Multi-user support with individual and team timesheet views. Track time across organization.",
    "Reports & Analytics: Detailed time reports, project summaries, and profitability analysis. Understand productivity patterns.",
    "Expense Tracking: Record project expenses and include in invoices. Track all project costs.",
    "Budget Management: Set project budgets and track spending against limits. Control project costs.",
    "Export Data: Export timesheets and reports to Excel, PDF, and other formats. Share data with stakeholders.",
    "API Access: RESTful API for integrations and custom applications. Extend functionality as needed.",
    "Mobile Friendly: Responsive interface for time tracking on smartphones. Track time anywhere.",
    "Permissions: Role-based access control for users and teams. Secure sensitive project data."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
