{
  "name": "kitchenowl",
  "slug": "kitchenowl",
  "tagline": null,
  "description": "KitchenOwl is a self hosted grocery list and meal planning app. It manages pantry inventory, shopping lists and recipes, helping households reduce waste and coordinate food buying through shared web and mobile friendly interfaces.",
  "categories": [
    52
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v0.7.4",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-09-21",
    "date_last_commit": "2025-12-09",
    "github_stars": 2878
  },
  "resources": {
    "website": "https://kitchenowl.org/",
    "documentation": "https://github.com/TomBursch/kitchenowl",
    "source_code": "https://github.com/TomBursch/kitchenowl",
    "logo": "/icons/kitchenowl.webp",
    "issues": "https://github.com/TomBursch/kitchenowl/issues",
    "releases": "https://github.com/TomBursch/kitchenowl/releases"
  },
  "features": [
    "Shared Shopping Lists: Collaborative grocery lists synced across household members. Coordinate shopping together.",
    "Recipe Management: Store recipes with ingredients, instructions, and photos. Build your digital cookbook.",
    "Meal Planning: Plan weekly meals and automatically generate shopping lists. Reduce food waste and save time.",
    "Pantry Inventory: Track items you have at home with quantities and expiration dates. Know what's in your kitchen.",
    "Category Organization: Organize items by store sections for efficient shopping. Navigate stores systematically.",
    "Barcode Scanning: Scan product barcodes to quickly add items to lists. Speed up list creation.",
    "Recipe Scaling: Automatically adjust ingredient quantities for different serving sizes. Cook for any group size.",
    "Shopping History: Track purchase history and suggest frequently bought items. Simplify repeat shopping.",
    "Mobile Apps: Native Android app and responsive web interface. Shop with your phone.",
    "Offline Support: Use app without internet connection, sync when online. Shop anywhere without connectivity.",
    "Multi-Household: Manage multiple households with separate lists and inventories. Organize different locations.",
    "Export Recipes: Share recipes with others via export and import. Exchange favorite dishes."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": true,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
