{
  "name": "kite-kubernetes",
  "slug": "kite",
  "tagline": null,
  "description": "Kite is a self hosted knowledge base and note taking platform. It supports markdown, hierarchical organization and search, providing a simple way to document processes, ideas or internal documentation for teams.",
  "categories": [
    165
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v0.7.5",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-12",
    "date_last_commit": "2025-12-12",
    "github_stars": 1815
  },
  "resources": {
    "website": "https://github.com/zxh326/kite",
    "documentation": "https://github.com/zxh326/kite",
    "source_code": "https://github.com/zxh326/kite",
    "logo": "/icons/kite.webp",
    "issues": "https://github.com/zxh326/kite/issues",
    "releases": "https://github.com/zxh326/kite/releases"
  },
  "features": [
    "Markdown Documentation: Write documentation in markdown with syntax highlighting. Create rich content easily.",
    "Hierarchical Organization: Organize pages in nested folders and categories. Structure knowledge logically.",
    "Full-Text Search: Fast search across all documentation content. Find information quickly.",
    "Version History: Track changes to pages with complete revision history. See how documentation evolves.",
    "Multi-User: Team collaboration with user accounts and permissions. Build knowledge together.",
    "Access Control: Control who can view and edit specific pages. Secure sensitive documentation.",
    "Attachments: Upload files and images to documentation pages. Keep related resources together.",
    "Cross-Linking: Link between pages to create interconnected knowledge. Build comprehensive documentation networks.",
    "Export Options: Export documentation to PDF, HTML, or markdown. Share knowledge in various formats.",
    "Clean Interface: Distraction-free reading and editing experience. Focus on content creation.",
    "Mobile Responsive: Access documentation from any device. Read and edit on the go.",
    "API Access: Programmatic access to documentation for integrations. Automate documentation workflows."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
