{
  "name": "koel",
  "slug": "koel",
  "tagline": null,
  "description": "Koel is a web based personal music streaming server. It scans local audio files and serves them through a clean web player and mobile friendly UI, allowing users to enjoy their collection from anywhere while keeping full control of the files.",
  "categories": [
    106
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v8.1.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-27",
    "date_last_commit": "2025-12-08",
    "github_stars": 16892
  },
  "resources": {
    "website": "https://koel.dev",
    "documentation": "https://github.com/koel/koel",
    "source_code": "https://github.com/koel/koel",
    "logo": "/icons/koel.webp",
    "issues": "https://github.com/koel/koel/issues",
    "releases": "https://github.com/koel/koel/releases"
  },
  "features": [
    "Music Streaming: Stream your personal music collection from anywhere via web player. Access your library remotely.",
    "Library Scanning: Automatic music library scanning with metadata and album art fetching. Organize music effortlessly.",
    "Web Player: Beautiful, responsive web player with modern interface. Enjoy music on any device.",
    "Playlist Management: Create custom playlists and smart playlists with rules. Curate your listening experience.",
    "Queue Management: Build and manage playback queue with drag-and-drop. Control what plays next.",
    "Search & Filter: Find songs, albums, and artists quickly with advanced search. Navigate large libraries easily.",
    "Last.fm Integration: Scrobble plays to Last.fm for tracking and recommendations. Connect with music community.",
    "Multi-User: Individual user accounts with personal playlists and preferences. Share server with family.",
    "Mobile Friendly: Responsive design optimized for smartphones and tablets. Listen on the go.",
    "Audio Formats: Support for MP3, FLAC, AAC, and other common formats. Play your entire collection.",
    "Visualizer: Audio visualizer for enhanced listening experience. Watch music come alive.",
    "Keyboard Shortcuts: Control playback with keyboard shortcuts for power users. Navigate efficiently."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
