{
  "name": "koito",
  "slug": "koito",
  "tagline": null,
  "description": "Koito is a self hosted media and watch list tracker for anime and shows. It integrates with external databases, keeps track of episodes watched and organizes series, offering a simple interface for managing your watch progress.",
  "categories": [
    80
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-01",
    "github_stars": 335
  },
  "resources": {
    "website": "https://koito.io",
    "documentation": "https://github.com/gabehf/Koito",
    "source_code": "https://github.com/gabehf/Koito",
    "logo": "/icons/koito.webp",
    "issues": "https://github.com/gabehf/Koito/issues",
    "releases": null
  },
  "features": [
    "Watch Tracking: Track anime and TV show viewing progress episode by episode. Never lose your place.",
    "Episode Management: Mark episodes as watched and track completion status. Monitor viewing progress.",
    "Series Organization: Organize shows into watching, completed, and plan-to-watch lists. Structure your viewing queue.",
    "Database Integration: Fetch metadata, cover art, and information from external databases. Rich series details automatically.",
    "Automatic Updates: Get notified when new episodes are released for tracked series. Stay current with shows.",
    "Search & Discovery: Find new anime and shows to watch with search functionality. Discover content easily.",
    "Rating System: Rate series and episodes to remember your favorites. Track what you enjoyed.",
    "Statistics: View watching statistics, time spent, and completion rates. Understand your viewing habits.",
    "Calendar View: See upcoming episode releases in calendar format. Plan your watching schedule.",
    "Import & Export: Backup your watch history and migrate between services. Portable viewing data.",
    "Mobile Friendly: Responsive interface for tracking on smartphones and tablets. Update progress anywhere.",
    "Custom Lists: Create custom lists for genres, themes, or personal organization. Organize beyond standard categories."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
