{
  "name": "kometa",
  "slug": "kometa",
  "tagline": null,
  "description": "Kometa is a metadata and library management tool for Plex or related media servers. It uses configuration files and scripts to create collections, apply artwork and keep libraries organized automatically, tailored for self hosted media setups.",
  "categories": [
    100
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v2.2.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-06",
    "date_last_commit": "2025-12-12",
    "github_stars": 3066
  },
  "resources": {
    "website": "https://kometa.wiki",
    "documentation": "https://github.com/Kometa-Team/Kometa",
    "source_code": "https://github.com/Kometa-Team/Kometa",
    "logo": "/icons/kometa.webp",
    "issues": "https://github.com/Kometa-Team/Kometa/issues",
    "releases": "https://github.com/Kometa-Team/Kometa/releases"
  },
  "features": [
    "Automatic Collections: Create dynamic collections based on genres, actors, directors, and more. Organize libraries intelligently.",
    "Artwork Management: Apply posters, backgrounds, and overlays to media automatically. Keep libraries visually appealing.",
    "Metadata Enhancement: Enrich media metadata from multiple sources like TMDb and IMDb. Improve library information.",
    "YAML Configuration: Define library management rules in version-controlled YAML files. Automate maintenance declaratively.",
    "Scheduled Updates: Run maintenance tasks on schedules to keep libraries current. Set and forget automation.",
    "Template System: Use community templates or create custom ones for common patterns. Standardize library organization.",
    "Overlay Support: Add rating, resolution, and audio overlays to posters. Visual indicators for media quality.",
    "Award Collections: Automatically create collections for Oscar winners, Emmy winners, and more. Highlight acclaimed content.",
    "Trending Content: Build collections of trending movies and shows automatically. Discover what's popular.",
    "Multi-Library: Manage multiple Plex libraries from single configuration. Centralize library automation.",
    "Dry Run Mode: Preview changes before applying to libraries. Test configurations safely.",
    "Detailed Logging: Comprehensive logs of all operations and changes. Track what Kometa does."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
