{
  "name": "komodo",
  "slug": "komodo",
  "tagline": null,
  "description": "Komodo is a modern web based status page and incident management platform. It allows teams to display service health, schedule maintenance and communicate outages, running fully self hosted for privacy conscious organizations.",
  "categories": [
    146
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v1.19.5",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-09-27",
    "date_last_commit": "2025-12-13",
    "github_stars": 8953
  },
  "resources": {
    "website": "https://komo.do",
    "documentation": "https://github.com/moghtech/komodo",
    "source_code": "https://github.com/moghtech/komodo",
    "logo": "/icons/komodo.webp",
    "issues": "https://github.com/moghtech/komodo/issues",
    "releases": "https://github.com/moghtech/komodo/releases"
  },
  "features": [
    "Status Pages: Public-facing status pages showing service health and uptime. Keep users informed about availability.",
    "Incident Management: Create, update, and resolve incidents with timeline tracking. Manage outages transparently.",
    "Maintenance Scheduling: Schedule and communicate planned maintenance windows. Set user expectations proactively.",
    "Service Monitoring: Monitor services with health checks and uptime tracking. Detect issues automatically.",
    "Component Groups: Organize services into logical groups and categories. Structure status page clearly.",
    "Subscriber Notifications: Email and webhook notifications for incidents and updates. Alert stakeholders automatically.",
    "Custom Branding: Customize status page appearance with logos and colors. Match your brand identity.",
    "Historical Data: View incident history and uptime statistics over time. Track reliability trends.",
    "Multi-Language: Support for multiple languages on status pages. Serve international audiences.",
    "API Access: Programmatic incident management and status updates. Automate status communication.",
    "Self-Hosted: Complete control over status page infrastructure and data. Own your communication platform.",
    "Metrics Display: Show response times and performance metrics on status page. Provide transparency beyond uptime."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
