{
  "name": "kontoj",
  "slug": "kontoj",
  "tagline": "",
  "description": "Kontoj is a self hosted accounting and finance management system focused on double entry bookkeeping. It allows recording transactions, accounts and various reports to support small business or personal finance workflows.",
  "categories": [
    5
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v2.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2024-07-29",
    "date_last_commit": "2024-07-29",
    "github_stars": 8
  },
  "resources": {
    "website": "https://kontoj.galaksio.tech",
    "documentation": "https://kontoj.galaksio.tech",
    "source_code": "https://github.com/galaksiotech/kontoj",
    "logo": "/icons/kontoj.webp",
    "issues": "https://github.com/galaksiotech/kontoj/issues",
    "releases": "https://github.com/galaksiotech/kontoj/releases"
  },
  "features": [
    "Double-Entry Bookkeeping: Accurate accounting with double-entry transaction recording. Professional financial records.",
    "Account Management: Chart of accounts with customizable account types and categories. Organize finances logically.",
    "Transaction Recording: Record income, expenses, and transfers with detailed entries. Track all financial activity.",
    "Financial Reports: Generate balance sheets, income statements, and cash flow reports. Understand financial position.",
    "Invoice Management: Create and track invoices for clients and customers. Manage accounts receivable.",
    "Expense Tracking: Record and categorize business expenses with receipts. Monitor spending patterns.",
    "Client Management: Maintain client database with contact and billing information. Organize customer relationships.",
    "Multi-Currency: Support for multiple currencies with exchange rate tracking. Handle international transactions.",
    "Bank Reconciliation: Match transactions with bank statements for accuracy. Ensure books are correct.",
    "Tax Reporting: Generate tax reports and summaries for filing. Simplify tax preparation.",
    "Audit Trail: Complete history of all transactions and changes. Maintain accountability.",
    "Export Data: Export financial data to CSV, PDF, and other formats. Share with accountants or stakeholders."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
