{
  "name": "kopia",
  "slug": "kopia",
  "tagline": null,
  "description": "Kopia is an open source backup tool for files and snapshots. It supports encryption, deduplication and multiple storage backends, with both CLI and web UI, enabling safe incremental backups on self hosted infrastructure.",
  "categories": [
    18
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v0.22.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-02",
    "date_last_commit": "2025-12-09",
    "github_stars": 12010
  },
  "resources": {
    "website": "https://kopia.io",
    "documentation": "https://github.com/kopia/kopia",
    "source_code": "https://github.com/kopia/kopia",
    "logo": "/icons/kopia.webp",
    "issues": "https://github.com/kopia/kopia/issues",
    "releases": "https://github.com/kopia/kopia/releases"
  },
  "features": [
    "Encrypted Backups: End-to-end AES-256 encryption with password or key-based protection. Secure your backup data completely.",
    "Deduplication: Content-based deduplication for space-efficient storage. Save storage with smart compression.",
    "Incremental Backups: Fast incremental backups that only store changed data. Minimize backup time and storage.",
    "Multiple Backends: Support for S3, Azure, Google Cloud, local drives, and more. Backup to any destination.",
    "Snapshot Management: Create point-in-time snapshots with retention policies. Maintain backup history efficiently.",
    "Fast Restores: Quick file and directory restoration from any snapshot. Recover data when needed.",
    "Web UI: Browser-based interface for backup management and monitoring. Manage backups visually.",
    "CLI Tools: Powerful command-line interface for automation and scripting. Integrate with existing workflows.",
    "Scheduled Backups: Automatic backups on schedules with policy-based retention. Set and forget protection.",
    "Compression: Built-in compression to reduce backup size and transfer time. Optimize storage usage.",
    "Cross-Platform: Support for Windows, macOS, and Linux systems. Backup any platform.",
    "Verification: Automatic backup verification to ensure data integrity. Trust your backups are valid."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
