{
  "name": "krakend",
  "slug": "krakend",
  "tagline": null,
  "description": "KrakenD CE is an API gateway and aggregator that sits in front of microservices. It combines and transforms responses, handles rate limiting and authentication, and lets teams define configurations as code for scalable API front ends.",
  "categories": [
    137
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v2.12.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-27",
    "date_last_commit": "2025-11-20",
    "github_stars": 2477
  },
  "resources": {
    "website": "https://www.krakend.io",
    "documentation": "https://github.com/krakend/krakend-ce",
    "source_code": "https://github.com/krakend/krakend-ce",
    "logo": "/icons/krakend.webp",
    "issues": "https://github.com/krakend/krakend-ce/issues",
    "releases": "https://github.com/krakend/krakend-ce/releases"
  },
  "features": [
    "API Gateway: Unified entry point for microservices with request routing. Simplify API architecture.",
    "Response Aggregation: Combine multiple backend responses into single API call. Reduce client requests.",
    "Response Transformation: Modify, filter, and reshape API responses. Customize data for clients.",
    "High Performance: Ultra-fast request processing with low latency and high throughput. Handle massive traffic.",
    "Rate Limiting: Protect backends with configurable rate limits per endpoint. Prevent abuse and overload.",
    "Authentication: JWT validation, OAuth2, and API key authentication. Secure API access.",
    "Caching: Built-in response caching to reduce backend load. Improve performance dramatically.",
    "Load Balancing: Distribute requests across multiple backend instances. Ensure high availability.",
    "Circuit Breaker: Automatic failure detection and recovery for resilient APIs. Handle backend failures gracefully.",
    "Configuration as Code: JSON-based declarative configuration with version control. Define APIs programmatically.",
    "Monitoring: Built-in metrics and logging for observability. Track API performance and usage.",
    "Plugin System: Extend functionality with custom plugins and middleware. Adapt to specific needs."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
