{
  "name": "kuvasz",
  "slug": "kuvasz",
  "tagline": null,
  "description": "Kuvasz is an uptime monitoring and incident notification service. It regularly checks endpoints, records availability metrics and sends alerts when services go down, providing a central dashboard for small to medium infrastructures.",
  "categories": [
    173
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "3.3.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-11",
    "date_last_commit": "2025-12-12",
    "github_stars": 463
  },
  "resources": {
    "website": "https://kuvasz-uptime.dev/",
    "documentation": "https://github.com/kuvasz-uptime/kuvasz",
    "source_code": "https://github.com/kuvasz-uptime/kuvasz",
    "logo": "/icons/kuvasz.webp",
    "issues": "https://github.com/kuvasz-uptime/kuvasz/issues",
    "releases": "https://github.com/kuvasz-uptime/kuvasz/releases"
  },
  "features": [
    "Uptime Monitoring: Regular health checks for endpoints with availability tracking. Monitor service uptime continuously.",
    "Response Time Tracking: Measure and graph response times for performance monitoring. Identify slow services.",
    "Incident Detection: Automatic downtime detection with incident creation. Know when services fail.",
    "Alert Notifications: Email and webhook notifications for downtime events. Get notified immediately.",
    "Escalation Policies: Configure alert escalation for critical services. Ensure issues are addressed.",
    "Status Dashboard: Central view of all monitored services and their status. Track infrastructure health.",
    "Historical Data: View uptime history and incident reports over time. Analyze reliability trends.",
    "SSL Monitoring: Check SSL certificate validity and expiration dates. Prevent certificate issues.",
    "Multi-Protocol: Monitor HTTP, HTTPS, TCP, and ICMP endpoints. Support various service types.",
    "Check Intervals: Configure monitoring frequency per endpoint. Balance accuracy and resource usage.",
    "Maintenance Windows: Schedule maintenance periods to suppress alerts. Avoid false alarms.",
    "API Access: Programmatic monitoring management and status queries. Integrate with existing tools."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
