{
  "name": "kyoo",
  "slug": "kyoo",
  "tagline": null,
  "description": "Kyoo is a self hosted video server built with a focus on anime and TV series. It scans libraries, pulls metadata and lets users browse and stream content from a responsive web front end tailored to large episodic collections.",
  "categories": [
    100
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v4.7.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-01-05",
    "date_last_commit": "2025-12-12",
    "github_stars": 2255
  },
  "resources": {
    "website": "https://kyoo.zoriya.dev",
    "documentation": "https://github.com/zoriya/Kyoo",
    "source_code": "https://github.com/zoriya/Kyoo",
    "logo": "/icons/kyoo.webp",
    "issues": "https://github.com/zoriya/Kyoo/issues",
    "releases": "https://github.com/zoriya/Kyoo/releases"
  },
  "features": [
    "Video Streaming: Stream anime, TV series, and movies from self-hosted library. Your personal streaming server.",
    "Library Scanning: Automatic media library scanning with metadata fetching. Organize content effortlessly.",
    "Metadata Integration: Fetch information from TMDb, AniList, and other sources. Rich content details.",
    "Episode Tracking: Track watch progress for episodic content automatically. Resume where you left off.",
    "Web Player: Modern, responsive video player with subtitle support. Watch on any device.",
    "Mobile Apps: Native Android app for mobile viewing. Stream on the go.",
    "Multi-User: Individual user accounts with separate watch history. Share library with family.",
    "Collections: Organize content into custom collections and playlists. Curate viewing experience.",
    "Search & Filter: Find content quickly with advanced search and filters. Navigate large libraries.",
    "Transcoding: On-the-fly video transcoding for compatibility. Play on any device.",
    "Subtitle Support: Multiple subtitle tracks with customizable appearance. Watch in any language.",
    "Continue Watching: Quick access to in-progress content from homepage. Resume viewing easily."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": true,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
