{
  "name": "mayan-edms",
  "slug": "mayan-edms",
  "tagline": "",
  "description": "Mayan EDMS is an enterprise-grade electronic document management system with OCR, metadata extraction, and workflow automation. It’s designed for archival, search, and compliance needs in self-hosted environments.",
  "categories": [
    48
  ],
  "metadata": {
    "sponsored": false,
    "license": null,
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": null,
    "github_stars": null
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://gitlab.com/mayan-edms/mayan-edms",
    "logo": "/icons/mayan-edms.webp",
    "issues": null,
    "releases": null,
    "logo_light": "/icons/mayan-edms-light.webp"
  },
  "features": [
    "OCR processing: Automatically extract text from scanned documents for full-text search and indexing.",
    "Metadata extraction: Capture document properties, dates, and custom metadata for organization.",
    "Workflow automation: Define document processing workflows with approval chains and notifications.",
    "Version control: Track document revisions with complete history and ability to restore previous versions.",
    "Access control: Set granular permissions on documents and folders based on users and groups.",
    "Full-text search: Find documents quickly by searching through content, metadata, and tags.",
    "Document tagging: Apply multiple tags to documents for flexible categorization and filtering.",
    "Cabinet organization: Structure documents in hierarchical cabinets and folders like physical filing.",
    "Retention policies: Automatically manage document lifecycle with configurable retention rules.",
    "Digital signatures: Sign documents electronically with support for various signature standards.",
    "API integration: Automate document management tasks through comprehensive REST API.",
    "Multi-format support: Handle PDF, images, Office documents, and many other file types."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
