{
  "name": "miniboard",
  "slug": "miniboard",
  "tagline": "",
  "description": "Miniboard is a self-hosted browser-based dashboard that allows users to display custom text, stats, or system information. It’s highly lightweight, works via configuration files, and is ideal for homelabs.",
  "categories": [
    34
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "1.2.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2023-12-24",
    "date_last_commit": "2023-12-24",
    "github_stars": 234
  },
  "resources": {
    "website": "https://hub.docker.com/r/aceberg/miniboard",
    "documentation": "https://hub.docker.com/r/aceberg/miniboard",
    "source_code": "https://github.com/aceberg/miniboard",
    "logo": "/icons/miniboard.webp",
    "issues": "https://github.com/aceberg/miniboard/issues",
    "releases": "https://github.com/aceberg/miniboard/releases"
  },
  "features": [
    "Custom Widgets: Create personalized dashboard widgets displaying system stats, weather, or custom text content.",
    "Configuration Files: Set up dashboards through simple YAML or JSON configuration without complex setup processes.",
    "Lightweight Design: Run efficiently with minimal resource usage, perfect for Raspberry Pi and low-power devices.",
    "Real-time Updates: Display live system information and metrics with automatic refresh intervals.",
    "Responsive Layout: Adapt dashboard layout automatically for desktop, tablet, and mobile viewing experiences.",
    "Theme Customization: Apply custom colors, fonts, and styling to match personal preferences or branding.",
    "Multi-board Support: Create multiple dashboard configurations for different purposes or user groups.",
    "Quick Setup: Deploy and configure within minutes using Docker or standalone binaries.",
    "System Monitoring: Track CPU, memory, disk usage, and network statistics in real-time widgets.",
    "External Data: Integrate with APIs and external services to display custom metrics and information.",
    "No Database: Operate without external dependencies using file-based configuration for maximum simplicity.",
    "Auto-refresh: Configure automatic page refresh intervals to keep information current without manual intervention."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
