{
  "name": "misskey",
  "slug": "misskey",
  "tagline": null,
  "description": "Misskey is a modern, decentralized social media platform built with ActivityPub. It supports real-time interactions, reactions, custom emoji, themes, and federation across servers.",
  "categories": [
    148
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "2025.12.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-06",
    "date_last_commit": "2025-12-12",
    "github_stars": 10862
  },
  "resources": {
    "website": "https://misskey-hub.net/",
    "documentation": "https://github.com/misskey-dev/misskey",
    "source_code": "https://github.com/misskey-dev/misskey",
    "logo": "/icons/misskey.webp",
    "issues": "https://github.com/misskey-dev/misskey/issues",
    "releases": "https://github.com/misskey-dev/misskey/releases",
    "logo_light": "/icons/misskey-light.webp"
  },
  "features": [
    "Decentralized Social: ActivityPub-based federation allowing communication across different Misskey and Mastodon instances.",
    "Real-time Interactions: Live timeline updates, instant notifications, and real-time chat functionality.",
    "Custom Reactions: Express yourself with custom emoji reactions beyond traditional likes and shares.",
    "Rich Media Support: Share images, videos, audio files, and documents with built-in media viewer and gallery.",
    "Advanced Timeline: Multiple timeline views including local, federated, and custom lists with filtering options.",
    "Theme Customization: Extensive theming system with custom CSS support and community-created themes.",
    "Note Formatting: Rich text editing with Markdown support, mentions, hashtags, and content warnings.",
    "Privacy Controls: Granular privacy settings for posts including follower-only, unlisted, and direct messages.",
    "Moderation Tools: Comprehensive moderation features including content filtering, user blocking, and instance management.",
    "API Integration: Full REST API for third-party clients, bots, and custom integrations.",
    "Drive Storage: Built-in file storage system for managing uploaded media and documents with organization features.",
    "Community Features: Create and manage communities, polls, and events with advanced engagement tools."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
