{
  "name": "mkcert-web-ui",
  "slug": "mkcert-web-ui",
  "tagline": null,
  "description": "mkcertWeb is a browser-based interface built over mkcert to create local SSL certificates easily. It wraps certificate generation into a clean UI to simplify development environment setup.",
  "categories": [
    117
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v3.1.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-09",
    "date_last_commit": "2025-12-07",
    "github_stars": 191
  },
  "resources": {
    "website": "https://github.com/jeffcaldwellca/mkcertWeb",
    "documentation": "https://github.com/jeffcaldwellca/mkcertWeb",
    "source_code": "https://github.com/jeffcaldwellca/mkcertWeb",
    "logo": "/icons/mkcert-web-ui.webp",
    "issues": "https://github.com/jeffcaldwellca/mkcertWeb/issues",
    "releases": "https://github.com/jeffcaldwellca/mkcertWeb/releases"
  },
  "features": [
    "Certificate Generation: Create local SSL certificates for development environments through a simple web interface.",
    "Domain Management: Generate certificates for multiple domains and subdomains with wildcard support.",
    "Browser Integration: Automatically install root certificates in system trust stores for seamless HTTPS development.",
    "Development Workflow: Streamline local development setup with one-click certificate creation and installation.",
    "Certificate Authority: Manage your own local certificate authority for consistent development environment security.",
    "Export Options: Download certificates in various formats including PEM, CRT, and KEY files for different applications.",
    "Batch Processing: Generate multiple certificates simultaneously for complex development environments.",
    "Visual Interface: User-friendly web UI that simplifies the mkcert command-line tool for non-technical users.",
    "Security Best Practices: Follow industry standards for certificate generation and key management in development.",
    "Cross-platform Support: Works across Windows, macOS, and Linux development environments consistently.",
    "Integration Ready: Easy integration with Docker, Nginx, Apache, and other development tools and containers.",
    "Localhost Testing: Perfect for testing HTTPS functionality on localhost and local network development servers."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
