{
  "name": "mybibliotecha",
  "slug": "mybibliotheca",
  "tagline": null,
  "description": "MyBibliotheca is a self-hosted book collection manager. It provides tagging, metadata editing, and search features to organize large book libraries with a simple web UI.",
  "categories": [
    21
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "2.1.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-29",
    "date_last_commit": "2025-12-12",
    "github_stars": 496
  },
  "resources": {
    "website": "https://github.com/pickles4evaaaa/mybibliotheca",
    "documentation": "https://github.com/pickles4evaaaa/mybibliotheca",
    "source_code": "https://github.com/pickles4evaaaa/mybibliotheca",
    "logo": "/icons/mybibliotheca.webp",
    "issues": "https://github.com/pickles4evaaaa/mybibliotheca/issues",
    "releases": "https://github.com/pickles4evaaaa/mybibliotheca/releases"
  },
  "features": [
    "Book Cataloging: Organize personal book collections with detailed metadata, covers, and custom categorization systems.",
    "Advanced Search: Find books quickly using title, author, genre, tags, or custom metadata with powerful filtering options.",
    "Metadata Editing: Modify book information, add custom tags, and update details through an intuitive web interface.",
    "Cover Management: Upload and manage book cover images with automatic resizing and optimization features.",
    "Tag System: Create custom tags and categories to organize books by genre, reading status, or personal preferences.",
    "Reading Lists: Build and manage reading lists, wishlists, and custom collections for better library organization.",
    "Import Tools: Bulk import book data from CSV files, ISBN lookups, or other library management systems.",
    "Web Interface: Access your library from any device through a clean, responsive web-based interface.",
    "Backup Export: Export library data in multiple formats for backup purposes or migration to other systems.",
    "Multi-user Support: Share libraries with family members while maintaining individual reading lists and preferences.",
    "Statistics Dashboard: View reading statistics, collection insights, and progress tracking with visual charts.",
    "Mobile Friendly: Browse and manage your book collection seamlessly on smartphones and tablets."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
