{
  "name": "mylar3",
  "slug": "mylar3",
  "tagline": null,
  "description": "Mylar3 is an automated comic book downloader and manager. It can monitor series, download issues, and organize comic archives with integration for download clients and metadata tools.",
  "categories": [
    21
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v0.8.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-08-17",
    "date_last_commit": "2025-10-07",
    "github_stars": 1319
  },
  "resources": {
    "website": "https://github.com/mylar3/mylar3",
    "documentation": "https://github.com/mylar3/mylar3",
    "source_code": "https://github.com/mylar3/mylar3",
    "logo": "/icons/mylar3.webp",
    "issues": "https://github.com/mylar3/mylar3/issues",
    "releases": "https://github.com/mylar3/mylar3/releases"
  },
  "features": [
    "Series Monitoring: Automatically track comic book series and monitor for new issue releases across multiple sources.",
    "Download Automation: Integrate with download clients like SABnzbd and NZBGet for automated comic book downloading.",
    "Metadata Management: Fetch and organize comic metadata including covers, descriptions, and publication information.",
    "Archive Organization: Automatically rename and organize comic files using customizable naming conventions and folder structures.",
    "Quality Control: Set preferred quality settings and automatically upgrade comics when better versions become available.",
    "Reading Lists: Create and manage pull lists, reading queues, and custom collections for better library organization.",
    "Web Interface: Manage your comic collection through a responsive web-based interface accessible from any device.",
    "Search Integration: Connect with multiple comic databases and indexers to find and download missing issues.",
    "Notification System: Receive alerts for new releases, download completions, and system events via email or webhooks.",
    "Statistics Dashboard: View collection statistics, download history, and reading progress with detailed analytics.",
    "Multi-format Support: Handle various comic archive formats including CBZ, CBR, and PDF files.",
    "Backup Tools: Export library data and create backups of your comic collection metadata and settings."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
