{
  "name": "netbird",
  "slug": "netbird",
  "tagline": null,
  "description": "NetBird is a self-hosted WireGuard-based mesh VPN solution that simplifies secure networking across devices. It features identity-based access controls and a web UI for managing peers and networks.",
  "categories": [
    174
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "v0.60.7",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-04",
    "date_last_commit": "2025-12-12",
    "github_stars": 20143
  },
  "resources": {
    "website": "https://netbird.io",
    "documentation": "https://github.com/netbirdio/netbird",
    "source_code": "https://github.com/netbirdio/netbird",
    "logo": "/icons/netbird.webp",
    "issues": "https://github.com/netbirdio/netbird/issues",
    "releases": "https://github.com/netbirdio/netbird/releases"
  },
  "features": [
    "WireGuard-based VPN: Fast, secure mesh networking using modern WireGuard protocol for peer-to-peer connections.",
    "Zero-config setup: Automatic peer discovery and connection without manual WireGuard configuration.",
    "Identity-based access: Integrate with SSO providers like Okta, Auth0, or Google for user authentication.",
    "Network policies: Define access rules and segmentation to control which peers can communicate.",
    "Cross-platform clients: Native apps for Linux, Windows, macOS, iOS, and Android devices.",
    "NAT traversal: Connect devices behind firewalls and NAT without port forwarding or public IPs.",
    "Web management UI: Configure networks, manage peers, and view connection status from a browser.",
    "Activity monitoring: Track peer connections, data transfer, and network events in real-time.",
    "Automatic routing: Dynamic route management ensures traffic flows through the optimal path.",
    "Self-hosted control: Run your own management server for complete data sovereignty and privacy.",
    "Group management: Organize peers into groups for simplified policy application and access control.",
    "API access: Automate network management and integrate with existing infrastructure via REST API."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
