{
  "name": "netdata",
  "slug": "netdata",
  "tagline": null,
  "description": "Netdata is a real-time performance monitoring platform for servers, containers, and applications. It provides actionable dashboards with alerts and metrics, supporting both self-hosted and SaaS deployments.",
  "categories": [
    103
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v2.8.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-03",
    "date_last_commit": "2025-12-13",
    "github_stars": 76975
  },
  "resources": {
    "website": "https://www.netdata.cloud",
    "documentation": "https://github.com/netdata/netdata",
    "source_code": "https://github.com/netdata/netdata",
    "logo": "/icons/netdata.webp",
    "issues": "https://github.com/netdata/netdata/issues",
    "releases": "https://github.com/netdata/netdata/releases"
  },
  "features": [
    "Real-time monitoring: Per-second metric collection and visualization for immediate system insights.",
    "Comprehensive metrics: Track CPU, memory, disk, network, applications, and custom metrics automatically.",
    "Interactive dashboards: Drill down into metrics with zoom, pan, and correlation features for analysis.",
    "Anomaly detection: Machine learning algorithms identify unusual patterns and potential issues.",
    "Alert notifications: Configure alerts with multiple channels including email, Slack, PagerDuty, and webhooks.",
    "Zero configuration: Auto-detects services and starts monitoring immediately after installation.",
    "Low overhead: Efficient C implementation uses minimal CPU and memory while collecting thousands of metrics.",
    "Distributed monitoring: Aggregate metrics from multiple nodes into centralized dashboards.",
    "Health monitoring: Built-in checks for common issues with actionable recommendations.",
    "Container support: Monitor Docker, Kubernetes, and other containerized environments natively.",
    "Plugin ecosystem: Extend monitoring with custom collectors for applications and services.",
    "Historical data: Store and query metrics over time for trend analysis and capacity planning."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
