{
  "name": "odoo",
  "slug": "odoo",
  "tagline": null,
  "description": "Odoo is an open-source suite of business apps including CRM, accounting, inventory, manufacturing, HR, and e-commerce. It can be self-hosted or used via SaaS with a powerful admin UI and thousands of modules.",
  "categories": [
    52
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-13",
    "github_stars": 47803
  },
  "resources": {
    "website": "https://www.odoo.com",
    "documentation": "https://github.com/odoo/odoo",
    "source_code": "https://github.com/odoo/odoo",
    "logo": "/icons/odoo.webp",
    "issues": "https://github.com/odoo/odoo/issues",
    "releases": null
  },
  "features": [
    "Business Suite: Comprehensive ERP solution covering CRM, accounting, inventory, HR, and project management in one platform.",
    "Modular Architecture: Install only needed modules from thousands of available apps to customize functionality for specific business needs.",
    "CRM Integration: Manage leads, opportunities, and customer relationships with automated workflows and communication tracking.",
    "Accounting System: Handle invoicing, payments, financial reporting, and tax management with multi-currency support.",
    "Inventory Management: Track stock levels, manage warehouses, and automate procurement with barcode scanning capabilities.",
    "E-commerce Platform: Build online stores with integrated payment processing, shipping, and inventory synchronization.",
    "Manufacturing Tools: Plan production, manage bills of materials, and track work orders with quality control processes.",
    "HR Management: Handle employee records, payroll, time tracking, and recruitment through integrated HR modules.",
    "Project Management: Plan projects, track tasks, manage resources, and monitor progress with Gantt charts and reporting.",
    "Custom Development: Extend functionality with custom modules using Python and XML development frameworks.",
    "Multi-company Support: Manage multiple companies or subsidiaries within a single Odoo instance with shared resources.",
    "Advanced Reporting: Generate detailed business reports and analytics with customizable dashboards and KPI tracking."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
