{
  "name": "omnitools",
  "slug": "omnitools",
  "tagline": null,
  "description": "Omni Tools is a lightweight toolbox web app offering JSON viewer, URL encoder, image compressor, and more utilities for developers or productivity enthusiasts in a self-hosted environment.",
  "categories": [
    165
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.6.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-02",
    "date_last_commit": "2025-12-10",
    "github_stars": 7795
  },
  "resources": {
    "website": "https://omnitools.app",
    "documentation": "https://github.com/iib0011/omni-tools",
    "source_code": "https://github.com/iib0011/omni-tools",
    "logo": "/icons/omnitools.webp",
    "issues": "https://github.com/iib0011/omni-tools/issues",
    "releases": "https://github.com/iib0011/omni-tools/releases"
  },
  "features": [
    "Developer Utilities: Collection of essential tools including JSON formatter, URL encoder, hash generators, and text converters.",
    "Image Processing: Compress, resize, and convert images between formats with quality controls and batch processing.",
    "Text Tools: Format, validate, and transform text with regex testing, case conversion, and encoding utilities.",
    "Code Formatters: Beautify and minify code in multiple languages including JSON, XML, CSS, and JavaScript.",
    "Hash Generators: Create MD5, SHA-1, SHA-256, and other cryptographic hashes for security and verification purposes.",
    "Base64 Encoding: Encode and decode Base64 strings with support for files and text content.",
    "QR Code Generator: Create customizable QR codes with different sizes, error correction levels, and output formats.",
    "Color Utilities: Convert between color formats, generate palettes, and extract colors from images.",
    "Password Generator: Create secure passwords with customizable length, character sets, and complexity requirements.",
    "Timestamp Converter: Convert between different timestamp formats and time zones with human-readable output.",
    "URL Utilities: Encode, decode, and parse URLs with parameter extraction and validation features.",
    "Lightweight Interface: Fast, responsive web interface that works offline without external dependencies or tracking."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
