{
  "name": "opengist",
  "slug": "opengist",
  "tagline": null,
  "description": "OpenGist is a self-hosted alternative to GitHub Gist. It lets users create and manage code snippets with syntax highlighting, versioning, and a web-based editor.",
  "categories": [
    72
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v1.11.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-09-30",
    "date_last_commit": "2025-10-31",
    "github_stars": 2849
  },
  "resources": {
    "website": "https://opengist.io",
    "documentation": "https://github.com/thomiceli/opengist",
    "source_code": "https://github.com/thomiceli/opengist",
    "logo": "/icons/opengist.webp",
    "issues": "https://github.com/thomiceli/opengist/issues",
    "releases": "https://github.com/thomiceli/opengist/releases"
  },
  "features": [
    "Code Snippets: Create and manage code snippets with syntax highlighting for over 100 programming languages.",
    "Version Control: Track changes to snippets with Git-based versioning and diff visualization.",
    "Web Editor: Edit code directly in the browser with syntax highlighting, auto-completion, and keyboard shortcuts.",
    "Public/Private Gists: Control snippet visibility with public sharing or private access for sensitive code.",
    "Fork and Clone: Fork existing snippets to create variations and clone repositories for local development.",
    "Search Engine: Find snippets quickly using full-text search across code content, titles, and descriptions.",
    "User Management: Support multiple users with individual accounts, profiles, and snippet collections.",
    "API Access: Programmatic access to all functionality through REST APIs for automation and integration.",
    "Embed Support: Embed snippets in external websites and documentation with customizable styling.",
    "Raw File Access: Direct access to raw snippet content for command-line tools and automated processing.",
    "Comment System: Add comments and discussions to snippets for collaboration and code review.",
    "Export Options: Download snippets as files or archives for backup and offline access."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
