{
  "name": "openspeedtest",
  "slug": "openspeedtest",
  "tagline": null,
  "description": "OpenSpeedTest is a self-hosted internet speed test tool with a responsive web interface. It measures download, upload, and latency through your browser without plugins or dependencies.",
  "categories": [
    150
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2024-06-04",
    "github_stars": 3246
  },
  "resources": {
    "website": "https://openspeedtest.com",
    "documentation": "https://github.com/openspeedtest/Speed-Test",
    "source_code": "https://github.com/openspeedtest/Speed-Test",
    "logo": "/icons/openspeedtest.webp",
    "issues": "https://github.com/openspeedtest/Speed-Test/issues",
    "releases": "https://github.com/openspeedtest/Speed-Test/releases"
  },
  "features": [
    "Speed Testing: Measure internet download and upload speeds directly through your web browser without plugins.",
    "Latency Measurement: Test network latency and ping times to assess connection quality and responsiveness.",
    "Self-hosted Solution: Run your own speed test server for internal network testing and bandwidth monitoring.",
    "Responsive Interface: Clean, mobile-friendly web interface that works across all devices and screen sizes.",
    "Real-time Results: View live speed test progress with real-time graphs and instant result display.",
    "Multiple Protocols: Support for various testing protocols to ensure accurate measurements across different network conditions.",
    "Historical Data: Store and compare speed test results over time to track network performance trends.",
    "Custom Configuration: Adjust test parameters including duration, file sizes, and server endpoints for specific needs.",
    "API Integration: Programmatic access to speed testing functionality for automated monitoring and reporting systems.",
    "Network Diagnostics: Additional network diagnostic tools including jitter measurement and packet loss detection.",
    "Multi-server Testing: Test against multiple servers simultaneously to identify the best connection paths.",
    "Privacy Focused: No external dependencies or data collection, ensuring complete privacy for network testing."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
