{
  "name": "an-otter-wiki",
  "slug": "otter-wiki",
  "tagline": null,
  "description": "OtterWiki is a lightweight self-hosted wiki engine with a modern UI and Git-based storage. It supports Markdown, version control, and collaborative editing with user access controls.",
  "categories": [
    193
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v2.14.4",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-06",
    "date_last_commit": "2025-12-06",
    "github_stars": 1175
  },
  "resources": {
    "website": "https://otterwiki.com",
    "documentation": "https://github.com/redimp/otterwiki",
    "source_code": "https://github.com/redimp/otterwiki",
    "logo": "/icons/otter-wiki.webp",
    "issues": "https://github.com/redimp/otterwiki/issues",
    "releases": "https://github.com/redimp/otterwiki/releases"
  },
  "features": [
    "Markdown Support: Write and edit pages using Markdown syntax with live preview and syntax highlighting.",
    "Git Integration: Store all content in Git repositories with automatic version control and change tracking.",
    "Modern Interface: Clean, responsive web interface optimized for both desktop and mobile editing experiences.",
    "User Management: Control access with user accounts, permissions, and role-based editing capabilities.",
    "Page History: View complete revision history with diff comparisons and easy rollback to previous versions.",
    "Search Functionality: Find content quickly with full-text search across all wiki pages and attachments.",
    "File Attachments: Upload and manage images, documents, and other files with automatic linking and organization.",
    "Collaborative Editing: Enable multiple users to edit and contribute content with conflict resolution and merge capabilities.",
    "Custom Themes: Customize appearance with themes and CSS modifications to match organizational branding.",
    "Export Options: Export wiki content to various formats including PDF, HTML, and Markdown for offline use.",
    "Lightweight Design: Run efficiently with minimal resource requirements, perfect for small teams and personal use.",
    "Plugin System: Extend functionality with plugins for additional features like diagrams, charts, and integrations."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
