{
  "name": "owlistic",
  "slug": "owlistic",
  "tagline": "",
  "description": "Owlistic is a self-hosted note and knowledge management app designed for hierarchical organization. It features Markdown support, linked notes, and a responsive web interface for personal documentation.",
  "categories": [
    111
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v0.2.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-05-30",
    "date_last_commit": "2025-12-03",
    "github_stars": 411
  },
  "resources": {
    "website": "https://owlistic-notes.github.io/owlistic/",
    "documentation": "https://owlistic-notes.github.io/owlistic/",
    "source_code": "https://github.com/owlistic-notes/owlistic",
    "logo": "/icons/owlistic.webp",
    "issues": "https://github.com/owlistic-notes/owlistic/issues",
    "releases": "https://github.com/owlistic-notes/owlistic/releases"
  },
  "features": [
    "Hierarchical Notes: Organize knowledge in tree-like structures with nested folders and sub-categories for logical organization.",
    "Markdown Support: Write and format notes using Markdown syntax with live preview and syntax highlighting.",
    "Linked Notes: Create connections between notes with bidirectional linking and relationship visualization.",
    "Search Engine: Full-text search across all notes with advanced filtering and tag-based discovery.",
    "Knowledge Graph: Visualize note relationships and connections with interactive graph views and navigation.",
    "Version History: Track changes to notes with version control and easy rollback to previous versions.",
    "Tag System: Organize content with flexible tagging system and tag-based filtering and categorization.",
    "Export Options: Export notes and knowledge bases to various formats including PDF, HTML, and Markdown.",
    "Responsive Design: Access and edit notes seamlessly across desktop, tablet, and mobile devices.",
    "Privacy Focused: Self-hosted solution ensuring complete control over personal knowledge and sensitive information.",
    "Collaboration Tools: Share knowledge bases with team members and control access permissions for different users.",
    "Backup Integration: Automated backup systems with export capabilities for data protection and migration."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
