{
  "name": "pepperminty-wiki",
  "slug": "pepperminty-wiki",
  "tagline": "",
  "description": "Pepperminty Wiki is a single-file wiki engine written in PHP designed for easy self-hosting. It supports Markdown content, version control, and customizable themes in a lightweight package.",
  "categories": [
    193
  ],
  "metadata": {
    "sponsored": false,
    "license": "MPL-2.0",
    "version": "v0.24",
    "date_app_added": "2025-11-23",
    "date_last_released": "2023-02-19",
    "date_last_commit": "2025-11-28",
    "github_stars": 204
  },
  "resources": {
    "website": "https://peppermint.mooncarrot.space/",
    "documentation": "https://peppermint.mooncarrot.space/",
    "source_code": "https://github.com/sbrl/Pepperminty-Wiki",
    "logo": "/icons/pepperminty-wiki.webp",
    "issues": "https://github.com/sbrl/Pepperminty-Wiki/issues",
    "releases": "https://github.com/sbrl/Pepperminty-Wiki/releases"
  },
  "features": [
    "Single-File Deployment: Entire wiki engine contained in one PHP file for extremely simple installation and portability.",
    "Markdown Support: Write wiki pages in Markdown with syntax highlighting and live preview for easy content creation.",
    "Version Control: Track page changes over time with built-in version history and the ability to restore previous revisions.",
    "Search Functionality: Full-text search across all wiki pages to quickly find information regardless of page structure.",
    "Custom Themes: Personalize wiki appearance with customizable CSS themes and layout options.",
    "File Uploads: Attach images and files to wiki pages for embedded media and downloadable resources.",
    "User Management: Optional authentication system with user accounts and permissions for controlled editing access.",
    "Lightweight Design: Minimal resource requirements make it suitable for shared hosting or low-power servers.",
    "Export Options: Download wiki content in various formats for backup or migration to other platforms.",
    "Module System: Extend functionality with optional modules for features like comments, statistics, and advanced search.",
    "Page Linking: Create internal wiki links automatically with simple syntax for building interconnected knowledge bases.",
    "Recent Changes: Track all wiki activity with a chronological feed of edits, new pages, and user contributions."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
