{
  "name": "perfice",
  "slug": "perfice",
  "tagline": null,
  "description": "Perfice is a minimal self-hosted time tracking system that allows users to log work hours, generate reports, and visualize time spent across tasks and projects.",
  "categories": [
    103
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-10-07",
    "github_stars": 373
  },
  "resources": {
    "website": "https://perfice.adoe.dev",
    "documentation": "https://github.com/p0lloc/perfice",
    "source_code": "https://github.com/p0lloc/perfice",
    "logo": "/icons/perfice.webp",
    "issues": "https://github.com/p0lloc/perfice/issues",
    "releases": null
  },
  "features": [
    "Time Logging: Track work hours with start/stop timers or manual entry for accurate time recording across tasks and projects.",
    "Project Organization: Group time entries by projects and tasks for structured tracking of different work streams.",
    "Report Generation: Create detailed reports showing time spent by project, task, or date range for billing and analysis.",
    "Visual Analytics: Charts and graphs display time distribution patterns to identify productivity trends and time allocation.",
    "Export Functionality: Download time data in CSV or PDF format for invoicing, payroll, or external reporting systems.",
    "Minimal Interface: Clean, distraction-free UI focuses on quick time entry without unnecessary complexity.",
    "Tag System: Apply tags to time entries for flexible categorization beyond project and task hierarchies.",
    "Calendar View: Visualize logged time on a calendar to see work patterns and identify gaps in time tracking.",
    "Multi-User Support: Track time for multiple team members with individual accounts and consolidated reporting.",
    "Billable Hours: Mark time entries as billable or non-billable for accurate client invoicing and cost tracking.",
    "Time Rounding: Configure automatic rounding rules for time entries to match billing increments and standards.",
    "API Access: Integrate with external tools and automate time tracking workflows through REST API endpoints."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
