{
  "name": "petio",
  "slug": "petio",
  "tagline": "",
  "description": "Petio is a request management tool integrating with Plex and Overseerr to allow users to request media content. It automates approval workflows and supports multiple media backends.",
  "categories": [
    156
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.5.5",
    "date_app_added": "2025-11-23",
    "date_last_released": "2024-03-30",
    "date_last_commit": "2025-01-17",
    "github_stars": 282
  },
  "resources": {
    "website": "https://petio.tv",
    "documentation": "https://petio.tv",
    "source_code": "https://github.com/petio-team/petio",
    "logo": "/icons/petio.webp",
    "issues": "https://github.com/petio-team/petio/issues",
    "releases": "https://github.com/petio-team/petio/releases"
  },
  "features": [
    "Media Requests: Users can search and request movies or TV shows to be added to your Plex library through an intuitive interface.",
    "Approval Workflows: Configure automatic or manual approval processes for media requests based on user roles and quotas.",
    "Plex Integration: Direct integration with Plex Media Server for authentication, library management, and content availability checking.",
    "Overseerr Compatibility: Works alongside Overseerr to provide alternative request management with different features and UI.",
    "User Management: Control access and permissions with user accounts, roles, and request limits for fair resource allocation.",
    "Request History: Track all media requests with status updates, approval history, and fulfillment tracking.",
    "Notification System: Alert users when their requests are approved, denied, or available in the library.",
    "Search Integration: Search across multiple media databases to find and request content with metadata and artwork.",
    "Mobile Responsive: Optimized interface works seamlessly on mobile devices for requesting content on the go.",
    "Request Quotas: Set limits on how many requests users can make per time period to manage library growth.",
    "Quality Profiles: Configure preferred video quality and format settings for automated media downloads.",
    "Issue Reporting: Users can report problems with existing media for re-download or quality improvement."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
