{
  "name": "pg-back-web",
  "slug": "pg-back-web",
  "tagline": null,
  "description": "PgBackWeb is a web-based interface for managing PostgreSQL backups using pgBackRest. It allows scheduling, restoring, and managing backup operations through a modern self-hosted UI.",
  "categories": [
    18
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v0.5.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-06",
    "date_last_commit": "2025-11-21",
    "github_stars": 2411
  },
  "resources": {
    "website": "https://backup.uforg.dev",
    "documentation": "https://github.com/eduardolat/pgbackweb",
    "source_code": "https://github.com/eduardolat/pgbackweb",
    "logo": "/icons/pg-back-web.webp",
    "issues": "https://github.com/eduardolat/pgbackweb/issues",
    "releases": "https://github.com/eduardolat/pgbackweb/releases"
  },
  "features": [
    "Backup scheduling: Automate PostgreSQL backups with configurable schedules for full, incremental, and differential backups.",
    "Web interface: Manage all backup operations through a modern, responsive web UI without command-line access.",
    "Restore operations: Quickly restore databases to specific points in time with guided recovery workflows.",
    "Backup monitoring: Track backup status, success rates, and storage usage with dashboard visualizations.",
    "Multiple databases: Configure and manage backups for multiple PostgreSQL instances from a single interface.",
    "Retention policies: Automatically delete old backups based on age or count to manage storage efficiently.",
    "Email notifications: Receive alerts when backups fail, complete, or require attention.",
    "Compression support: Reduce backup size with built-in compression options to save storage space.",
    "Encryption: Secure backup data with encryption at rest and in transit for compliance and security.",
    "Storage backends: Store backups locally or on remote storage like S3, Azure Blob, or network shares.",
    "Backup verification: Automatically test backup integrity to ensure successful recovery when needed.",
    "Audit logging: Track all backup and restore operations with detailed logs for compliance and troubleshooting."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
