{
  "name": "photoprism",
  "slug": "photoprism",
  "tagline": null,
  "description": "PhotoPrism is a self-hosted AI-powered photo organizer that automatically tags and indexes images using machine learning. It supports RAW formats, browsing, search, and has a polished UI for photographers.",
  "categories": [
    120
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "251130-b3068414c",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-01",
    "date_last_commit": "2025-12-12",
    "github_stars": 38926
  },
  "resources": {
    "website": "https://www.photoprism.app",
    "documentation": "https://github.com/photoprism/photoprism",
    "source_code": "https://github.com/photoprism/photoprism",
    "logo": "/icons/photoprism.webp",
    "issues": "https://github.com/photoprism/photoprism/issues",
    "releases": "https://github.com/photoprism/photoprism/releases"
  },
  "features": [
    "AI-powered tagging: Automatically classify and tag photos using machine learning for objects, scenes, and faces.",
    "RAW format support: Process and display RAW files from professional cameras with embedded preview generation.",
    "Facial recognition: Identify and group photos by people with automatic face detection and clustering.",
    "Geolocation mapping: View photos on interactive maps based on GPS metadata and organize by location.",
    "Duplicate detection: Automatically identify and manage duplicate photos to save storage space.",
    "Album organization: Create albums and collections to organize photos beyond folder structures.",
    "Advanced search: Find photos using natural language queries combining tags, dates, locations, and metadata.",
    "Mobile apps: Access your library from iOS and Android devices with native mobile applications.",
    "Video support: Index and play video files alongside photos with thumbnail generation and metadata extraction.",
    "Privacy controls: Share albums with customizable access controls and password protection.",
    "Metadata editing: Modify EXIF data, titles, descriptions, and tags directly in the interface.",
    "Import automation: Automatically organize and index new photos added to watched directories."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
