{
  "name": "photofield",
  "slug": "photofield",
  "tagline": null,
  "description": "Photofield is a self-hosted gallery viewer that displays images in a dynamic, zoomable canvas layout. Ideal for browsing large photo collections with intuitive navigation and a fluid UI.",
  "categories": [
    120
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.20.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-13",
    "date_last_commit": "2025-12-12",
    "github_stars": 535
  },
  "resources": {
    "website": "https://github.com/SmilyOrg/photofield",
    "documentation": "https://github.com/SmilyOrg/photofield",
    "source_code": "https://github.com/SmilyOrg/photofield",
    "logo": "/icons/photofield.webp",
    "issues": "https://github.com/SmilyOrg/photofield/issues",
    "releases": "https://github.com/SmilyOrg/photofield/releases"
  },
  "features": [
    "Zoomable canvas: Display photos on an infinite, zoomable canvas for intuitive browsing of large collections.",
    "Dynamic layout: Automatically arrange images in visually appealing layouts based on metadata and relationships.",
    "Fast navigation: Smoothly pan and zoom through thousands of photos with hardware-accelerated rendering.",
    "Metadata support: Display EXIF data including location, date, camera settings, and custom tags.",
    "Timeline view: Organize photos chronologically with visual timeline navigation and date clustering.",
    "Folder scanning: Automatically index photos from local directories with real-time updates.",
    "Search and filter: Find photos by date, location, camera, or custom metadata fields.",
    "Lightweight design: Minimal resource usage enables smooth performance even on low-power devices.",
    "Keyboard shortcuts: Navigate and control the interface efficiently with customizable keyboard commands.",
    "Responsive interface: Adapts to different screen sizes for desktop, tablet, and mobile viewing.",
    "Privacy focused: All processing happens locally with no external services or data collection.",
    "RAW format support: View and browse RAW image files from professional cameras alongside standard formats."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
