{
  "name": "pi-hole",
  "slug": "pi-hole",
  "tagline": null,
  "description": "Pi-hole is a self-hosted network-wide ad blocker and DNS sinkhole. It blocks ads and trackers across devices with a lightweight DNS solution and a web-based dashboard for configuration.",
  "categories": [
    7
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "v6.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-27",
    "date_last_commit": "2025-12-07",
    "github_stars": 54725
  },
  "resources": {
    "website": "https://pi-hole.net",
    "documentation": "https://github.com/pi-hole/pi-hole",
    "source_code": "https://github.com/pi-hole/pi-hole",
    "logo": "/icons/pi-hole.webp",
    "issues": "https://github.com/pi-hole/pi-hole/issues",
    "releases": "https://github.com/pi-hole/pi-hole/releases"
  },
  "features": [
    "Network-wide blocking: Block ads and trackers for all devices on your network without individual configuration.",
    "DNS sinkhole: Intercept DNS requests to known ad and tracking domains before they reach devices.",
    "Web dashboard: Monitor blocking statistics, query logs, and network activity through an intuitive interface.",
    "Blocklist management: Subscribe to curated blocklists or create custom lists for granular control.",
    "Query logging: View detailed logs of all DNS queries with timestamps, clients, and block status.",
    "Whitelist and blacklist: Override blocklists with custom allow and deny rules for specific domains.",
    "DHCP server: Optionally serve DHCP to automatically configure network devices to use Pi-hole.",
    "API access: Integrate with other tools and scripts using the built-in REST API.",
    "Group management: Apply different blocking policies to device groups for customized filtering.",
    "Conditional forwarding: Route specific DNS queries to designated servers for local network resolution.",
    "Privacy protection: Block tracking domains to enhance privacy across all network devices.",
    "Performance metrics: Track DNS query response times and blocking effectiveness with statistics."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
