{
  "name": "pinchflat",
  "slug": "pinchflat",
  "tagline": null,
  "description": "Pinchflat is a self-hosted tool for downloading, archiving, and managing YouTube videos. It supports scheduled downloads, playlists, and integration with media servers via a web UI.",
  "categories": [
    106
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v2025.9.26",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-09-26",
    "date_last_commit": "2025-09-28",
    "github_stars": 4286
  },
  "resources": {
    "website": "https://github.com/kieraneglin/pinchflat",
    "documentation": "https://github.com/kieraneglin/pinchflat",
    "source_code": "https://github.com/kieraneglin/pinchflat",
    "logo": "/icons/pinchflat.webp",
    "issues": "https://github.com/kieraneglin/pinchflat/issues",
    "releases": "https://github.com/kieraneglin/pinchflat/releases"
  },
  "features": [
    "YouTube downloads: Download videos from YouTube channels, playlists, and individual URLs with configurable quality settings.",
    "Scheduled archiving: Automatically check for and download new videos from subscribed channels on a schedule.",
    "Playlist management: Subscribe to playlists and automatically download new videos as they're added.",
    "Quality selection: Choose preferred video quality, format, and codec for downloads to balance quality and storage.",
    "Metadata extraction: Automatically save video metadata including titles, descriptions, thumbnails, and subtitles.",
    "Media server integration: Organize downloads in formats compatible with Plex, Jellyfin, and other media servers.",
    "Web interface: Manage subscriptions, monitor downloads, and configure settings through a clean web UI.",
    "Storage management: Set storage limits and automatically delete old videos to manage disk space.",
    "Download history: Track all downloaded videos with status, dates, and file locations.",
    "Subtitle downloads: Automatically download available subtitles in multiple languages alongside videos.",
    "Channel filtering: Configure rules to download only specific videos based on title, duration, or upload date.",
    "Notification system: Receive alerts when new videos are downloaded or when errors occur."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
