{
  "name": "piped",
  "slug": "piped",
  "tagline": null,
  "description": "Piped is a privacy-friendly YouTube frontend that can be self-hosted. It offers ad-free, tracking-free access with clean UI, subscriptions, and streaming without Google's infrastructure.",
  "categories": [
    100
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-12",
    "github_stars": 9603
  },
  "resources": {
    "website": "https://piped.video",
    "documentation": "https://github.com/TeamPiped/Piped",
    "source_code": "https://github.com/TeamPiped/Piped",
    "logo": "/icons/piped.webp",
    "issues": "https://github.com/TeamPiped/Piped/issues",
    "releases": null
  },
  "features": [
    "Privacy-focused streaming: Watch YouTube videos without tracking, ads, or Google account requirements.",
    "Subscription management: Subscribe to channels and receive updates without a YouTube account.",
    "Playlist support: Create and manage playlists independently from YouTube's infrastructure.",
    "Video quality selection: Choose preferred video quality and format for streaming or downloading.",
    "SponsorBlock integration: Automatically skip sponsored segments, intros, and outros in videos.",
    "Comments viewing: Read video comments without exposing your identity or activity to Google.",
    "Feed customization: View subscriptions in a chronological feed without algorithmic recommendations.",
    "Instance federation: Connect to multiple Piped instances for redundancy and load distribution.",
    "Proxy streaming: Stream videos through proxy servers to hide your IP address from YouTube.",
    "Import subscriptions: Transfer YouTube subscriptions using export files for easy migration.",
    "Lightweight interface: Fast, minimal UI designed for efficient video browsing and playback.",
    "Mobile optimized: Responsive design works seamlessly on smartphones and tablets."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
