{
  "name": "plane",
  "slug": "plane",
  "tagline": null,
  "description": "Plane is a self-hosted project and issue tracking tool designed for small teams. It features Kanban, timelines, Git syncing, and powerful filters with a sleek UI.",
  "categories": [
    125
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v1.2.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-12",
    "date_last_commit": "2025-12-12",
    "github_stars": 40462
  },
  "resources": {
    "website": "http://plane.so",
    "documentation": "https://github.com/makeplane/plane",
    "source_code": "https://github.com/makeplane/plane",
    "logo": "/icons/plane.webp",
    "issues": "https://github.com/makeplane/plane/issues",
    "releases": "https://github.com/makeplane/plane/releases"
  },
  "features": [
    "Issue tracking: Create and manage issues with custom fields, priorities, and status workflows.",
    "Kanban boards: Visualize work with drag-and-drop kanban boards for agile project management.",
    "Timeline views: Plan projects with Gantt-style timeline views showing dependencies and milestones.",
    "Git integration: Sync issues with GitHub, GitLab, or Bitbucket for automated status updates from commits.",
    "Advanced filters: Find issues quickly with powerful filtering by assignee, labels, dates, and custom fields.",
    "Team collaboration: Mention teammates, add comments, and track activity on issues in real-time.",
    "Cycle planning: Organize work into sprints or cycles with velocity tracking and burndown charts.",
    "Custom workflows: Define project-specific workflows and automation rules for issue state transitions.",
    "Notifications: Receive alerts for issue updates, mentions, and project activity via email or in-app.",
    "API access: Integrate with external tools using a comprehensive REST API for automation.",
    "Multiple views: Switch between list, kanban, calendar, and spreadsheet views for different perspectives.",
    "Project templates: Create reusable project templates with predefined workflows and issue types."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
