{
  "name": "pleroma",
  "slug": "pleroma",
  "tagline": "",
  "description": "Pleroma is a lightweight federated social network built using Elixir and Phoenix. It supports ActivityPub federation, custom themes, chat, and scalable self-hosted deployments.",
  "categories": [
    148
  ],
  "metadata": {
    "sponsored": false,
    "license": null,
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": null,
    "github_stars": null
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://git.pleroma.social/pleroma/pleroma",
    "logo": "/icons/pleroma.webp",
    "issues": null,
    "releases": null
  },
  "features": [
    "Federated social network: Connect with users across Mastodon, Pleroma, and other ActivityPub platforms.",
    "Lightweight architecture: Built with Elixir for efficient resource usage and scalability on modest hardware.",
    "Custom themes: Personalize the interface with custom CSS themes and color schemes.",
    "Rich media posts: Share text, images, videos, and polls with followers in your timeline.",
    "Chat functionality: Send direct messages and participate in group chats with other users.",
    "Content warnings: Add content warnings to posts for sensitive material with collapsible previews.",
    "Emoji reactions: React to posts with custom emoji beyond standard likes and favorites.",
    "Moderation tools: Manage your instance with user blocking, reporting, and content filtering.",
    "Multiple frontends: Choose from various web interfaces including Pleroma-FE, Mastodon-FE, and others.",
    "Media proxy: Proxy external media through your server for privacy and caching benefits.",
    "Custom emoji: Upload and use custom emoji unique to your instance for community identity.",
    "API compatibility: Support for Mastodon API enables use of third-party mobile apps and clients."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
