{
  "name": "plex",
  "slug": "plex",
  "tagline": "",
  "description": "Plex is a media server and streaming platform that lets you organize and stream personal media libraries across devices. It supports metadata fetching, transcoding, apps, and optional premium features.",
  "categories": [
    "Tidak ditemukan"
  ],
  "metadata": {
    "sponsored": false,
    "license": null,
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": null,
    "github_stars": null
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://www.plex.tv/",
    "logo": "/icons/plex.webp",
    "issues": null,
    "releases": null
  },
  "features": [
    "Media organization: Automatically organize movies, TV shows, music, and photos with metadata and artwork.",
    "Transcoding: Convert media on-the-fly to compatible formats for any device or bandwidth.",
    "Multi-device streaming: Stream to web browsers, mobile apps, smart TVs, and streaming devices.",
    "User management: Create separate accounts for family members with individual watch history and preferences.",
    "Remote access: Stream your media library from anywhere with secure remote connections.",
    "Metadata fetching: Automatically download posters, descriptions, cast info, and ratings from online databases.",
    "Watch together: Synchronize playback with friends and family for shared viewing experiences.",
    "DVR functionality: Record live TV with Plex Pass subscription and compatible tuner hardware.",
    "Offline sync: Download media to mobile devices for offline viewing without internet connection.",
    "Parental controls: Restrict content access with PIN-protected profiles and content ratings.",
    "Plugin ecosystem: Extend functionality with community plugins for additional features and integrations.",
    "Media discovery: Get personalized recommendations and browse curated collections of content."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
