{
  "name": "posteria",
  "slug": "posteria",
  "tagline": null,
  "description": "Posteria is a self-hosted web interface for managing and visualizing PostgreSQL databases. It provides insights, performance metrics, and SQL tools in a user-friendly UI.",
  "categories": [
    21
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-11-17",
    "github_stars": 176
  },
  "resources": {
    "website": "https://posteria.app",
    "documentation": "https://github.com/jeremehancock/Posteria",
    "source_code": "https://github.com/jeremehancock/Posteria",
    "logo": "/icons/posteria.webp",
    "issues": "https://github.com/jeremehancock/Posteria/issues",
    "releases": null
  },
  "features": [
    "Database visualization: View PostgreSQL database structure with interactive schema diagrams and relationships.",
    "Performance metrics: Monitor query performance, connection statistics, and resource usage in real-time.",
    "SQL editor: Execute queries with syntax highlighting, auto-completion, and result formatting.",
    "Query history: Access previously executed queries with timestamps and execution statistics.",
    "Table browser: Browse table data with pagination, sorting, and filtering capabilities.",
    "Index analysis: Identify missing indexes and optimization opportunities to improve query performance.",
    "Connection management: Manage multiple PostgreSQL connections with saved credentials and quick switching.",
    "Export functionality: Export query results and table data in CSV, JSON, and other formats.",
    "User-friendly interface: Clean, modern UI designed for developers and database administrators.",
    "Query insights: Analyze slow queries and get recommendations for performance improvements.",
    "Database statistics: View database size, table counts, and storage usage metrics.",
    "Role management: Visualize and manage database roles, permissions, and access controls."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
