{
  "name": "prestashop",
  "slug": "prestashop",
  "tagline": null,
  "description": "PrestaShop is a self-hosted e-commerce platform offering a feature-rich online store with support for custom themes, inventory, payments, and extensions. It is widely used for scalable, customizable e-commerce sites.",
  "categories": [
    51
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "9.0.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-10",
    "date_last_commit": "2025-12-12",
    "github_stars": 8886
  },
  "resources": {
    "website": "https://www.prestashop-project.org/",
    "documentation": "https://github.com/PrestaShop/PrestaShop",
    "source_code": "https://github.com/PrestaShop/PrestaShop",
    "logo": "/icons/prestashop.webp",
    "issues": "https://github.com/PrestaShop/PrestaShop/issues",
    "releases": "https://github.com/PrestaShop/PrestaShop/releases"
  },
  "features": [
    "Product management: Create and manage unlimited products with variants, attributes, and custom options.",
    "Order processing: Handle orders with customizable workflows, status tracking, and automated notifications.",
    "Payment gateways: Accept payments through multiple gateways including PayPal, Stripe, and credit cards.",
    "Shipping integration: Connect with major carriers for real-time rates, label printing, and tracking.",
    "Theme customization: Personalize store appearance with responsive themes and visual customization tools.",
    "Multi-language support: Sell globally with built-in translation tools and multi-currency capabilities.",
    "Inventory management: Track stock levels, set low-stock alerts, and manage warehouse locations.",
    "Customer accounts: Enable customer registration with order history, wishlists, and saved addresses.",
    "Marketing tools: Run promotions, discounts, and loyalty programs to increase sales and retention.",
    "SEO optimization: Improve search rankings with friendly URLs, meta tags, and sitemap generation.",
    "Analytics dashboard: Monitor sales, traffic, and customer behavior with built-in reporting tools.",
    "Module marketplace: Extend functionality with thousands of free and paid modules from the community."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
