{
  "name": "priviblur",
  "slug": "priviblur",
  "tagline": "",
  "description": "PriviBlur is a self-hosted tool for face blurring in videos and images. It supports configurable filters and batch processing through a browser interface, designed to enhance privacy for shared media.",
  "categories": [
    124
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v0.3.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-03-10",
    "date_last_commit": "2025-11-24",
    "github_stars": 137
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://github.com/syeopite/priviblur",
    "logo": "/icons/priviblur.webp",
    "issues": "https://github.com/syeopite/priviblur/issues",
    "releases": "https://github.com/syeopite/priviblur/releases"
  },
  "features": [
    "Face detection: Automatically detect faces in images and videos using machine learning algorithms.",
    "Automatic blurring: Apply blur effects to detected faces to protect privacy in shared media.",
    "Batch processing: Process multiple images or videos simultaneously for efficient privacy protection.",
    "Configurable filters: Adjust blur intensity, detection sensitivity, and processing parameters.",
    "Video support: Blur faces in video files frame-by-frame with optimized processing.",
    "Browser interface: Upload and process media through an intuitive web-based interface.",
    "Preview mode: Review detected faces and blur effects before finalizing changes.",
    "Manual adjustments: Manually select or deselect faces for blurring when automatic detection needs refinement.",
    "Format support: Process common image formats (JPEG, PNG) and video formats (MP4, AVI).",
    "Privacy focused: All processing happens locally on your server without sending data to external services.",
    "Export options: Download processed media with faces blurred for sharing or publication.",
    "Lightweight design: Minimal resource requirements suitable for personal or small-scale use."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
