{
  "name": "prometheus",
  "slug": "prometheus",
  "tagline": null,
  "description": "Prometheus is a leading open-source system monitoring and alerting toolkit. It collects metrics via pull-based scraping, stores them efficiently, and uses PromQL for powerful queries and visualizations.",
  "categories": [
    103
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v3.8.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-02",
    "date_last_commit": "2025-12-12",
    "github_stars": 61712
  },
  "resources": {
    "website": "https://prometheus.io/",
    "documentation": "https://github.com/prometheus/prometheus",
    "source_code": "https://github.com/prometheus/prometheus",
    "logo": "/icons/prometheus.webp",
    "issues": "https://github.com/prometheus/prometheus/issues",
    "releases": "https://github.com/prometheus/prometheus/releases"
  },
  "features": [
    "Metric collection: Scrape metrics from instrumented applications and infrastructure using pull-based model.",
    "Time-series database: Store metrics efficiently with compression and retention policies for long-term data.",
    "PromQL queries: Write powerful queries using PromQL to analyze and aggregate metric data.",
    "Service discovery: Automatically discover and monitor targets using Kubernetes, Consul, and other integrations.",
    "Alerting rules: Define alert conditions that trigger notifications when thresholds are exceeded.",
    "Multi-dimensional data: Label metrics with key-value pairs for flexible filtering and aggregation.",
    "Visualization: Built-in expression browser and integration with Grafana for creating dashboards.",
    "Federation: Aggregate metrics from multiple Prometheus servers for centralized monitoring.",
    "Exporters: Collect metrics from third-party systems using hundreds of community-maintained exporters.",
    "High availability: Deploy multiple Prometheus instances for redundancy and reliability.",
    "Recording rules: Pre-compute expensive queries and store results for faster dashboard loading.",
    "API access: Query metrics programmatically using HTTP API for custom integrations and automation."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
