{
  "name": "puter",
  "slug": "puter",
  "tagline": null,
  "description": "Puter is a self-hosted browser-based desktop environment that simulates a full operating system in the browser. It includes a virtual file system, apps, terminal, desktop, and multi-user support.",
  "categories": [
    34
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v2.5.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-02-14",
    "date_last_commit": "2025-12-13",
    "github_stars": 37842
  },
  "resources": {
    "website": "https://puter.com",
    "documentation": "https://github.com/HeyPuter/puter",
    "source_code": "https://github.com/HeyPuter/puter",
    "logo": "/icons/puter.webp",
    "issues": "https://github.com/HeyPuter/puter/issues",
    "releases": "https://github.com/HeyPuter/puter/releases"
  },
  "features": [
    "Browser-based desktop: Access a full desktop environment through any web browser without installation.",
    "Virtual file system: Store and organize files in a cloud-like file system with folders and permissions.",
    "Built-in applications: Use pre-installed apps including text editor, terminal, file manager, and media player.",
    "Terminal access: Execute commands in a web-based terminal with support for common Unix utilities.",
    "Multi-user support: Create separate user accounts with isolated environments and file storage.",
    "App marketplace: Install additional applications and tools from a curated marketplace.",
    "File sharing: Share files and folders with other users or generate public download links.",
    "Drag-and-drop interface: Manage files and windows with familiar desktop interactions.",
    "Customizable desktop: Personalize wallpapers, themes, and desktop layouts to match preferences.",
    "Real-time collaboration: Work on files simultaneously with other users in shared workspaces.",
    "API access: Build custom applications that integrate with the Puter environment and file system.",
    "Mobile responsive: Access your desktop environment from tablets and smartphones with touch optimization."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
