{
  "name": "pyload",
  "slug": "pyload",
  "tagline": "",
  "description": "pyLoad is a self-hosted download manager focused on file hosting services and automation. It supports plugins, scheduling, and a web UI for queue management and link handling.",
  "categories": [
    50
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "v0.4.20",
    "date_app_added": "2025-11-23",
    "date_last_released": "2020-02-20",
    "date_last_commit": "2025-12-12",
    "github_stars": 3638
  },
  "resources": {
    "website": "https://pyload.net",
    "documentation": "https://pyload.net",
    "source_code": "https://github.com/pyload/pyload",
    "logo": "/icons/pyload.webp",
    "issues": "https://github.com/pyload/pyload/issues",
    "releases": "https://github.com/pyload/pyload/releases"
  },
  "features": [
    "Multi-host support: Download from hundreds of file hosting services including Mega, Rapidgator, and MediaFire.",
    "Queue management: Organize downloads in queues with priorities, categories, and scheduling.",
    "Plugin system: Extend functionality with plugins for new hosters, captcha solvers, and automation.",
    "Captcha solving: Automatically solve captchas using OCR or integration with solving services.",
    "Link extraction: Extract download links from container files like DLC, CCF, and RSDF.",
    "Scheduled downloads: Set download times to take advantage of off-peak hours or unlimited bandwidth periods.",
    "Web interface: Manage downloads through a responsive web UI accessible from any device.",
    "Account management: Store premium account credentials for faster downloads and no waiting times.",
    "Automatic reconnection: Handle connection interruptions with automatic retry and resume capabilities.",
    "Download limits: Set bandwidth limits and concurrent download restrictions to manage network usage.",
    "API access: Control downloads programmatically using a RESTful API for automation.",
    "Notification system: Receive alerts when downloads complete, fail, or require captcha solving."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
