{
  "name": "pyshelf",
  "slug": "pyshelf",
  "tagline": "",
  "description": "pyShelf is a lightweight self-hosted media management tool designed for organizing ebooks and publications. It allows browsing and downloading through a simple web UI.",
  "categories": [
    21
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-08-14",
    "github_stars": 525
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://github.com/th3r00t/pyShelf",
    "logo": "/icons/pyshelf.webp",
    "issues": "https://github.com/th3r00t/pyShelf/issues",
    "releases": null
  },
  "features": [
    "Ebook organization: Organize and manage digital book collections with metadata and cover images.",
    "Format support: Handle multiple ebook formats including EPUB, PDF, MOBI, and AZW.",
    "Metadata extraction: Automatically extract book information including title, author, and publication details.",
    "Web browsing: Browse your library through a clean, responsive web interface.",
    "Search functionality: Find books quickly using search across titles, authors, and descriptions.",
    "Download management: Download books directly through the web interface for offline reading.",
    "Collection management: Organize books into collections, series, and custom categories.",
    "Cover display: View book covers in grid or list layouts for visual library browsing.",
    "Reading progress: Track which books you've read and mark favorites for easy access.",
    "Lightweight design: Minimal resource requirements suitable for personal libraries on any hardware.",
    "Mobile responsive: Access and download books from mobile devices with an optimized interface.",
    "Bulk operations: Add multiple books simultaneously and perform batch metadata updates."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
