{
  "name": "qbit-manage",
  "slug": "qbit-manage",
  "tagline": null,
  "description": "qBitManage is a self-hosted utility for managing qBittorrent automatically. It handles categories, tags, and cleanup operations via API with simple config and CLI usage.",
  "categories": [
    166
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v4.6.5",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-29",
    "date_last_commit": "2025-12-12",
    "github_stars": 1299
  },
  "resources": {
    "website": "https://github.com/StuffAnThings/qbit_manage",
    "documentation": "https://github.com/StuffAnThings/qbit_manage",
    "source_code": "https://github.com/StuffAnThings/qbit_manage",
    "logo": "/icons/qbit-manage.webp",
    "issues": "https://github.com/StuffAnThings/qbit_manage/issues",
    "releases": "https://github.com/StuffAnThings/qbit_manage/releases"
  },
  "features": [
    "Automated categorization: Organize torrents by content type, tracker, or custom rules to maintain a structured download library.",
    "Tag management: Apply and remove tags automatically based on torrent status, age, or seeding ratio for easier filtering.",
    "Cleanup operations: Remove stalled, orphaned, or completed torrents based on configurable criteria to free up disk space.",
    "Cross-seed detection: Identify and manage duplicate content across multiple trackers to optimize seeding efficiency.",
    "Ratio management: Monitor and enforce seeding ratios per tracker or category to meet private tracker requirements.",
    "Schedule automation: Run management tasks on a cron schedule to keep your qBittorrent instance organized without manual intervention.",
    "API integration: Connect directly to qBittorrent's Web API for real-time torrent management and status updates.",
    "YAML configuration: Define all rules and settings in a simple YAML file for version control and easy deployment.",
    "Dry-run mode: Preview changes before applying them to avoid accidental deletions or modifications.",
    "Multi-instance support: Manage multiple qBittorrent instances from a single configuration file.",
    "Custom filters: Create complex filtering rules using torrent metadata, tracker information, and download statistics.",
    "Logging and reporting: Track all automated actions with detailed logs for auditing and troubleshooting."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
