{
  "name": "quickwit",
  "slug": "quickwit",
  "tagline": null,
  "description": "Quickwit is a cloud-native search engine for large-scale log storage and querying. It offers web-based query UI, REST APIs, and is optimized for low storage costs and fast indexing.",
  "categories": [
    144
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v0.8.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2024-06-17",
    "date_last_commit": "2025-12-11",
    "github_stars": 10634
  },
  "resources": {
    "website": "https://quickwit.io",
    "documentation": "https://github.com/quickwit-oss/quickwit",
    "source_code": "https://github.com/quickwit-oss/quickwit",
    "logo": "/icons/quickwit.webp",
    "issues": "https://github.com/quickwit-oss/quickwit/issues",
    "releases": "https://github.com/quickwit-oss/quickwit/releases"
  },
  "features": [
    "Cloud-native architecture: Designed for object storage like S3 to minimize infrastructure costs and maximize scalability.",
    "Fast indexing: Ingest millions of logs per second with distributed indexing across multiple nodes.",
    "Full-text search: Query logs using Elasticsearch-compatible syntax for familiar search operations.",
    "Web query UI: Execute searches and visualize results through an intuitive browser-based interface.",
    "REST API: Integrate log search into applications and dashboards using standard HTTP endpoints.",
    "Cost-optimized storage: Store petabytes of logs at a fraction of traditional search engine costs.",
    "Time-based partitioning: Automatically organize data by time ranges for efficient querying and retention management.",
    "Distributed architecture: Scale horizontally by adding nodes to handle increased log volume and query load.",
    "Schema flexibility: Define custom fields and data types to match your log structure and search requirements.",
    "Retention policies: Configure automatic deletion of old data to comply with regulations and manage storage costs.",
    "Aggregation queries: Analyze log patterns with grouping, counting, and statistical operations.",
    "OpenTelemetry support: Ingest traces and logs from modern observability tools using standard protocols."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
