{
  "name": "rachoon",
  "slug": "rachoon",
  "tagline": null,
  "description": "Rachoon is a self-hosted financial planning tool that helps manage budgets, track expenses, and visualize monthly cash flows through a user-friendly web interface.",
  "categories": [
    120
  ],
  "metadata": {
    "sponsored": false,
    "license": null,
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-02",
    "github_stars": 885
  },
  "resources": {
    "website": "https://github.com/ad-on-is/rachoon",
    "documentation": "https://github.com/ad-on-is/rachoon",
    "source_code": "https://github.com/ad-on-is/rachoon",
    "logo": "/icons/rachoon.webp",
    "issues": "https://github.com/ad-on-is/rachoon/issues",
    "releases": null
  },
  "features": [
    "Budget planning: Create monthly budgets by category to track spending limits and financial goals.",
    "Expense tracking: Record and categorize transactions to understand where your money goes each month.",
    "Cash flow visualization: View income and expenses over time with charts and graphs for trend analysis.",
    "Recurring transactions: Set up automatic entries for regular bills and income to simplify monthly planning.",
    "Category management: Organize expenses into custom categories that match your spending patterns.",
    "Multi-currency support: Track finances in different currencies for international accounts and travel expenses.",
    "Goal setting: Define savings targets and monitor progress toward financial milestones.",
    "Report generation: Export financial summaries and detailed transaction lists for tax preparation or analysis.",
    "Mobile responsive: Access your budget and record expenses from any device with a touch-friendly interface.",
    "Data privacy: Keep all financial information on your own server without sharing with third-party services.",
    "Import transactions: Upload bank statements in CSV format to quickly populate your expense history.",
    "Budget alerts: Receive notifications when spending approaches or exceeds category limits."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
