{
  "name": "rapidforge",
  "slug": "rapidforge",
  "tagline": "",
  "description": "Release is a self-hosted DevOps platform that automates environment creation, previews, and deployments with a focus on simplifying cloud-native workflows via UI or API.",
  "categories": [
    165
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "v0.11.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-22",
    "date_last_commit": "2025-10-22",
    "github_stars": 17
  },
  "resources": {
    "website": "https://rapidforge.io/",
    "documentation": "https://rapidforge.io/",
    "source_code": "https://github.com/rapidforge-io/release",
    "logo": "/icons/rapidforge.webp",
    "issues": "https://github.com/rapidforge-io/release/issues",
    "releases": "https://github.com/rapidforge-io/release/releases"
  },
  "features": [
    "Environment automation: Create isolated development, staging, and production environments with a single command.",
    "Preview deployments: Generate temporary environments for pull requests to test changes before merging.",
    "Container orchestration: Deploy applications to Kubernetes clusters with automated configuration and scaling.",
    "CI/CD integration: Connect to GitHub, GitLab, or Bitbucket for automatic deployments on code changes.",
    "Infrastructure as code: Define environments using declarative configuration files for reproducible deployments.",
    "Resource management: Monitor CPU, memory, and storage usage across all environments from a central dashboard.",
    "Rollback support: Quickly revert to previous versions when deployments fail or issues are discovered.",
    "Secret management: Store and inject environment variables and credentials securely into applications.",
    "Multi-cloud support: Deploy to AWS, GCP, Azure, or on-premises infrastructure from the same platform.",
    "Team collaboration: Share environments and deployment controls with team members using role-based access.",
    "API-first design: Automate workflows and integrate with existing tools using comprehensive REST APIs.",
    "Cost tracking: Monitor cloud spending per environment to optimize resource allocation and budgets."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
