{
  "name": "readarr",
  "slug": "readarr",
  "tagline": null,
  "description": "Readarr is a self-hosted ebook and audiobook collection manager for Usenet and torrents. It integrates with Calibre, tracks authors, and automates downloads via indexers.",
  "categories": [
    21
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-06-27",
    "github_stars": 3382
  },
  "resources": {
    "website": "http://readarr.com",
    "documentation": "https://github.com/Readarr/Readarr",
    "source_code": "https://github.com/Readarr/Readarr",
    "logo": "/icons/readarr.webp",
    "issues": "https://github.com/Readarr/Readarr/issues",
    "releases": null
  },
  "features": [
    "Author tracking: Monitor favorite authors and automatically download new releases when they're published.",
    "Calibre integration: Sync with Calibre libraries to manage metadata and convert between ebook formats.",
    "Quality profiles: Define preferred formats like EPUB, MOBI, or AZW3 and prioritize audiobook quality.",
    "Automated downloads: Search Usenet and torrent indexers to grab books as soon as they become available.",
    "Metadata management: Fetch book covers, descriptions, and publication details from GoodReads and other sources.",
    "Series tracking: Follow book series and get notified when new installments are released.",
    "Import lists: Automatically add books from GoodReads lists, reading challenges, or custom sources.",
    "Library organization: Rename and sort downloaded books into a consistent folder structure.",
    "Search indexers: Connect to multiple indexers simultaneously to find rare or hard-to-find titles.",
    "Upgrade monitoring: Replace existing books with better quality versions or preferred formats when available.",
    "Calendar view: See upcoming book releases from tracked authors on a visual timeline.",
    "Notifications: Send alerts to Discord, Telegram, or email when new books are added or downloaded."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
