{
  "name": "redlib",
  "slug": "redlib",
  "tagline": null,
  "description": "RedLib is a lightweight and privacy-respecting front-end for Reddit, offering a clean UI to browse content without ads or tracking. It can be self-hosted and customized.",
  "categories": [
    149
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v0.36.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-03-20",
    "date_last_commit": "2025-10-06",
    "github_stars": 2896
  },
  "resources": {
    "website": "https://github.com/redlib-org/redlib",
    "documentation": "https://github.com/redlib-org/redlib",
    "source_code": "https://github.com/redlib-org/redlib",
    "logo": "/icons/redlib.webp",
    "issues": "https://github.com/redlib-org/redlib/issues",
    "releases": "https://github.com/redlib-org/redlib/releases"
  },
  "features": [
    "Privacy-focused browsing: Access Reddit content without tracking scripts, cookies, or personalized ads.",
    "Lightweight interface: Fast page loads with minimal JavaScript for efficient browsing on any device.",
    "No account required: Browse subreddits, posts, and comments without creating or logging into a Reddit account.",
    "Custom themes: Switch between light and dark modes for comfortable reading in any environment.",
    "Direct media viewing: View images and videos inline without redirects to external hosting platforms.",
    "Subreddit search: Find and explore communities without exposing your interests to Reddit's tracking systems.",
    "Comment threading: Navigate nested discussions with clear visual hierarchy and collapsible threads.",
    "Mobile responsive: Optimized layout adapts to smartphones and tablets for on-the-go browsing.",
    "Instance customization: Configure your own instance with custom branding and default settings.",
    "No JavaScript fallback: Core functionality works even with JavaScript disabled for maximum privacy.",
    "RSS feed support: Subscribe to subreddit feeds for updates without visiting the site.",
    "Proxy configuration: Route requests through your own infrastructure to control data flow and caching."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
