{
  "name": "sablier",
  "slug": "sablier",
  "tagline": null,
  "description": "Sablier is a self-hosted tool for managing time-based governance tasks for DAOs. It automates schedules, streams, and proposal processes through an intuitive web UI.",
  "categories": [
    55
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v1.11.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-07",
    "date_last_commit": "2025-12-12",
    "github_stars": 2398
  },
  "resources": {
    "website": "https://sablierapp.dev/",
    "documentation": "https://github.com/sablierapp/sablier",
    "source_code": "https://github.com/sablierapp/sablier",
    "logo": "/icons/sablier.webp",
    "issues": "https://github.com/sablierapp/sablier/issues",
    "releases": "https://github.com/sablierapp/sablier/releases"
  },
  "features": [
    "Dynamic scaling: Automatically start and stop containers based on traffic to reduce resource usage and costs.",
    "Reverse proxy integration: Works seamlessly with Traefik and other proxies to manage container lifecycle.",
    "Session persistence: Maintains user sessions during container startup with customizable loading pages.",
    "Multi-strategy support: Choose between blocking, dynamic, or throttle strategies for different workload patterns.",
    "Resource optimization: Reduces idle container overhead by shutting down unused services after configurable timeouts.",
    "Health monitoring: Tracks container health and readiness before routing traffic to ensure reliability.",
    "Custom themes: Personalize loading screens with custom HTML, CSS, and branding during container startup.",
    "API control: Programmatically manage container states and scaling policies via REST API.",
    "Metrics export: Exposes Prometheus metrics for monitoring scaling events and container lifecycle.",
    "Label-based config: Configure scaling behavior through simple Docker labels without complex configuration files.",
    "Multi-container support: Manage multiple services simultaneously with independent scaling policies.",
    "Graceful shutdown: Ensures proper cleanup and state preservation when stopping containers."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
