{
  "name": "tandoor-recipes",
  "slug": "tandoor-recipes",
  "tagline": null,
  "description": "Tandoor Recipes is a self-hosted recipe manager that supports meal planning, shopping lists, and nutritional analysis with a polished, multi-user web interface.",
  "categories": [
    131
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "2.3.6",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-24",
    "date_last_commit": "2025-12-12",
    "github_stars": 7738
  },
  "resources": {
    "website": "https://docs.tandoor.dev",
    "documentation": "https://github.com/TandoorRecipes/recipes",
    "source_code": "https://github.com/TandoorRecipes/recipes",
    "logo": "/icons/tandoor-recipes.webp",
    "issues": "https://github.com/TandoorRecipes/recipes/issues",
    "releases": "https://github.com/TandoorRecipes/recipes/releases"
  },
  "features": [
    "Recipe management: Store and organize recipes with ingredients, instructions, images, and tags in a searchable database.",
    "Meal planning: Plan meals for days or weeks ahead with drag-and-drop calendar interface and automatic shopping list generation.",
    "Shopping lists: Generate consolidated shopping lists from planned meals with automatic quantity calculations and category grouping.",
    "Nutritional analysis: View detailed nutritional information for recipes and meals to track calories, macros, and dietary goals.",
    "Multi-user support: Share recipes and meal plans with family members while maintaining individual preferences and permissions.",
    "Recipe import: Import recipes from websites automatically using URL parsing or manual entry with structured templates.",
    "Scaling: Adjust recipe serving sizes automatically with proportional ingredient recalculation for any number of servings.",
    "Cookbook organization: Create custom cookbooks and collections to group recipes by theme, cuisine, or occasion.",
    "Search and filter: Find recipes quickly using full-text search, tags, ingredients, ratings, and custom filters.",
    "Mobile responsive: Access recipes and shopping lists from any device with a polished, touch-friendly interface.",
    "Recipe sharing: Export recipes in standard formats or share via links with customizable privacy settings.",
    "Cooking mode: Display recipes in a clean, step-by-step view optimized for use while cooking in the kitchen."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
