{
  "name": "tasks-md",
  "slug": "tasks-md",
  "tagline": null,
  "description": "Tasks.md is a self-hosted Markdown-based task manager using plain text files. It offers a web UI to view, filter, and update tasks while keeping storage in Git-friendly format.",
  "categories": [
    111
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "3.2.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-20",
    "date_last_commit": "2025-11-20",
    "github_stars": 1938
  },
  "resources": {
    "website": "https://github.com/BaldissaraMatheus/Tasks.md",
    "documentation": "https://github.com/BaldissaraMatheus/Tasks.md",
    "source_code": "https://github.com/BaldissaraMatheus/Tasks.md",
    "logo": "/icons/tasks-md.webp",
    "issues": "https://github.com/BaldissaraMatheus/Tasks.md/issues",
    "releases": "https://github.com/BaldissaraMatheus/Tasks.md/releases"
  },
  "features": [
    "Markdown storage: Store tasks in plain text Markdown files that remain readable and editable outside the application.",
    "Git-friendly format: Track task changes with version control systems using human-readable diff-friendly file formats.",
    "Web interface: View and manage tasks through a modern web UI with filtering, sorting, and search capabilities.",
    "Task filtering: Filter tasks by status, tags, priority, or custom criteria to focus on what matters most.",
    "File-based organization: Organize tasks across multiple files and folders to match your project structure.",
    "Syntax highlighting: Edit tasks with Markdown syntax highlighting and preview for rich formatting support.",
    "Tag system: Categorize and group tasks using hashtags for flexible organization and quick filtering.",
    "Status tracking: Mark tasks as todo, in progress, done, or custom statuses with visual indicators.",
    "Due dates: Set and track due dates with calendar views and overdue highlighting for time-sensitive tasks.",
    "Portable data: Keep all task data in standard Markdown files that can be backed up, synced, or migrated easily.",
    "Search functionality: Find tasks quickly using full-text search across all files and metadata.",
    "Bulk operations: Update multiple tasks at once with batch editing for efficient task management."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
