{
  "name": "tautulli",
  "slug": "tautulli",
  "tagline": null,
  "description": "Tautulli is a self-hosted monitoring and analytics tool for Plex Media Server. It tracks user activity, watch history, performance, and library stats, providing rich reports and notifications via an intuitive web dashboard and API.",
  "categories": [
    100
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v2.16.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-09-09",
    "date_last_commit": "2025-11-20",
    "github_stars": 6237
  },
  "resources": {
    "website": "https://tautulli.com",
    "documentation": "https://github.com/Tautulli/Tautulli",
    "source_code": "https://github.com/Tautulli/Tautulli",
    "logo": "/icons/tautulli.webp",
    "issues": "https://github.com/Tautulli/Tautulli/issues",
    "releases": "https://github.com/Tautulli/Tautulli/releases"
  },
  "features": [
    "Activity monitoring: Track real-time and historical Plex playback activity across all users and devices.",
    "Watch statistics: View detailed statistics on what content is watched, when, and by whom with rich visualizations.",
    "User analytics: Analyze individual user behavior including watch time, favorite content, and viewing patterns.",
    "Library insights: Monitor library growth, popular content, and media statistics across movies, TV shows, and music.",
    "Notifications: Send customizable alerts via email, Discord, Slack, or other services for playback events and server issues.",
    "Performance tracking: Monitor server performance metrics including transcoding, bandwidth usage, and resource consumption.",
    "Recently added: Track newly added content to your libraries with automatic notifications to users.",
    "Playback history: Access complete playback history with filtering, search, and export capabilities for analysis.",
    "Newsletter generation: Create and send automated newsletters to users highlighting new content and statistics.",
    "API access: Integrate with other tools using the comprehensive REST API for custom automation and reporting.",
    "Geolocation tracking: View where users are streaming from with IP geolocation and connection details.",
    "Custom scripts: Trigger custom scripts based on playback events for advanced automation and integrations."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
