{
  "name": "taxhacker",
  "slug": "taxhacker",
  "tagline": null,
  "description": "TaxHacker is a self-hosted script and toolkit that helps calculate and optimize income or investment taxes using country-specific rules. It focuses on automation, reproducible calculations, and transparent tax estimation from local data.",
  "categories": [
    22
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.6.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-07-23",
    "date_last_commit": "2025-12-08",
    "github_stars": 665
  },
  "resources": {
    "website": "https://taxhacker.app",
    "documentation": "https://github.com/vas3k/TaxHacker",
    "source_code": "https://github.com/vas3k/TaxHacker",
    "logo": "/icons/taxhacker.webp",
    "issues": "https://github.com/vas3k/TaxHacker/issues",
    "releases": "https://github.com/vas3k/TaxHacker/releases"
  },
  "features": [
    "Tax calculation: Calculate income and investment taxes using country-specific rules and regulations.",
    "Automated processing: Process financial data automatically to generate tax estimates and reports.",
    "Reproducible results: Ensure consistent calculations with documented formulas and transparent methodology.",
    "Local data storage: Keep all financial data on your own infrastructure for maximum privacy and security.",
    "Multiple jurisdictions: Support for various tax jurisdictions with customizable rules and rates.",
    "Investment tracking: Track capital gains, dividends, and other investment income for accurate tax reporting.",
    "Optimization suggestions: Identify potential tax optimization strategies based on your financial situation.",
    "Report generation: Generate detailed tax reports and summaries for filing or review purposes.",
    "Historical tracking: Maintain records of past calculations and tax years for comparison and auditing.",
    "Custom rules: Define custom tax rules and scenarios to match your specific situation or jurisdiction.",
    "Data import: Import financial data from various sources including CSV files and bank statements.",
    "Transparent calculations: Review step-by-step calculations to understand how tax estimates are derived."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
