{
  "name": "tdarr",
  "slug": "tdarr",
  "tagline": null,
  "description": "Tdarr is a distributed, self-hosted video transcoding and library optimization platform. It uses plugins, workers, and rules to automatically transcode, scan, and clean up media libraries via a powerful web UI.",
  "categories": [
    100
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-11-14",
    "github_stars": 3831
  },
  "resources": {
    "website": "https://github.com/HaveAGitGat/Tdarr",
    "documentation": "https://github.com/HaveAGitGat/Tdarr",
    "source_code": "https://github.com/HaveAGitGat/Tdarr",
    "logo": "/icons/tdarr.webp",
    "issues": "https://github.com/HaveAGitGat/Tdarr/issues",
    "releases": null
  },
  "features": [
    "Distributed transcoding: Distribute transcoding workload across multiple worker nodes for faster processing.",
    "Plugin system: Use community plugins or create custom ones to define transcoding rules and workflows.",
    "Library scanning: Automatically scan media libraries to identify files that need transcoding or optimization.",
    "Codec conversion: Convert videos between codecs like H.264, H.265, AV1 for compatibility or space savings.",
    "Health checks: Scan media files for corruption, missing audio tracks, or other issues requiring attention.",
    "Conditional rules: Apply transcoding rules based on file properties like codec, resolution, bitrate, or container.",
    "Hardware acceleration: Leverage GPU acceleration for faster transcoding using NVENC, QuickSync, or VAAPI.",
    "Queue management: Monitor and control transcoding queues with priority settings and manual intervention options.",
    "Statistics dashboard: View transcoding progress, space saved, and processing statistics in a comprehensive dashboard.",
    "File organization: Automatically organize and rename files after transcoding based on customizable patterns.",
    "Staging system: Test transcoding rules on sample files before applying them to entire libraries.",
    "Notification system: Receive alerts when transcoding jobs complete, fail, or require attention."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
