{
  "name": "teable",
  "slug": "teable",
  "tagline": null,
  "description": "Teable is an open-source, self-hosted Airtable alternative with relational tables, views, and collaboration features. It provides forms, filters, and integrations through a modern web UI and REST API, with optional managed hosting.",
  "categories": [
    151
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "v1.10.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-09-15",
    "date_last_commit": "2025-12-13",
    "github_stars": 20534
  },
  "resources": {
    "website": "https://teable.ai",
    "documentation": "https://github.com/teableio/teable",
    "source_code": "https://github.com/teableio/teable",
    "logo": "/icons/teable.webp",
    "issues": "https://github.com/teableio/teable/issues",
    "releases": "https://github.com/teableio/teable/releases"
  },
  "features": [
    "Relational tables: Create interconnected tables with relationships, lookups, and rollups for complex data modeling.",
    "Multiple views: Display data in grid, kanban, gallery, calendar, or form views to match different workflows.",
    "Collaboration: Work together in real-time with team members on shared bases with granular permission controls.",
    "Forms: Generate public or private forms from tables to collect data from users without database access.",
    "Filtering and sorting: Apply complex filters and multi-level sorting to focus on relevant data subsets.",
    "REST API: Access and manipulate data programmatically through a comprehensive REST API for integrations.",
    "Field types: Use rich field types including text, numbers, dates, attachments, checkboxes, and formulas.",
    "Formulas: Calculate values dynamically using spreadsheet-like formulas with functions and field references.",
    "Automation: Trigger actions automatically based on data changes or schedules for workflow automation.",
    "Import and export: Import data from CSV, Excel, or other sources and export in multiple formats.",
    "Templates: Start quickly with pre-built templates for common use cases like project management or CRM.",
    "Self-hosted or cloud: Choose between self-hosting for full control or managed cloud hosting for convenience."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
