{
  "name": "technitium",
  "slug": "technitium",
  "tagline": null,
  "description": "Technitium DNS Server is a self-hosted, privacy-focused authoritative and recursive DNS server. It offers DNS-over-HTTPS/TLS, blocking, logging, and a comprehensive web management console for home and enterprise networks.",
  "categories": [
    36
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-07",
    "github_stars": 6922
  },
  "resources": {
    "website": "https://technitium.com/dns/",
    "documentation": "https://github.com/TechnitiumSoftware/DnsServer",
    "source_code": "https://github.com/TechnitiumSoftware/DnsServer",
    "logo": "/icons/technitium.webp",
    "issues": "https://github.com/TechnitiumSoftware/DnsServer/issues",
    "releases": null
  },
  "features": [
    "Authoritative DNS: Host your own domains with full zone management and record type support.",
    "Recursive resolver: Provide DNS resolution for your network with caching for improved performance.",
    "DNS-over-HTTPS: Secure DNS queries using DoH protocol to prevent eavesdropping and manipulation.",
    "DNS-over-TLS: Encrypt DNS traffic with DoT for privacy-focused resolution on compatible clients.",
    "Ad blocking: Block ads and trackers at the DNS level using customizable blocklists and allow lists.",
    "Query logging: Log all DNS queries for troubleshooting, security analysis, and network monitoring.",
    "DNSSEC validation: Validate DNSSEC signatures to ensure DNS responses haven't been tampered with.",
    "Conditional forwarding: Forward specific domains to designated DNS servers for split-horizon setups.",
    "Web console: Manage all DNS settings through an intuitive web-based administration interface.",
    "Zone transfer: Support AXFR and IXFR zone transfers for secondary DNS server configurations.",
    "Dynamic updates: Allow authorized clients to update DNS records dynamically for DHCP integration.",
    "Statistics dashboard: Monitor query statistics, top domains, and server performance metrics in real-time."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
