{
  "name": "teemii",
  "slug": "teemii",
  "tagline": null,
  "description": "Teemii is a self-hosted team and project management board with tasks, statuses, and collaboration features. It provides a simple, responsive web UI for managing workloads and progress across teams.",
  "categories": [
    165
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.8.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2024-01-15",
    "date_last_commit": "2024-01-15",
    "github_stars": 440
  },
  "resources": {
    "website": "https://www.teemii.io",
    "documentation": "https://github.com/dokkaner/teemii",
    "source_code": "https://github.com/dokkaner/teemii",
    "logo": "/icons/teemii.webp",
    "issues": "https://github.com/dokkaner/teemii/issues",
    "releases": "https://github.com/dokkaner/teemii/releases"
  },
  "features": [
    "Project boards: Organize work into projects with customizable boards for different teams or initiatives.",
    "Task management: Create and assign tasks with descriptions, due dates, and priority levels for clear accountability.",
    "Status tracking: Track task progress through customizable status columns like todo, in progress, and done.",
    "Team collaboration: Work together with team members on shared projects with real-time updates and notifications.",
    "Responsive design: Access project boards from desktop, tablet, or mobile devices with a fully responsive interface.",
    "Task assignment: Assign tasks to team members and track who is responsible for each item.",
    "Progress visualization: View project progress at a glance with visual indicators and completion percentages.",
    "Comments: Discuss tasks with team members using threaded comments for context and collaboration.",
    "Simple setup: Get started quickly with minimal configuration and an intuitive user interface.",
    "Workload overview: See team capacity and task distribution to balance workloads effectively.",
    "Filtering: Filter tasks by assignee, status, priority, or custom criteria to focus on relevant work.",
    "Activity tracking: Monitor recent changes and updates across projects to stay informed of progress."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
