{
  "name": "termix",
  "slug": "termix",
  "tagline": null,
  "description": "Termix is a self-hosted SSH management platform that exposes terminals in the browser. It lets admins organize hosts, manage keys, and open shell sessions directly from a web interface.",
  "categories": [
    135
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "release-1.9.0-tag",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-17",
    "date_last_commit": "2025-12-12",
    "github_stars": 8226
  },
  "resources": {
    "website": "https://docs.termix.site/",
    "documentation": "https://github.com/Termix-SSH/Termix",
    "source_code": "https://github.com/Termix-SSH/Termix",
    "logo": "/icons/termix.webp",
    "issues": "https://github.com/Termix-SSH/Termix/issues",
    "releases": "https://github.com/Termix-SSH/Termix/releases"
  },
  "features": [
    "Browser-based SSH: Access SSH terminals directly in your web browser without installing client software.",
    "Host management: Organize and manage SSH hosts with groups, tags, and custom connection settings.",
    "Key management: Store and manage SSH keys securely with support for multiple keys per host.",
    "Multi-session: Open multiple SSH sessions simultaneously in tabs for efficient server management.",
    "Connection sharing: Share terminal sessions with team members for collaborative troubleshooting and pair administration.",
    "Web interface: Access your servers from any device with a modern, responsive web interface.",
    "Session persistence: Maintain SSH sessions even when closing the browser with automatic reconnection.",
    "Command history: Access command history across sessions for quick reference and repeated operations.",
    "File transfer: Upload and download files through the web interface using SFTP integration.",
    "Custom themes: Personalize the terminal appearance with color schemes and font customization.",
    "Mobile support: Manage servers from mobile devices with touch-optimized controls and keyboard.",
    "Access control: Define user permissions and restrict access to specific hosts or host groups."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": true,
      "ios": true
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
