{
  "name": "teslamate",
  "slug": "teslamate",
  "tagline": null,
  "description": "TeslaMate is a self-hosted data logger and visualization platform for Tesla vehicles. It records drives, charges, and states via the Tesla API and exposes dashboards and statistics through Grafana and its own web interface.",
  "categories": [
    175
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v2.2.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-06",
    "date_last_commit": "2025-12-13",
    "github_stars": 7402
  },
  "resources": {
    "website": "https://docs.teslamate.org",
    "documentation": "https://github.com/teslamate-org/teslamate",
    "source_code": "https://github.com/teslamate-org/teslamate",
    "logo": "/icons/teslamate.webp",
    "issues": "https://github.com/teslamate-org/teslamate/issues",
    "releases": "https://github.com/teslamate-org/teslamate/releases"
  },
  "features": [
    "Drive logging: Automatically record all drives with route, distance, duration, and energy consumption data.",
    "Charge tracking: Monitor charging sessions including location, duration, energy added, and cost calculations.",
    "State monitoring: Track vehicle state changes including sleep, idle, driving, and charging with timeline views.",
    "Grafana dashboards: Visualize data through rich Grafana dashboards with customizable charts and metrics.",
    "Efficiency analysis: Analyze driving efficiency, energy consumption, and regenerative braking performance over time.",
    "Cost tracking: Calculate charging costs and compare home vs. supercharger expenses for budget management.",
    "Geofencing: Define locations like home or work to automatically categorize trips and charging sessions.",
    "Battery degradation: Track battery health and capacity over time to monitor long-term vehicle condition.",
    "Trip history: Browse complete trip history with maps, statistics, and detailed information for each journey.",
    "Software updates: Log vehicle software updates and track feature changes across firmware versions.",
    "API integration: Connect to Tesla API to retrieve real-time vehicle data and historical information.",
    "Privacy controls: Keep all vehicle data on your own server with no third-party access or cloud dependencies."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
