{
  "name": "testflight-watcher",
  "slug": "testflight-watcher",
  "tagline": "",
  "description": "testflight-watcher is a self-hosted tool that monitors TestFlight public betas and alerts when new spots are available or builds are updated, helping users catch limited beta openings automatically.",
  "categories": [
    172
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2024-12-20",
    "github_stars": 17
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://github.com/MaximilianGT500/testflight-watcher",
    "logo": "/icons/testflight-watcher.webp",
    "issues": "https://github.com/MaximilianGT500/testflight-watcher/issues",
    "releases": null
  },
  "features": [
    "Beta monitoring: Monitor TestFlight public beta programs for availability and new build releases.",
    "Instant alerts: Receive notifications immediately when beta slots open up or new builds are published.",
    "Multiple apps: Track multiple TestFlight apps simultaneously from a single dashboard.",
    "Automatic checking: Poll TestFlight at configurable intervals to catch openings as soon as they happen.",
    "Notification channels: Send alerts via email, Telegram, Discord, or webhooks to your preferred platform.",
    "Build tracking: Track version numbers and build updates to stay informed of app development progress.",
    "Availability history: View historical data on when beta slots were available and how quickly they filled.",
    "Custom intervals: Configure check frequency per app to balance responsiveness with API rate limits.",
    "Status dashboard: View current status of all monitored apps in a centralized web interface.",
    "Quiet hours: Disable notifications during specific times to avoid alerts during sleep or work hours.",
    "Link generation: Get direct TestFlight links in notifications for immediate beta access.",
    "Lightweight operation: Run efficiently with minimal resource usage for continuous monitoring."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
