{
  "name": "thrifty",
  "slug": "thrifty",
  "tagline": "",
  "description": "Thrifty is a self-hosted personal finance web app for tracking spending, income, and budgets. It offers charts, categories, and insights via a clean, mobile-friendly interface for managing everyday expenses.",
  "categories": [
    22
  ],
  "metadata": {
    "sponsored": false,
    "license": "BSD-2-Clause",
    "version": "v1.8.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-02-05",
    "date_last_commit": "2025-05-19",
    "github_stars": 94
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://github.com/tiehfood/thrifty",
    "logo": "/icons/thrifty.webp",
    "issues": "https://github.com/tiehfood/thrifty/issues",
    "releases": "https://github.com/tiehfood/thrifty/releases"
  },
  "features": [
    "Expense tracking: Record daily expenses with categories, amounts, and notes for comprehensive spending oversight.",
    "Income management: Track income sources and amounts to understand your complete financial picture.",
    "Budget planning: Set monthly or category-based budgets and monitor spending against targets with visual indicators.",
    "Charts and insights: Visualize spending patterns with charts showing trends, category breakdowns, and comparisons.",
    "Category system: Organize transactions with customizable categories for detailed expense analysis.",
    "Mobile-friendly: Manage finances on the go with a responsive interface optimized for mobile devices.",
    "Transaction history: Browse complete transaction history with search and filtering capabilities.",
    "Recurring expenses: Track recurring bills and subscriptions to understand fixed monthly costs.",
    "Reports: Generate financial reports for specific periods to review spending habits and identify savings opportunities.",
    "Privacy-focused: Keep all financial data on your own server with no third-party access or data sharing.",
    "Quick entry: Add transactions rapidly with minimal required fields and smart defaults.",
    "Balance tracking: Monitor account balances over time to understand cash flow and savings progress."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
