{
  "name": "tianji",
  "slug": "tianji",
  "tagline": null,
  "description": "Tianji is a self-hosted website analytics and monitoring platform focused on privacy. It tracks visits, referrers, uptime, and performance, presenting insights in a modern, lightweight dashboard.",
  "categories": [
    186
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v1.30.22",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-11",
    "date_last_commit": "2025-12-11",
    "github_stars": 2860
  },
  "resources": {
    "website": "https://tianji.dev",
    "documentation": "https://github.com/msgbyte/tianji",
    "source_code": "https://github.com/msgbyte/tianji",
    "logo": "/icons/tianji.webp",
    "issues": "https://github.com/msgbyte/tianji/issues",
    "releases": "https://github.com/msgbyte/tianji/releases"
  },
  "features": [
    "Website analytics: Track page views, visitors, and referrers without cookies or invasive tracking methods.",
    "Uptime monitoring: Monitor website and service availability with configurable check intervals and alerting.",
    "Performance tracking: Measure page load times and performance metrics to identify optimization opportunities.",
    "Privacy-focused: Collect analytics data without personal information or tracking individual users across sessions.",
    "Real-time dashboard: View current visitor activity and system status in a live-updating dashboard.",
    "Custom events: Track custom events and conversions to measure specific user actions and goals.",
    "Multiple sites: Monitor multiple websites and services from a single installation with separate dashboards.",
    "Lightweight script: Use a minimal tracking script that doesn't impact page load performance.",
    "Alerts: Receive notifications when monitored services go down or performance degrades.",
    "Historical data: Access historical analytics and uptime data to identify trends and patterns over time.",
    "Geographic insights: View visitor locations and traffic sources without compromising individual privacy.",
    "API access: Integrate analytics data into other tools using the REST API for custom reporting."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
