{
  "name": "ticky",
  "slug": "ticky",
  "tagline": null,
  "description": "Ticky is a self-hosted issue and ticket tracker that enables teams to record, categorize, and resolve tasks. It features status boards, comments, and a simple web interface suitable for small teams or personal projects.",
  "categories": [
    85
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v1.15.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-25",
    "date_last_commit": "2025-11-25",
    "github_stars": 254
  },
  "resources": {
    "website": "https://github.com/dkorecko/Ticky",
    "documentation": "https://github.com/dkorecko/Ticky",
    "source_code": "https://github.com/dkorecko/Ticky",
    "logo": "/icons/ticky.webp",
    "issues": "https://github.com/dkorecko/Ticky/issues",
    "releases": "https://github.com/dkorecko/Ticky/releases"
  },
  "features": [
    "Issue tracking: Create and manage issues with titles, descriptions, and detailed information for problem resolution.",
    "Status boards: Organize issues on boards with customizable status columns for workflow visualization.",
    "Categorization: Group issues by project, type, or custom categories for better organization.",
    "Comments: Discuss issues with team members using threaded comments for context and collaboration.",
    "Assignment: Assign issues to team members to clarify responsibility and track workload distribution.",
    "Priority levels: Set priority levels for issues to focus on critical problems first.",
    "Simple interface: Navigate and manage issues through a straightforward web interface without complexity.",
    "Search and filter: Find issues quickly using search and filter by status, assignee, or category.",
    "Activity tracking: Monitor recent changes and updates to stay informed of issue resolution progress.",
    "Small team focus: Designed for small teams or personal projects without enterprise overhead.",
    "Attachment support: Add files and screenshots to issues for better documentation and context.",
    "Resolution tracking: Mark issues as resolved and maintain history for reference and reporting."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
