{
  "name": "tiddlywiki",
  "slug": "tiddlywiki",
  "tagline": null,
  "description": "TiddlyWiki is a unique self-contained wiki and personal knowledge base that runs in the browser as a single HTML file. It supports plugins, scripting, and nonlinear note-taking, and can be self-hosted or stored locally.",
  "categories": [
    193
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-09",
    "github_stars": 8481
  },
  "resources": {
    "website": "https://tiddlywiki.com/",
    "documentation": "https://github.com/TiddlyWiki/TiddlyWiki5",
    "source_code": "https://github.com/TiddlyWiki/TiddlyWiki5",
    "logo": "/icons/tiddlywiki.webp",
    "issues": "https://github.com/TiddlyWiki/TiddlyWiki5/issues",
    "releases": null,
    "logo_light": "/icons/tiddlywiki-light.webp"
  },
  "features": [
    "Single-file wiki: Store your entire wiki in a single HTML file that runs in any web browser.",
    "Nonlinear notes: Create interconnected notes with bidirectional links for knowledge graph-style organization.",
    "Plugin system: Extend functionality with hundreds of community plugins for themes, features, and integrations.",
    "Transclusion: Embed content from one note into another for reusable components and dynamic content.",
    "Tagging: Organize notes with tags and view tag hierarchies for flexible categorization.",
    "Search: Find content across all notes using full-text search with filters and advanced queries.",
    "Macros and scripting: Automate tasks and create custom functionality using built-in macro language.",
    "Portable: Run from local file system, USB drive, or self-hosted server with no installation required.",
    "Version control: Track changes with built-in history or use Git for version control of the HTML file.",
    "Customizable: Modify appearance and behavior extensively through CSS, JavaScript, and configuration.",
    "Export options: Export individual notes or entire wiki in various formats including HTML, Markdown, or JSON.",
    "Offline-first: Work completely offline with optional server sync for multi-device access."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
