{
  "name": "tillywork",
  "slug": "tillywork",
  "tagline": null,
  "description": "Tillywork is a self-hosted project and task management platform inspired by modern work tools. It supports boards, timelines, comments, and integrations, providing teams a focused environment to collaborate.",
  "categories": [
    125
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.1.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-05-08",
    "date_last_commit": "2025-07-28",
    "github_stars": 1270
  },
  "resources": {
    "website": "https://tilly.work",
    "documentation": "https://github.com/tillywork/tillywork",
    "source_code": "https://github.com/tillywork/tillywork",
    "logo": "/icons/tillywork.webp",
    "issues": "https://github.com/tillywork/tillywork/issues",
    "releases": "https://github.com/tillywork/tillywork/releases"
  },
  "features": [
    "Project boards: Organize work into projects with kanban-style boards for visual task management.",
    "Timeline views: Plan and visualize project schedules with Gantt-style timeline views for deadline tracking.",
    "Task management: Create detailed tasks with descriptions, assignees, due dates, and custom fields.",
    "Comments: Collaborate on tasks with threaded comments and mentions for team communication.",
    "Integrations: Connect with external tools and services through webhooks and API integrations.",
    "Custom workflows: Define custom statuses and workflows that match your team's processes.",
    "File attachments: Attach documents and files to tasks for centralized project documentation.",
    "Activity feeds: Track project activity and changes in real-time with comprehensive activity logs.",
    "Team collaboration: Work together with team members on shared projects with role-based permissions.",
    "Search and filter: Find tasks across projects using powerful search and filtering capabilities.",
    "Notifications: Stay informed of task updates, mentions, and deadlines with customizable notifications.",
    "Mobile responsive: Access projects from any device with a fully responsive web interface."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
