{
  "name": "tiny-tiny-rss",
  "slug": "tiny-tiny-rss",
  "tagline": null,
  "description": "Tiny Tiny RSS (tt-rss) is a self-hosted web-based RSS/Atom feed reader. It supports filters, plugins, multiple users, and mobile-friendly themes, giving full control over news aggregation.",
  "categories": [
    57
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-12",
    "github_stars": 484
  },
  "resources": {
    "website": "https://github.com/tt-rss/tt-rss",
    "documentation": "https://github.com/tt-rss/tt-rss",
    "source_code": "https://github.com/tt-rss/tt-rss",
    "logo": "/icons/tiny-tiny-rss.webp",
    "issues": "https://github.com/tt-rss/tt-rss/issues",
    "releases": null
  },
  "features": [
    "Feed aggregation: Subscribe to unlimited RSS and Atom feeds from news sites, blogs, and podcasts.",
    "Multi-user: Support multiple users with individual subscriptions, preferences, and reading history.",
    "Filters: Create powerful filters to automatically tag, mark, or hide articles based on content or source.",
    "Plugin system: Extend functionality with plugins for features like sharing, archiving, or custom integrations.",
    "Mobile themes: Access feeds from mobile devices with responsive themes optimized for touch interfaces.",
    "Keyboard shortcuts: Navigate articles and feeds efficiently using comprehensive keyboard shortcuts.",
    "Article sharing: Share interesting articles via email, social media, or custom sharing services.",
    "OPML support: Import and export feed subscriptions using standard OPML format for portability.",
    "Feed categories: Organize feeds into categories and folders for better management of large subscription lists.",
    "Search: Find articles across all feeds using full-text search with date and feed filters.",
    "API access: Integrate with mobile apps and third-party clients using the compatible API.",
    "Content filtering: Block unwanted content with regex-based filters and scoring systems."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
