{
  "name": "tooljet",
  "slug": "tooljet",
  "tagline": null,
  "description": "ToolJet is an open-source low-code platform to build internal apps using a drag-and-drop UI. It connects to databases and APIs, supports role-based access, and can be self-hosted or used as a managed cloud service.",
  "categories": [
    110
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v3.20.57-lts",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-12",
    "date_last_commit": "2025-12-12",
    "github_stars": 37037
  },
  "resources": {
    "website": "https://tooljet.ai",
    "documentation": "https://github.com/ToolJet/ToolJet",
    "source_code": "https://github.com/ToolJet/ToolJet",
    "logo": "/icons/tooljet.webp",
    "issues": "https://github.com/ToolJet/ToolJet/issues",
    "releases": "https://github.com/ToolJet/ToolJet/releases"
  },
  "features": [
    "Drag-and-drop builder: Create internal tools using a visual interface without writing extensive code.",
    "Database connections: Connect to PostgreSQL, MySQL, MongoDB, and other databases for data access.",
    "API integration: Integrate with REST APIs, GraphQL endpoints, and third-party services seamlessly.",
    "Pre-built components: Use ready-made UI components like tables, forms, charts, and buttons for rapid development.",
    "Custom queries: Write SQL, JavaScript, or Python queries to fetch and manipulate data from connected sources.",
    "Role-based access: Define user roles and permissions to control access to apps and data.",
    "Workflows: Automate business processes with visual workflow builder and event triggers.",
    "Mobile responsive: Build apps that work on desktop, tablet, and mobile devices automatically.",
    "Version control: Track changes to applications with built-in version history and rollback capabilities.",
    "Collaboration: Work with team members on app development with real-time collaboration features.",
    "Self-hosted or cloud: Deploy on your infrastructure for full control or use managed cloud for convenience.",
    "Marketplace: Access pre-built templates and plugins from the community marketplace for faster development."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
