{
  "name": "tootik",
  "slug": "tootik",
  "tagline": "",
  "description": "Tootik is a self-hosted microblogging platform implementing ActivityPub, enabling federated social networking. It provides timelines, posts, and interactions via a simple, lightweight web UI.",
  "categories": [
    148
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v0.20.6",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-11",
    "date_last_commit": "2025-12-12",
    "github_stars": 185
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://github.com/dimkr/tootik",
    "logo": "/icons/tootik.webp",
    "issues": "https://github.com/dimkr/tootik/issues",
    "releases": "https://github.com/dimkr/tootik/releases"
  },
  "features": [
    "ActivityPub federation: Connect with Mastodon, Pleroma, and other federated social networks using ActivityPub protocol.",
    "Microblogging: Post short updates, thoughts, and content to share with followers across the fediverse.",
    "Timeline views: Browse home, local, and federated timelines to discover content and conversations.",
    "Interactions: Like, boost, and reply to posts from users on your instance and across federated servers.",
    "Following: Follow users from any compatible instance to see their posts in your timeline.",
    "Lightweight: Run efficiently with minimal resource requirements suitable for personal or small community instances.",
    "Web interface: Access your social network through a simple, straightforward web interface.",
    "Privacy controls: Control post visibility with public, unlisted, followers-only, or direct message options.",
    "Media support: Share images and other media files with posts for richer content sharing.",
    "Notifications: Receive notifications for mentions, follows, and interactions with your content.",
    "Search: Find users and posts across your instance and the federated network.",
    "Profile customization: Set up your profile with bio, avatar, and header image to express your identity."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
