{
  "name": "traccar",
  "slug": "traccar",
  "tagline": null,
  "description": "Traccar is a self-hosted GPS tracking platform that collects location data from various devices and mobile apps. It features real-time map views, alerts, and reports via a rich web UI and mobile-friendly tools, plus a hosted cloud option.",
  "categories": [
    92
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v6.11.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-07",
    "date_last_commit": "2025-12-12",
    "github_stars": 6727
  },
  "resources": {
    "website": "https://www.traccar.org",
    "documentation": "https://github.com/traccar/traccar",
    "source_code": "https://github.com/traccar/traccar",
    "logo": "/icons/traccar.webp",
    "issues": "https://github.com/traccar/traccar/issues",
    "releases": "https://github.com/traccar/traccar/releases"
  },
  "features": [
    "Real-time tracking: View device locations on interactive maps with live updates and position history.",
    "Multi-device support: Track hundreds of different GPS device models and mobile apps simultaneously.",
    "Geofencing: Define geographic boundaries and receive alerts when devices enter or exit zones.",
    "Reports: Generate detailed reports on trips, stops, mileage, and device activity for any time period.",
    "Alerts: Set up notifications for speeding, geofence violations, device offline, and other events.",
    "Mobile apps: Track devices using official Android and iOS apps that report location to your server.",
    "Route playback: Replay historical routes with timeline controls to review past trips and movements.",
    "Multi-user: Support multiple users with individual permissions and device access controls.",
    "Web interface: Access tracking features through a modern, responsive web interface from any browser.",
    "API access: Integrate tracking data into other applications using the comprehensive REST API.",
    "Computed attributes: Calculate custom values like fuel consumption or engine hours from device data.",
    "Cloud or self-hosted: Choose between self-hosting for privacy or using the managed cloud service."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
