{
  "name": "tvheadend",
  "slug": "tvheadend",
  "tagline": null,
  "description": "Tvheadend is a self-hosted TV streaming server and recorder for DVB, ATSC, IPTV and more. It offers channel management, EPG, recording rules, and streaming to clients via an integrated web interface.",
  "categories": [
    107
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-08",
    "github_stars": 3274
  },
  "resources": {
    "website": "https://tvheadend.org",
    "documentation": "https://github.com/tvheadend/tvheadend",
    "source_code": "https://github.com/tvheadend/tvheadend",
    "logo": "/icons/tvheadend.webp",
    "issues": "https://github.com/tvheadend/tvheadend/issues",
    "releases": null
  },
  "features": [
    "Live TV streaming: Stream live TV from DVB, ATSC, IPTV, or other sources to network clients.",
    "Recording: Schedule and record TV programs with series recording and conflict resolution.",
    "EPG support: Display electronic program guides from various sources for easy program browsing.",
    "Multi-tuner: Support multiple TV tuners simultaneously for watching and recording different channels.",
    "Transcoding: Transcode streams on-the-fly for compatibility with different devices and bandwidth.",
    "Web interface: Manage channels, recordings, and settings through a comprehensive web interface.",
    "Client support: Stream to various clients including Kodi, VLC, and mobile apps.",
    "Channel management: Scan, organize, and configure TV channels with custom numbering and grouping.",
    "Recording rules: Set up complex recording rules based on title, genre, or other criteria.",
    "Timeshift: Pause and rewind live TV with timeshift buffer functionality.",
    "User management: Support multiple users with individual channel access and recording permissions.",
    "DVR functionality: Full-featured DVR with series recording, conflict management, and storage management."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
