{
  "name": "umami",
  "slug": "umami",
  "tagline": null,
  "description": "Umami is a self-hosted, privacy-friendly web analytics platform. It uses a small tracking script and offers clean dashboards, goal tracking, and multi-site support, with an optional hosted cloud service.",
  "categories": [
    186
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v3.0.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-12",
    "date_last_commit": "2025-12-12",
    "github_stars": 34110
  },
  "resources": {
    "website": "https://umami.is",
    "documentation": "https://github.com/umami-software/umami",
    "source_code": "https://github.com/umami-software/umami",
    "logo": "/icons/umami.webp",
    "issues": "https://github.com/umami-software/umami/issues",
    "releases": "https://github.com/umami-software/umami/releases",
    "logo_light": "/icons/umami-light.webp"
  },
  "features": [
    "Web Analytics: Monitor web traffic and user sessions with a GA-like dashboard to easily track conversion, web vitals, and revenue metrics.",
    "Privacy Controls: Ensure GDPR and CCPA compliance with built-in consent management, data anonymization, and configurable retention policies for user data.",
    "Multi-Site Support: Manage analytics for multiple websites from a single dashboard with unified reporting and cross-site comparison capabilities.",
    "Goal Tracking: Define and monitor custom conversion goals with event-based tracking to measure success of key user actions and campaigns.",
    "User Attribution: Track user journeys across devices and sessions with cross-domain tracking, UTM parameters, and referral source attribution for accurate marketing ROI.",
    "Lightweight Tracking: Minimal script size ensures fast page loads without impacting site performance or user experience.",
    "Team Collaboration: Share insights with role-based access controls, collaborative annotations on charts, and scheduled report delivery to keep stakeholders aligned.",
    "API Integrations: Connect with third-party tools via REST APIs, webhooks, and native integrations to centralize data and automate workflows across your stack."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
