{
  "name": "wallabag",
  "slug": "wallabag",
  "tagline": null,
  "description": "Wallabag is a self-hosted read-it-later service. It saves articles from the web, cleans them up for reading, and organizes content with tags and full-text search, with mobile apps and browser integrations available.",
  "categories": [
    129
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "2.6.14",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-07",
    "date_last_commit": "2025-12-08",
    "github_stars": 12246
  },
  "resources": {
    "website": "https://wallabag.org",
    "documentation": "https://github.com/wallabag/wallabag",
    "source_code": "https://github.com/wallabag/wallabag",
    "logo": "/icons/wallabag.webp",
    "issues": "https://github.com/wallabag/wallabag/issues",
    "releases": "https://github.com/wallabag/wallabag/releases",
    "logo_light": "/icons/wallabag-light.webp"
  },
  "features": [
    "Article saving: Capture web articles with a single click using browser extensions or bookmarklets for later reading.",
    "Content extraction: Automatically strip ads, navigation, and clutter to present clean, readable article text.",
    "Full-text search: Quickly find saved articles using powerful search across titles, content, and tags.",
    "Tagging system: Organize articles with custom tags for easy categorization and retrieval.",
    "Reading progress: Track reading status with archive, favorite, and unread markers to manage your reading queue.",
    "Mobile apps: Access your reading list on iOS and Android with native apps that sync seamlessly.",
    "RSS feeds: Generate RSS feeds from your saved articles or tags for integration with feed readers.",
    "Annotations: Highlight text and add notes directly within articles for research or reference purposes.",
    "Multi-user support: Create separate accounts for family members or team members with individual reading lists.",
    "Import/export: Migrate from Pocket, Instapaper, or other services with built-in import tools and export options.",
    "Reading time estimates: See estimated reading time for each article to plan your reading sessions effectively.",
    "Offline access: Download articles for offline reading when traveling or in areas with poor connectivity."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
