{
  "name": "wallos",
  "slug": "wallos",
  "tagline": null,
  "description": "Wallos is a self-hosted subscription management app that tracks recurring expenses. It shows cost breakdowns, renewal dates, and categories in a clean, mobile-friendly interface.",
  "categories": [
    22
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v4.5.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-18",
    "date_last_commit": "2025-10-18",
    "github_stars": 6877
  },
  "resources": {
    "website": "https://github.com/ellite/Wallos",
    "documentation": "https://github.com/ellite/Wallos",
    "source_code": "https://github.com/ellite/Wallos",
    "logo": "/icons/wallos.webp",
    "issues": "https://github.com/ellite/Wallos/issues",
    "releases": "https://github.com/ellite/Wallos/releases"
  },
  "features": [
    "Subscription tracking: Monitor all recurring expenses including streaming services, software licenses, and memberships in one place.",
    "Cost breakdown: View total monthly, yearly, and lifetime costs with automatic calculations and currency conversion.",
    "Renewal reminders: Get notified before subscriptions renew to decide whether to continue or cancel services.",
    "Category organization: Group subscriptions by type such as entertainment, productivity, or utilities for better oversight.",
    "Payment method tracking: Associate subscriptions with specific credit cards or payment methods to manage billing.",
    "Price history: Track subscription price changes over time to identify cost increases and optimize spending.",
    "Spending analytics: Visualize subscription costs with charts and graphs showing spending patterns and trends.",
    "Multi-currency support: Handle subscriptions in different currencies with automatic conversion to your base currency.",
    "Custom billing cycles: Support monthly, yearly, quarterly, or custom billing periods for accurate cost tracking.",
    "Export reports: Generate spending reports in PDF or CSV format for budgeting or expense reimbursement.",
    "Mobile responsive: Manage subscriptions on the go with a fully responsive interface optimized for smartphones.",
    "Privacy focused: Keep financial data private on your own server without sharing with third-party services."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
