{
  "name": "wastebin",
  "slug": "wastebin",
  "tagline": null,
  "description": "Wastebin is a simple self-hosted pastebin service for sharing text snippets and logs. It offers syntax highlighting, expiration options, and a minimalistic web UI.",
  "categories": [
    118
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "3.3.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-08-17",
    "date_last_commit": "2025-12-12",
    "github_stars": 710
  },
  "resources": {
    "website": "https://github.com/matze/wastebin",
    "documentation": "https://github.com/matze/wastebin",
    "source_code": "https://github.com/matze/wastebin",
    "logo": "/icons/wastebin.webp",
    "issues": "https://github.com/matze/wastebin/issues",
    "releases": "https://github.com/matze/wastebin/releases"
  },
  "features": [
    "Text sharing: Quickly share code snippets, logs, or text content with automatically generated shareable links.",
    "Syntax highlighting: Display code with proper syntax highlighting for over 100 programming languages and formats.",
    "Expiration options: Set automatic deletion times ranging from minutes to never for temporary or permanent pastes.",
    "Raw text access: Retrieve paste content as plain text via direct URLs for easy integration with scripts and tools.",
    "Private pastes: Create password-protected pastes that require authentication before viewing content.",
    "Burn after reading: Enable one-time view mode where pastes self-destruct after being read once.",
    "API access: Programmatically create and retrieve pastes using a simple REST API for automation workflows.",
    "No registration: Share content immediately without creating accounts or providing personal information.",
    "Minimal interface: Focus on functionality with a clean, distraction-free UI that loads quickly.",
    "Self-hosted privacy: Keep sensitive logs and code snippets on your own infrastructure without third-party exposure.",
    "Custom URLs: Generate short, memorable URLs for pastes to make sharing easier.",
    "Line numbering: View code with line numbers for easier reference and discussion in code reviews."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
