{
  "name": "watchstate",
  "slug": "watchstate",
  "tagline": null,
  "description": "Watchstate is a self-hosted TV and movie tracking service that stores watch history and progress, giving an overview of what you’ve seen and what is next.",
  "categories": [
    175
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v1.0.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-07",
    "date_last_commit": "2025-12-07",
    "github_stars": 1198
  },
  "resources": {
    "website": "https://github.com/arabcoders/watchstate",
    "documentation": "https://github.com/arabcoders/watchstate",
    "source_code": "https://github.com/arabcoders/watchstate",
    "logo": "/icons/watchstate.webp",
    "issues": "https://github.com/arabcoders/watchstate/issues",
    "releases": "https://github.com/arabcoders/watchstate/releases"
  },
  "features": [
    "Watch history sync: Synchronize watch progress across multiple media servers including Plex, Jellyfin, and Emby.",
    "Multi-server support: Connect and sync watch states between different media server instances seamlessly.",
    "Episode tracking: Automatically track which episodes you've watched and resume from where you left off.",
    "Conflict resolution: Handle watch state conflicts intelligently when the same content is watched on different servers.",
    "Manual adjustments: Override automatic tracking with manual episode marking for complete control.",
    "Metadata matching: Accurately match content across servers using TMDB, TVDB, or IMDB identifiers.",
    "Scheduled sync: Configure automatic synchronization intervals to keep watch states current without manual intervention.",
    "Webhook support: Trigger syncs automatically when content is played using webhooks from media servers.",
    "Dry run mode: Preview sync operations before applying changes to avoid accidental data modifications.",
    "Detailed logging: Review sync history and troubleshoot issues with comprehensive activity logs.",
    "Selective sync: Choose specific libraries or content types to sync while excluding others.",
    "API access: Integrate with custom applications using the REST API for advanced automation scenarios."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
