{
  "name": "watchyourlan",
  "slug": "watchyourlan",
  "tagline": null,
  "description": "WatchYourLAN is a self-hosted network scanner and device presence monitor. It detects new devices and shows hostnames, vendors, and activity in a sleek web UI.",
  "categories": [
    103
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "2.1.4",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-09-10",
    "date_last_commit": "2025-09-10",
    "github_stars": 6589
  },
  "resources": {
    "website": "https://github.com/aceberg/WatchYourLAN",
    "documentation": "https://github.com/aceberg/WatchYourLAN",
    "source_code": "https://github.com/aceberg/WatchYourLAN",
    "logo": "/icons/watchyourlan.webp",
    "issues": "https://github.com/aceberg/WatchYourLAN/issues",
    "releases": "https://github.com/aceberg/WatchYourLAN/releases"
  },
  "features": [
    "Network scanning: Automatically discover all devices connected to your local network with periodic scans.",
    "Device identification: Display hostnames, MAC addresses, IP addresses, and vendor information for each device.",
    "New device alerts: Get notified immediately when unknown devices join your network for security monitoring.",
    "Presence tracking: Monitor which devices are currently online or offline with real-time status updates.",
    "Device history: View connection history showing when devices joined or left the network over time.",
    "Custom naming: Assign friendly names and icons to devices for easier identification in the dashboard.",
    "Grouping: Organize devices into categories like family, guests, IoT, or servers for better management.",
    "MAC filtering: Whitelist or blacklist devices based on MAC addresses to control network access.",
    "Notification channels: Send alerts via email, Telegram, Pushover, or webhooks when events occur.",
    "Bandwidth monitoring: Track data usage per device to identify bandwidth hogs on your network.",
    "Mobile responsive: Monitor your network from smartphones or tablets with an optimized mobile interface.",
    "Export functionality: Generate reports or export device lists for documentation or network auditing purposes."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": true,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
