{
  "name": "watchtower",
  "slug": "watchtower",
  "tagline": null,
  "description": "Watchtower is a self-hosted automation tool that monitors running Docker containers and automatically updates them when new images are available. It operates as a background container with configuration via environment variables and CLI.",
  "categories": [
    172
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v1.7.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2023-11-11",
    "date_last_commit": "2024-07-30",
    "github_stars": 24361
  },
  "resources": {
    "website": "https://containrrr.dev/watchtower/",
    "documentation": "https://github.com/containrrr/watchtower",
    "source_code": "https://github.com/containrrr/watchtower",
    "logo": "/icons/watchtower.webp",
    "issues": "https://github.com/containrrr/watchtower/issues",
    "releases": "https://github.com/containrrr/watchtower/releases"
  },
  "features": [
    "Automatic updates: Monitor Docker containers and automatically pull and deploy new image versions when available.",
    "Scheduled scans: Configure update check intervals from minutes to days based on your update preferences.",
    "Notification system: Receive alerts via email, Slack, Discord, or webhooks when containers are updated.",
    "Rolling updates: Update containers one at a time to minimize downtime and maintain service availability.",
    "Label-based control: Use Docker labels to include or exclude specific containers from automatic updates.",
    "Pre/post-update hooks: Execute custom scripts before or after updates for backup or validation tasks.",
    "Registry authentication: Support private Docker registries with credential management for enterprise deployments.",
    "Update monitoring: Track update history and view logs of all container updates performed.",
    "Cleanup automation: Automatically remove old Docker images after successful updates to save disk space.",
    "Test mode: Run in monitor-only mode to see what would be updated without making actual changes.",
    "Resource efficient: Minimal CPU and memory footprint suitable for running on resource-constrained hosts.",
    "Multi-host support: Manage updates across multiple Docker hosts using Docker Swarm or remote API connections."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
