{
  "name": "weblate",
  "slug": "weblate",
  "tagline": null,
  "description": "Weblate is a self-hosted continuous localization platform for translating software and websites. It integrates with Git, offers translation editors, and can also be used as a hosted service.",
  "categories": [
    88
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "weblate-5.14.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-07",
    "date_last_commit": "2025-12-13",
    "github_stars": 5601
  },
  "resources": {
    "website": "https://weblate.org/",
    "documentation": "https://github.com/WeblateOrg/weblate",
    "source_code": "https://github.com/WeblateOrg/weblate",
    "logo": "/icons/weblate.webp",
    "issues": "https://github.com/WeblateOrg/weblate/issues",
    "releases": "https://github.com/WeblateOrg/weblate/releases"
  },
  "features": [
    "Translation management: Coordinate software and website translations across multiple languages in one platform.",
    "Git integration: Sync directly with Git repositories to keep translations in version control alongside code.",
    "Translation memory: Reuse previous translations automatically to maintain consistency and speed up work.",
    "Machine translation: Leverage services like Google Translate, DeepL, or Microsoft Translator for initial drafts.",
    "Quality checks: Automatically detect translation issues like missing placeholders, formatting errors, or inconsistencies.",
    "Glossary support: Maintain terminology glossaries to ensure consistent translation of technical terms.",
    "Collaborative workflow: Enable multiple translators to work simultaneously with conflict resolution and review processes.",
    "Context information: Provide translators with screenshots, source code context, and comments for accurate translations.",
    "API access: Automate translation workflows and integrate with CI/CD pipelines using the REST API.",
    "Format support: Handle various file formats including PO, JSON, XLIFF, Android XML, iOS strings, and more.",
    "Translation statistics: Track progress with detailed metrics showing completion rates per language and component.",
    "Access control: Define translator roles and permissions to control who can translate or review specific projects."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
