{
  "name": "webtrees",
  "slug": "webtrees",
  "tagline": null,
  "description": "webtrees is a self-hosted genealogy application that lets users build and explore family trees online. It supports GEDCOM imports, collaboration, and detailed person records via a web interface.",
  "categories": [
    71
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "2.2.4",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-08-04",
    "date_last_commit": "2025-12-12",
    "github_stars": 677
  },
  "resources": {
    "website": "https://webtrees.net",
    "documentation": "https://github.com/fisharebest/webtrees",
    "source_code": "https://github.com/fisharebest/webtrees",
    "logo": "/icons/webtrees.webp",
    "issues": "https://github.com/fisharebest/webtrees/issues",
    "releases": "https://github.com/fisharebest/webtrees/releases"
  },
  "features": [
    "Family tree building: Create comprehensive family trees with individuals, relationships, and multiple generations.",
    "GEDCOM support: Import and export family data using the standard GEDCOM format for compatibility with other tools.",
    "Media management: Attach photos, documents, and videos to individuals and events for rich family histories.",
    "Collaborative editing: Allow multiple family members to contribute and edit the family tree simultaneously.",
    "Privacy controls: Set visibility levels for living individuals to protect privacy while sharing historical data.",
    "Timeline views: Visualize family history with interactive timelines showing births, marriages, and deaths.",
    "Relationship calculator: Determine how any two individuals in the tree are related with detailed relationship paths.",
    "Research tools: Track sources, citations, and research notes to document the evidence for family connections.",
    "Statistics reports: Generate reports showing family statistics, most common names, and demographic trends.",
    "Multi-language support: Display the interface in dozens of languages for international family collaboration.",
    "Custom themes: Personalize the appearance with themes and color schemes to match family preferences.",
    "Search functionality: Find individuals quickly by name, date, place, or other attributes across the entire tree."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
