{
  "name": "linuxserver-webtop",
  "slug": "webtop",
  "tagline": null,
  "description": "docker-webtop provides a full Linux desktop environment in a browser via a Docker container. It’s ideal for remote GUI access, development environments, or lightweight workstation use.",
  "categories": [
    43
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "fb4deef3-ls271",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-09",
    "date_last_commit": "2025-12-09",
    "github_stars": 3723
  },
  "resources": {
    "website": "https://github.com/linuxserver/docker-webtop",
    "documentation": "https://github.com/linuxserver/docker-webtop",
    "source_code": "https://github.com/linuxserver/docker-webtop",
    "logo": "/icons/webtop.webp",
    "issues": "https://github.com/linuxserver/docker-webtop/issues",
    "releases": "https://github.com/linuxserver/docker-webtop/releases"
  },
  "features": [
    "Full desktop environment: Access a complete Linux desktop with KDE, XFCE, or other desktop environments in your browser.",
    "Application support: Run GUI applications including browsers, IDEs, office suites, and development tools.",
    "Persistent storage: Save files and settings that persist across container restarts for continuous workflows.",
    "Multi-user access: Create isolated desktop environments for multiple users with separate configurations.",
    "Copy-paste support: Transfer text and data between your local machine and the remote desktop seamlessly.",
    "Audio support: Stream audio from desktop applications to your browser for multimedia applications.",
    "File transfer: Upload and download files between your local system and the remote desktop environment.",
    "Custom resolution: Adjust desktop resolution dynamically to match your browser window or display preferences.",
    "Keyboard mapping: Use your local keyboard layout with proper key mapping for international users.",
    "Clipboard sync: Synchronize clipboard content between local and remote environments for productivity.",
    "Resource isolation: Run resource-intensive applications in containers without affecting your host system.",
    "Quick deployment: Launch a full desktop environment in seconds using Docker with minimal configuration."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
