{
  "name": "weddingshare",
  "slug": "weddingshare",
  "tagline": null,
  "description": "WeddingShare is a self-hosted photo and media sharing platform for weddings and events. Guests can upload, view, and download pictures in a private, beautifully themed gallery.",
  "categories": [
    120
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "1.8.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-30",
    "date_last_commit": "2025-12-07",
    "github_stars": 796
  },
  "resources": {
    "website": "https://docs.wedding-share.org",
    "documentation": "https://github.com/Cirx08/WeddingShare",
    "source_code": "https://github.com/Cirx08/WeddingShare",
    "logo": "/icons/weddingshare.webp",
    "issues": "https://github.com/Cirx08/WeddingShare/issues",
    "releases": "https://github.com/Cirx08/WeddingShare/releases"
  },
  "features": [
    "Photo sharing: Allow wedding guests to upload photos and videos from the celebration in real-time.",
    "Private galleries: Create password-protected galleries accessible only to invited guests for privacy.",
    "Bulk upload: Enable guests to upload multiple photos at once from smartphones or cameras.",
    "Download options: Let guests download individual photos or entire albums in high resolution.",
    "Responsive design: Provide an optimized experience on mobile devices where most guest photos are taken.",
    "No registration required: Allow guests to participate without creating accounts or providing personal information.",
    "Themed interface: Customize the gallery appearance with wedding-themed designs and couple's photos.",
    "Moderation tools: Review and approve photos before they appear publicly to maintain quality and appropriateness.",
    "Slideshow mode: Display uploaded photos in an automatic slideshow for viewing during or after the event.",
    "Social sharing: Enable guests to share favorite photos on social media directly from the gallery.",
    "Storage management: Organize photos by event, date, or uploader with automatic thumbnail generation.",
    "QR code access: Generate QR codes for easy gallery access that can be displayed at the venue."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
