{
  "name": "wetty",
  "slug": "wetty",
  "tagline": null,
  "description": "Wetty is a self-hosted web-based terminal that exposes SSH access through the browser. It replaces traditional terminal apps with a responsive web UI, letting users reach shell sessions securely from anywhere without extra client software.",
  "categories": [
    135
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v2.7.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2023-09-16",
    "date_last_commit": "2025-10-30",
    "github_stars": 5042
  },
  "resources": {
    "website": "https://butlerx.github.io/wetty",
    "documentation": "https://github.com/butlerx/wetty",
    "source_code": "https://github.com/butlerx/wetty",
    "logo": "/icons/wetty.webp",
    "issues": "https://github.com/butlerx/wetty/issues",
    "releases": "https://github.com/butlerx/wetty/releases"
  },
  "features": [
    "Browser-based terminal: Access SSH sessions directly from any web browser without installing terminal software.",
    "SSH connectivity: Connect to remote servers using standard SSH protocol with key or password authentication.",
    "Responsive interface: Use the terminal on desktop, tablet, or mobile devices with touch-friendly controls.",
    "Copy-paste support: Transfer commands and output between your local system and the terminal easily.",
    "Session persistence: Maintain terminal sessions even when closing the browser tab with reconnection support.",
    "Multiple sessions: Open multiple terminal tabs or windows to work on different servers simultaneously.",
    "Customizable appearance: Adjust font size, color schemes, and terminal themes for comfortable viewing.",
    "Keyboard shortcuts: Use familiar terminal keyboard shortcuts for efficient command-line navigation.",
    "SSL/TLS encryption: Secure all terminal traffic with HTTPS to protect credentials and sensitive data.",
    "Authentication options: Integrate with existing authentication systems or use built-in user management.",
    "Lightweight deployment: Run on minimal resources making it suitable for jump boxes or bastion hosts.",
    "Audit logging: Record terminal sessions for compliance and security review purposes."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
