{
  "name": "whorang",
  "slug": "whorang",
  "tagline": "",
  "description": "who-rang turns your smart doorbell into an AI-powered visitor identification system. It uses face recognition and multiple AI providers to classify visitors, log events, and present rich analytics via a self-hosted web dashboard.",
  "categories": [
    112
  ],
  "metadata": {
    "sponsored": false,
    "license": null,
    "version": "v1.0.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-07-05",
    "date_last_commit": "2025-07-17",
    "github_stars": 209
  },
  "resources": {
    "website": null,
    "documentation": null,
    "source_code": "https://github.com/Beast12/who-rang",
    "logo": "/icons/whorang.webp",
    "issues": "https://github.com/Beast12/who-rang/issues",
    "releases": "https://github.com/Beast12/who-rang/releases"
  },
  "features": [
    "Visitor identification: Use AI-powered face recognition to identify people at your door automatically.",
    "Multi-provider support: Integrate with various AI services including OpenAI, Google Vision, or local models.",
    "Event logging: Record all doorbell events with timestamps, images, and identification results.",
    "Real-time alerts: Receive notifications when someone rings the doorbell with visitor identification details.",
    "Visitor database: Build a database of known visitors with names, photos, and visit history.",
    "Unknown detection: Get alerted when unrecognized individuals appear at your door for security monitoring.",
    "Analytics dashboard: View statistics on visitor frequency, peak times, and identification accuracy.",
    "Image storage: Store doorbell camera snapshots for review and training the recognition system.",
    "Privacy controls: Configure data retention policies and manage stored visitor information.",
    "Integration support: Connect with popular smart doorbell brands and camera systems.",
    "Custom notifications: Set up different alert types for family members, delivery personnel, or strangers.",
    "Historical search: Search past events by date, person, or identification confidence level."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
