{
  "name": "windmill",
  "slug": "windmill",
  "tagline": null,
  "description": "Windmill is an open-source, self-hostable developer platform that turns scripts into production-grade workflows, APIs, and internal apps. It supports multiple languages, scheduling, webhooks, auto-generated UIs, and offers commercial cloud hosting.",
  "categories": [
    196
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": "v1.592.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-12",
    "date_last_commit": "2025-12-12",
    "github_stars": 15293
  },
  "resources": {
    "website": "https://windmill.dev",
    "documentation": "https://github.com/windmill-labs/windmill",
    "source_code": "https://github.com/windmill-labs/windmill",
    "logo": "/icons/windmill.webp",
    "issues": "https://github.com/windmill-labs/windmill/issues",
    "releases": "https://github.com/windmill-labs/windmill/releases"
  },
  "features": [
    "Script execution: Run scripts in Python, TypeScript, Go, Bash, or SQL as workflows or APIs instantly.",
    "Workflow builder: Create complex automation workflows with a visual flow editor and conditional logic.",
    "Auto-generated UIs: Automatically generate web interfaces for scripts with form inputs and result displays.",
    "Scheduling: Set up cron-based schedules to run scripts and workflows at specific times or intervals.",
    "Webhook triggers: Expose scripts as HTTP endpoints that can be called from external systems.",
    "Secret management: Store API keys, passwords, and credentials securely with encrypted secret storage.",
    "Version control: Track script changes with Git integration for collaboration and rollback capability.",
    "Dependency management: Automatically handle package dependencies for Python, npm, and other ecosystems.",
    "Execution logs: View detailed logs of all script runs with inputs, outputs, and error messages.",
    "Resource management: Define reusable resources like database connections or API clients across scripts.",
    "Permission system: Control access to scripts, workflows, and resources with role-based permissions.",
    "Monitoring dashboard: Track script execution metrics, success rates, and performance in real-time."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": true,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
