{
  "name": "wizarr",
  "slug": "wizarr",
  "tagline": null,
  "description": "Wizarr is a self-hosted invite management portal for media servers like Jellyfin and Plex. It streamlines onboarding by generating invite links, collecting user details, and provisioning accounts via a friendly web front-end.",
  "categories": [
    165
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v2025.12.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-09",
    "date_last_commit": "2025-12-13",
    "github_stars": 2454
  },
  "resources": {
    "website": "https://docs.wizarr.dev",
    "documentation": "https://github.com/wizarrrr/wizarr",
    "source_code": "https://github.com/wizarrrr/wizarr",
    "logo": "/icons/wizarr.webp",
    "issues": "https://github.com/wizarrrr/wizarr/issues",
    "releases": "https://github.com/wizarrrr/wizarr/releases"
  },
  "features": [
    "Invite generation: Create unique invite links with expiration dates and usage limits for controlled access.",
    "Media server integration: Connect with Jellyfin, Plex, and Emby to automate user provisioning.",
    "Custom onboarding: Design welcome pages with instructions, rules, and server information for new users.",
    "Request management: Review and approve user requests before granting media server access.",
    "Usage tracking: Monitor invite link usage and see which invites have been claimed.",
    "Bulk invites: Generate multiple invite codes at once for events or group onboarding.",
    "User profiles: Collect user information during signup to maintain organized member records.",
    "Expiration controls: Set time-based or usage-based limits on invites to maintain security.",
    "Discord integration: Sync with Discord servers to verify membership before granting access.",
    "Custom branding: Personalize the invite portal with your own logo, colors, and messaging.",
    "Email notifications: Send automated emails to new users with setup instructions and credentials.",
    "Analytics dashboard: View statistics on invite usage, user growth, and onboarding completion rates."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
