{
  "name": "wol",
  "slug": "wol",
  "tagline": null,
  "description": "wol is a small self-hosted tool for sending Wake-on-LAN packets to machines on your network. It provides a simple interface to store hosts and wake them remotely, making remote power management easier for homelab setups.",
  "categories": [
    135
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.1.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-05-16",
    "date_last_commit": "2025-05-16",
    "github_stars": 651
  },
  "resources": {
    "website": "https://github.com/Trugamr/wol",
    "documentation": "https://github.com/Trugamr/wol",
    "source_code": "https://github.com/Trugamr/wol",
    "logo": "/icons/wol.webp",
    "issues": "https://github.com/Trugamr/wol/issues",
    "releases": "https://github.com/Trugamr/wol/releases"
  },
  "features": [
    "Host storage: Save device MAC addresses and friendly names for repeated wake operations.",
    "Magic packet sending: Transmit Wake-on-LAN packets to power on compatible network devices remotely.",
    "Simple interface: Minimal UI focused on quick device wake without unnecessary complexity.",
    "Network discovery: Scan local network to detect devices and their MAC addresses automatically.",
    "Batch operations: Wake multiple devices simultaneously with a single action.",
    "Command-line support: Use CLI commands for scripting and automation alongside the web interface.",
    "Port configuration: Customize WOL packet destination ports for non-standard network setups.",
    "Lightweight deployment: Minimal resource footprint suitable for running on low-power devices.",
    "Cross-platform: Works on Linux, Windows, and macOS for flexible deployment options.",
    "JSON configuration: Store device configurations in simple JSON files for easy backup and migration.",
    "No database required: File-based storage eliminates the need for database setup and maintenance.",
    "Docker ready: Deploy quickly with pre-built Docker images and simple configuration."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
