{
  "name": "woli-webgui",
  "slug": "woli-webgui",
  "tagline": "",
  "description": "WoLi-webgui is a self-hosted web interface for managing Wake-on-LAN actions. It lets you add devices, trigger wake requests, and organize targets into a convenient dashboard for remote power control at home or in small offices.",
  "categories": [
    75
  ],
  "metadata": {
    "sponsored": false,
    "license": null,
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2024-09-03",
    "github_stars": 55
  },
  "resources": {
    "website": "https://github.com/RemyFV/WoLi-webgui",
    "documentation": "https://github.com/RemyFV/WoLi-webgui",
    "source_code": "https://github.com/RemyFV/WoLi-webgui",
    "logo": "/icons/woli-webgui.webp",
    "issues": "https://github.com/RemyFV/WoLi-webgui/issues",
    "releases": null
  },
  "features": [
    "Device management: Store MAC addresses and device names for quick access to your network machines.",
    "Wake-on-LAN packets: Send magic packets to wake devices remotely from anywhere on your network.",
    "Dashboard view: See all registered devices in a clean interface with status indicators.",
    "Grouping: Organize devices into groups like servers, workstations, or media centers for easier management.",
    "Quick wake: One-click wake buttons for each device eliminate the need for command-line tools.",
    "Status checking: Ping devices to verify if they're online before attempting to wake them.",
    "Scheduled wake: Set up automated wake schedules for devices that need regular power-on times.",
    "Mobile access: Manage and wake devices from smartphones or tablets via responsive web UI.",
    "Multi-subnet support: Wake devices across different network segments with proper routing configuration.",
    "Authentication: Protect the interface with password authentication to prevent unauthorized wake requests.",
    "Wake history: View logs of wake attempts and their timestamps for troubleshooting.",
    "Broadcast configuration: Configure broadcast addresses for networks with specific routing requirements."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
