{
  "name": "wordpress",
  "slug": "wordpress",
  "tagline": null,
  "description": "WordPress is a widely-used content management system for building self-hosted websites and blogs. It offers themes, plugins, user management, REST APIs, and an extensible editor, powering everything from simple sites to complex portals.",
  "categories": [
    19
  ],
  "metadata": {
    "sponsored": false,
    "license": "NOASSERTION",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-12",
    "github_stars": 20715
  },
  "resources": {
    "website": "https://wordpress.org",
    "documentation": "https://github.com/WordPress/WordPress",
    "source_code": "https://github.com/WordPress/WordPress",
    "logo": "/icons/wordpress.webp",
    "issues": "https://github.com/WordPress/WordPress/issues",
    "releases": null
  },
  "features": [
    "Content editor: Create and edit posts and pages with a block-based visual editor or classic text interface.",
    "Theme system: Customize site appearance with thousands of free and premium themes or build custom designs.",
    "Plugin architecture: Extend functionality with over 60,000 plugins for SEO, e-commerce, forms, and more.",
    "User management: Define roles and permissions for authors, editors, administrators, and custom user types.",
    "Media library: Upload and organize images, videos, and documents with built-in editing tools.",
    "SEO friendly: Generate clean URLs, manage meta tags, and integrate with SEO plugins for better rankings.",
    "REST API: Access content programmatically for headless CMS setups and mobile app integration.",
    "Multilingual ready: Build sites in any language with translation plugins and RTL text support.",
    "Custom post types: Create specialized content structures beyond posts and pages for portfolios or directories.",
    "Widget areas: Add dynamic content to sidebars and footers with drag-and-drop widget management.",
    "Scheduled publishing: Set posts to publish automatically at specific dates and times.",
    "Revision history: Track content changes over time and restore previous versions when needed."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
