{
  "name": "worklenz",
  "slug": "worklenz",
  "tagline": null,
  "description": "Worklenz is a self-hosted project and task management platform built for teams. It offers boards, timelines, time tracking, and reporting, helping teams collaborate and manage workloads in a single web-based workspace.",
  "categories": [
    125
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v2.1.5",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-09-25",
    "date_last_commit": "2025-11-20",
    "github_stars": 2878
  },
  "resources": {
    "website": "https://worklenz.com",
    "documentation": "https://github.com/Worklenz/worklenz",
    "source_code": "https://github.com/Worklenz/worklenz",
    "logo": "/icons/worklenz.webp",
    "issues": "https://github.com/Worklenz/worklenz/issues",
    "releases": "https://github.com/Worklenz/worklenz/releases"
  },
  "features": [
    "Project boards: Organize tasks in Kanban-style boards with customizable columns and workflows.",
    "Timeline view: Visualize project schedules with Gantt charts showing task dependencies and milestones.",
    "Time tracking: Log hours spent on tasks and generate timesheets for billing or productivity analysis.",
    "Task management: Create tasks with descriptions, assignees, due dates, priorities, and custom fields.",
    "Team collaboration: Comment on tasks, mention team members, and share files within project context.",
    "Workload management: View team capacity and task distribution to balance assignments effectively.",
    "Reporting: Generate reports on project progress, time spent, and team performance metrics.",
    "Custom workflows: Define project-specific workflows and task statuses to match your processes.",
    "Notifications: Receive alerts for task assignments, due dates, and project updates via email or in-app.",
    "Project templates: Create reusable project templates to standardize workflows across similar initiatives.",
    "Resource allocation: Assign team members to projects and track their availability across multiple initiatives.",
    "Activity logs: Audit project changes and task updates with detailed activity history."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
