{
  "name": "writefreely",
  "slug": "writefreely",
  "tagline": null,
  "description": "WriteFreely is a minimalist, self-hosted blogging and writing platform. It supports multiple users, federated ActivityPub publishing, clean typography, and privacy-focused configuration for communities or individuals.",
  "categories": [
    19
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v0.16.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-08-29",
    "date_last_commit": "2025-12-08",
    "github_stars": 4985
  },
  "resources": {
    "website": "https://writefreely.org",
    "documentation": "https://github.com/writefreely/writefreely",
    "source_code": "https://github.com/writefreely/writefreely",
    "logo": "/icons/writefreely.webp",
    "issues": "https://github.com/writefreely/writefreely/issues",
    "releases": "https://github.com/writefreely/writefreely/releases"
  },
  "features": [
    "Minimalist editor: Write in a distraction-free Markdown editor focused on content over formatting.",
    "Multi-user blogs: Host multiple writers on a single instance with individual blogs or shared publications.",
    "ActivityPub federation: Publish posts to the fediverse so followers on Mastodon and other platforms can read them.",
    "Custom domains: Map personal domains to individual blogs for professional branding.",
    "Privacy focused: No tracking, ads, or analytics by default to respect reader and writer privacy.",
    "Anonymous posting: Allow writers to publish without requiring accounts or personal information.",
    "Clean typography: Present content with readable fonts and layouts optimized for long-form reading.",
    "RSS feeds: Automatically generate RSS feeds for each blog so readers can subscribe via feed readers.",
    "Cross-posting: Syndicate posts to other platforms like Medium or WordPress with built-in integrations.",
    "Customizable themes: Modify blog appearance with CSS to match your aesthetic preferences.",
    "Paid subscriptions: Enable optional paid memberships for readers to support writers financially.",
    "Export content: Download all posts in Markdown format for backup or migration to other platforms."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
