{
  "name": "wud",
  "slug": "wud",
  "tagline": null,
  "description": "wud is a self-hosted Docker image watcher that monitors registries and running containers, notifying you about new image versions. It helps keep services up to date with minimal manual checking.",
  "categories": [
    172
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "8.1.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-07-06",
    "date_last_commit": "2025-12-02",
    "github_stars": 2796
  },
  "resources": {
    "website": "https://getwud.github.io/wud/",
    "documentation": "https://github.com/getwud/wud",
    "source_code": "https://github.com/getwud/wud",
    "logo": "/icons/wud.webp",
    "issues": "https://github.com/getwud/wud/issues",
    "releases": "https://github.com/getwud/wud/releases"
  },
  "features": [
    "Container monitoring: Automatically detect running Docker containers and track their image versions.",
    "Registry watching: Check Docker Hub, GHCR, and private registries for new image releases.",
    "Update notifications: Send alerts via email, Slack, Discord, or webhooks when updates are available.",
    "Version comparison: Compare running container versions against latest available tags in registries.",
    "Semver support: Understand semantic versioning to identify major, minor, and patch updates.",
    "Tag filtering: Configure which image tags to watch using regex patterns or specific version ranges.",
    "Dashboard view: See all containers and their update status in a centralized web interface.",
    "Multiple registries: Monitor images from different registries simultaneously in one instance.",
    "Scheduled checks: Configure how frequently to poll registries for new versions.",
    "Update triggers: Optionally trigger automated container updates via integration with Watchtower or similar tools.",
    "Authentication support: Access private registries with credentials for proprietary or internal images.",
    "Digest tracking: Monitor image digests to detect updates even when tags don't change."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
