{
  "name": "xbackbone",
  "slug": "xbackbone",
  "tagline": null,
  "description": "XBackBone is a self-hosted file hosting and sharing platform with short links, drag-and-drop uploads, multi-user support, and integrations with share clients and screenshot tools.",
  "categories": [
    61
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "3.8.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-01-26",
    "date_last_commit": "2025-11-21",
    "github_stars": 1103
  },
  "resources": {
    "website": "https://xbackbone.app",
    "documentation": "https://github.com/sergix44/XBackBone",
    "source_code": "https://github.com/sergix44/XBackBone",
    "logo": "/icons/xbackbone.webp",
    "issues": "https://github.com/sergix44/XBackBone/issues",
    "releases": "https://github.com/sergix44/XBackBone/releases"
  },
  "features": [
    "Drag-and-drop uploads: Upload files directly from your browser with intuitive drag-and-drop functionality for quick sharing.",
    "Short link generation: Automatically create shortened URLs for uploaded files to simplify sharing and tracking.",
    "Multi-user support: Manage multiple user accounts with individual storage quotas and permission controls.",
    "Screenshot tool integration: Connect with ShareX, Flameshot, and other screenshot utilities for instant uploads.",
    "Custom upload clients: Use built-in API support to integrate with third-party upload clients and automation tools.",
    "Storage management: Monitor disk usage, set file retention policies, and manage uploaded content through an admin dashboard.",
    "Public and private sharing: Control file visibility with public links or password-protected private shares.",
    "Media preview: View images, videos, and documents directly in the browser without downloading.",
    "Upload history: Track all uploads with timestamps, file sizes, and access statistics for each user.",
    "API access: Programmatically upload and manage files using a RESTful API for automation workflows.",
    "Theme customization: Personalize the interface with custom themes and branding options.",
    "LDAP authentication: Integrate with existing directory services for centralized user management."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
