{
  "name": "xpipe",
  "slug": "xpipe",
  "tagline": null,
  "description": "xpipe is a self-hosted tool and GUI for managing remote connections and development environments. It centralizes SSH, containers, and tunneling, giving developers a consistent interface across projects and machines.",
  "categories": [
    135
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "19.6",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-06",
    "date_last_commit": "2025-12-13",
    "github_stars": 12115
  },
  "resources": {
    "website": "https://xpipe.io",
    "documentation": "https://github.com/xpipe-io/xpipe",
    "source_code": "https://github.com/xpipe-io/xpipe",
    "logo": "/icons/xpipe.webp",
    "issues": "https://github.com/xpipe-io/xpipe/issues",
    "releases": "https://github.com/xpipe-io/xpipe/releases"
  },
  "features": [
    "Connection management: Store and organize SSH, Docker, Kubernetes, and other remote connections in a unified interface.",
    "Shell integration: Launch terminal sessions directly from the GUI with saved credentials and connection profiles.",
    "File browser: Navigate remote filesystems with a graphical file manager that supports drag-and-drop transfers.",
    "Container access: Connect to Docker containers and Kubernetes pods without memorizing complex CLI commands.",
    "Tunnel management: Create and manage SSH tunnels and port forwards through an intuitive visual interface.",
    "Script execution: Run saved scripts across multiple remote systems simultaneously with output aggregation.",
    "Credential vault: Securely store passwords, SSH keys, and certificates with encrypted local storage.",
    "Connection sharing: Export and import connection profiles to share configurations across teams or devices.",
    "Multi-platform support: Run on Windows, macOS, and Linux with consistent functionality and interface.",
    "Session history: Review past connections and commands with searchable logs and quick reconnect options.",
    "Environment variables: Define and inject environment variables per connection for consistent remote workflows.",
    "Custom protocols: Extend functionality with plugins to support additional connection types and tools."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
