{
  "name": "yacht",
  "slug": "yacht",
  "tagline": null,
  "description": "Yacht is a self-hosted web UI for managing Docker containers and compose stacks. It offers app templates, logs, resource views, and update management, acting as a simpler alternative to Portainer for homelabs.",
  "categories": [
    47
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-08",
    "github_stars": 37
  },
  "resources": {
    "website": "https://github.com/SelfhostedPro/Yacht",
    "documentation": "https://github.com/SelfhostedPro/Yacht",
    "source_code": "https://github.com/SelfhostedPro/Yacht",
    "logo": "/icons/yacht.webp",
    "issues": "https://github.com/SelfhostedPro/Yacht/issues",
    "releases": null
  },
  "features": [
    "Container management: Start, stop, and restart Docker containers with a clean web interface instead of CLI commands.",
    "Template library: Deploy popular applications quickly using pre-configured templates with sensible defaults.",
    "Compose support: Manage multi-container applications defined in docker-compose files through the GUI.",
    "Resource monitoring: View CPU, memory, and network usage for each container in real-time dashboards.",
    "Log viewer: Access container logs directly in the browser with filtering and search capabilities.",
    "Volume management: Create, attach, and manage Docker volumes for persistent data storage across containers.",
    "Network configuration: Set up custom Docker networks and manage container connectivity through visual tools.",
    "Update notifications: Receive alerts when newer container images are available for running applications.",
    "Port mapping: Configure port forwards and expose container services with an intuitive interface.",
    "Environment variables: Edit container environment variables without rebuilding or restarting from scratch.",
    "Image management: Pull, remove, and inspect Docker images from registries through the web UI.",
    "User authentication: Secure access with login credentials and role-based permissions for multi-user environments."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
