{
  "name": "yamlresume",
  "slug": "yamlresume",
  "tagline": null,
  "description": "yamlresume lets you define resumes in YAML and generate presentable documents or websites from them. It’s a self-hosted, text-first workflow that keeps CVs versionable and easy to maintain.",
  "categories": [
    19
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v0.8.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-28",
    "date_last_commit": "2025-12-01",
    "github_stars": 1072
  },
  "resources": {
    "website": "https://yamlresume.dev",
    "documentation": "https://github.com/yamlresume/yamlresume",
    "source_code": "https://github.com/yamlresume/yamlresume",
    "logo": "/icons/yamlresume.webp",
    "issues": "https://github.com/yamlresume/yamlresume/issues",
    "releases": "https://github.com/yamlresume/yamlresume/releases"
  },
  "features": [
    "YAML-based editing: Define resume content in structured YAML files that are easy to read, edit, and version control.",
    "Multiple output formats: Generate PDF, HTML, and Markdown versions of your resume from a single source file.",
    "Template system: Choose from various professional templates or create custom designs for different industries.",
    "Version control friendly: Track resume changes in Git with clear diffs and maintain multiple versions for different roles.",
    "Automated generation: Build resumes automatically in CI/CD pipelines or with local scripts for consistent formatting.",
    "Section customization: Include or exclude sections like education, experience, and skills based on job requirements.",
    "Multi-language support: Maintain translations of your resume in different languages within the same project.",
    "Metadata management: Store structured data about skills, dates, and achievements for easy updates and reuse.",
    "Web hosting: Deploy generated HTML resumes to static hosting for a personal portfolio website.",
    "Print optimization: Generate print-ready PDFs with proper page breaks and formatting for physical distribution.",
    "Schema validation: Ensure resume data follows the correct structure with built-in validation and error checking.",
    "Export flexibility: Customize output styling with CSS and templates to match personal branding preferences."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
