{
  "name": "yamtrack",
  "slug": "yamtrack",
  "tagline": null,
  "description": "Yamtrack is a self-hosted media and activity tracker that logs what you watch, read, or play. It aggregates entries into timelines and statistics, giving a personal overview of consumption habits.",
  "categories": [
    75
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v0.24.8",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-25",
    "date_last_commit": "2025-12-12",
    "github_stars": 1669
  },
  "resources": {
    "website": "https://github.com/FuzzyGrim/Yamtrack",
    "documentation": "https://github.com/FuzzyGrim/Yamtrack",
    "source_code": "https://github.com/FuzzyGrim/Yamtrack",
    "logo": "/icons/yamtrack.webp",
    "issues": "https://github.com/FuzzyGrim/Yamtrack/issues",
    "releases": "https://github.com/FuzzyGrim/Yamtrack/releases"
  },
  "features": [
    "Media logging: Track movies, TV shows, books, games, and other media you consume with manual or automated entries.",
    "Timeline view: Visualize your consumption history on an interactive timeline showing what you watched or read when.",
    "Statistics dashboard: View insights about your habits including total hours, favorite genres, and consumption patterns.",
    "Rating system: Rate and review media items to remember your opinions and discover personal preferences over time.",
    "Import functionality: Bulk import viewing history from streaming services and reading lists from other platforms.",
    "Custom categories: Create personalized categories and tags to organize media beyond standard classifications.",
    "Progress tracking: Monitor ongoing series, books, or games with completion percentages and episode counts.",
    "Search and filter: Find past entries quickly with powerful search across titles, dates, and custom metadata.",
    "Export data: Download your complete tracking history in JSON or CSV format for backup or analysis.",
    "Privacy focused: Keep all consumption data on your own server without sharing with third-party services.",
    "API integration: Connect with media databases like TMDB or IGDB to automatically fetch metadata and cover art.",
    "Yearly summaries: Generate annual reports showing your most-watched genres, longest binges, and consumption trends."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
