{
  "name": "yeetfile",
  "slug": "yeetfile",
  "tagline": null,
  "description": "YeetFile is a self-hosted file sharing app for sending files quickly with expiring links and optional passwords. It focuses on simplicity and privacy while providing a straightforward browser interface.",
  "categories": [
    61
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v0.2.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-02-26",
    "date_last_commit": "2025-08-18",
    "github_stars": 262
  },
  "resources": {
    "website": "https://yeetfile.com",
    "documentation": "https://github.com/benbusby/yeetfile",
    "source_code": "https://github.com/benbusby/yeetfile",
    "logo": "/icons/yeetfile.webp",
    "issues": "https://github.com/benbusby/yeetfile/issues",
    "releases": "https://github.com/benbusby/yeetfile/releases"
  },
  "features": [
    "Expiring links: Set automatic expiration times for shared files to ensure temporary access and reduce storage bloat.",
    "Password protection: Secure file downloads with optional passwords to control who can access shared content.",
    "Simple uploads: Drag and drop files into the browser or use the upload button for straightforward file sharing.",
    "No registration required: Share files without forcing recipients to create accounts or sign in to download.",
    "Privacy focused: Host files on your own infrastructure without relying on third-party services that track users.",
    "Download limits: Restrict the number of times a file can be downloaded before the link becomes invalid.",
    "File size limits: Configure maximum upload sizes to manage storage capacity and prevent abuse.",
    "Clean URLs: Generate short, memorable links for shared files instead of long cryptic identifiers.",
    "Upload history: View previously shared files with expiration status and download counts in a simple dashboard.",
    "Automatic cleanup: Remove expired files automatically to free up storage space without manual intervention.",
    "Minimal dependencies: Deploy quickly with a lightweight application that requires minimal server resources.",
    "Open source: Audit the code, customize functionality, and contribute improvements to the project."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
