{
  "name": "youlag",
  "slug": "youlag",
  "tagline": null,
  "description": "Youlag is a self-hosted latency and response tracking tool for services, visualizing delays and outages over time. It aims to provide quick, intuitive insight into user-perceived performance.",
  "categories": [
    148
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v3.0.7",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-01",
    "date_last_commit": "2025-11-01",
    "github_stars": 140
  },
  "resources": {
    "website": "https://github.com/civilblur/youlag",
    "documentation": "https://github.com/civilblur/youlag",
    "source_code": "https://github.com/civilblur/youlag",
    "logo": "/icons/youlag.webp",
    "issues": "https://github.com/civilblur/youlag/issues",
    "releases": "https://github.com/civilblur/youlag/releases"
  },
  "features": [
    "Latency monitoring: Measure response times for web services and APIs to identify performance degradation.",
    "Visual dashboards: View latency trends over time with charts and graphs that highlight spikes and patterns.",
    "Multi-endpoint tracking: Monitor multiple services simultaneously from a single dashboard for comprehensive oversight.",
    "Alert thresholds: Set latency limits that trigger notifications when services exceed acceptable response times.",
    "Historical data: Store and analyze past performance metrics to identify long-term trends and recurring issues.",
    "Uptime tracking: Monitor service availability alongside latency to get a complete picture of reliability.",
    "Geographic testing: Measure response times from different locations to understand regional performance variations.",
    "Custom intervals: Configure how frequently each service is checked to balance accuracy with resource usage.",
    "Status pages: Generate public or private status pages showing current and historical service performance.",
    "Export reports: Download performance data in CSV or JSON format for external analysis and reporting.",
    "Lightweight monitoring: Run checks with minimal overhead to avoid impacting the services being monitored.",
    "Browser extension: Track latency directly from your browser to measure real user experience metrics."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
