{
  "name": "your-spotify",
  "slug": "your-spotify",
  "tagline": null,
  "description": "your_spotify is a self-hosted dashboard and statistics platform for Spotify accounts. It imports listening history, visualizes top tracks and artists, and offers insights into listening habits over time.",
  "categories": [
    106
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "1.15.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-24",
    "date_last_commit": "2025-12-07",
    "github_stars": 4089
  },
  "resources": {
    "website": "https://github.com/Yooooomi/your_spotify",
    "documentation": "https://github.com/Yooooomi/your_spotify",
    "source_code": "https://github.com/Yooooomi/your_spotify",
    "logo": "/icons/your-spotify.webp",
    "issues": "https://github.com/Yooooomi/your_spotify/issues",
    "releases": "https://github.com/Yooooomi/your_spotify/releases"
  },
  "features": [
    "Listening history: Import and store your complete Spotify listening history with timestamps and track details.",
    "Top tracks analysis: Discover your most-played songs across different time periods with play count rankings.",
    "Artist statistics: View your favorite artists with listening time, track counts, and discovery timelines.",
    "Genre breakdown: Analyze your music taste by genre with visual charts showing distribution and trends.",
    "Temporal insights: See when you listen most with hourly, daily, and monthly activity heatmaps.",
    "Playlist analytics: Understand playlist composition with statistics on duration, diversity, and listening patterns.",
    "Comparison tools: Compare listening habits across different time periods to track evolving music preferences.",
    "Album tracking: Monitor complete album plays and discover your most-listened albums over time.",
    "Discovery metrics: Track when you first discovered artists and songs to understand your music exploration journey.",
    "Export functionality: Download your listening data in JSON or CSV format for external analysis.",
    "Privacy control: Keep all listening data on your own server without sharing with third-party analytics services.",
    "Automatic sync: Continuously import new listening history from Spotify to maintain up-to-date statistics."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
