{
  "name": "yourls",
  "slug": "yourls",
  "tagline": null,
  "description": "YOURLS is a self-hosted URL shortener that generates short links with optional custom keywords and stats. It supports plugins, APIs, and multiple users, offering a private alternative to public shortening services.",
  "categories": [
    171
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "1.10.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-07-31",
    "date_last_commit": "2025-12-12",
    "github_stars": 11738
  },
  "resources": {
    "website": "https://yourls.org",
    "documentation": "https://github.com/YOURLS/YOURLS",
    "source_code": "https://github.com/YOURLS/YOURLS",
    "logo": "/icons/yourls.webp",
    "issues": "https://github.com/YOURLS/YOURLS/issues",
    "releases": "https://github.com/YOURLS/YOURLS/releases"
  },
  "features": [
    "Custom keywords: Create memorable short URLs with custom keywords instead of random character strings.",
    "Click statistics: Track clicks, referrers, and geographic data for each shortened link to measure engagement.",
    "Private or public: Run as a private shortener for personal use or open it to the public with optional registration.",
    "Plugin system: Extend functionality with community plugins for features like QR codes, previews, and integrations.",
    "API access: Shorten URLs programmatically using the REST API for automation and third-party integrations.",
    "Bookmarklet: Install a browser bookmarklet to shorten the current page URL with one click.",
    "Multi-user support: Create accounts for team members with individual statistics and link management.",
    "Link management: Edit, delete, or update destination URLs for existing short links without changing the short URL.",
    "Search functionality: Find shortened links quickly by searching keywords, destinations, or creation dates.",
    "Password protection: Restrict access to specific short links with password requirements for sensitive content.",
    "Duplicate detection: Automatically reuse existing short URLs when the same long URL is submitted multiple times.",
    "Database flexibility: Choose between MySQL and other database backends for storage based on your infrastructure."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
