{
  "name": "youtarr",
  "slug": "youtarr",
  "tagline": null,
  "description": "Youtarr is a self-hosted YouTube request and download manager that coordinates with media servers and Arr tools. Users can request videos, which are then fetched and organized automatically.",
  "categories": [
    166
  ],
  "metadata": {
    "sponsored": false,
    "license": "ISC",
    "version": "v1.55.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-10",
    "date_last_commit": "2025-12-10",
    "github_stars": 737
  },
  "resources": {
    "website": "https://github.com/DialmasterOrg/Youtarr",
    "documentation": "https://github.com/DialmasterOrg/Youtarr",
    "source_code": "https://github.com/DialmasterOrg/Youtarr",
    "logo": "/icons/youtarr.webp",
    "issues": "https://github.com/DialmasterOrg/Youtarr/issues",
    "releases": "https://github.com/DialmasterOrg/Youtarr/releases"
  },
  "features": [
    "Request management: Allow users to request YouTube videos for download through a web interface with approval workflows.",
    "Automatic downloads: Fetch requested videos automatically using yt-dlp with configurable quality and format settings.",
    "Media server integration: Organize downloaded content into libraries compatible with Plex, Jellyfin, and Emby.",
    "Channel subscriptions: Monitor YouTube channels and automatically download new uploads based on defined rules.",
    "Quality selection: Choose video resolution, audio bitrate, and container formats per request or globally.",
    "Metadata extraction: Automatically fetch and store video titles, descriptions, thumbnails, and channel information.",
    "Duplicate detection: Prevent downloading the same video multiple times by checking existing library content.",
    "Storage management: Set disk space limits and retention policies to automatically remove old or unwatched content.",
    "User permissions: Control who can request videos, approve downloads, and manage the library with role-based access.",
    "Download queue: View and manage pending downloads with priority ordering and manual intervention options.",
    "Notification system: Send alerts when requested videos are downloaded and ready to watch.",
    "Subtitle support: Automatically download available subtitles and captions in multiple languages alongside videos."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
