{
  "name": "youtubedl-material",
  "slug": "youtubedl-material",
  "tagline": null,
  "description": "YoutubeDL-Material is a self-hosted web front-end for yt-dlp/youtube-dl. It lets users queue, download, and manage videos and audio from many sites, storing them in organized folders with metadata.",
  "categories": [
    100
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v4.3.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2023-05-26",
    "date_last_commit": "2025-08-16",
    "github_stars": 3094
  },
  "resources": {
    "website": "https://github.com/Tzahi12345/YoutubeDL-Material",
    "documentation": "https://github.com/Tzahi12345/YoutubeDL-Material",
    "source_code": "https://github.com/Tzahi12345/YoutubeDL-Material",
    "logo": "/icons/youtubedl-material.webp",
    "issues": "https://github.com/Tzahi12345/YoutubeDL-Material/issues",
    "releases": "https://github.com/Tzahi12345/YoutubeDL-Material/releases"
  },
  "features": [
    "Web interface: Download videos and audio from YouTube and hundreds of other sites through a modern browser UI.",
    "Queue management: Add multiple URLs to a download queue and process them sequentially or in parallel.",
    "Format selection: Choose video quality, audio-only downloads, or specific formats before starting downloads.",
    "Subscription system: Subscribe to channels and playlists to automatically download new content as it's published.",
    "Archive mode: Track previously downloaded videos to avoid duplicates when monitoring channels.",
    "Metadata organization: Store videos with proper filenames, thumbnails, and metadata in organized folder structures.",
    "User accounts: Create multiple users with individual download histories, subscriptions, and storage quotas.",
    "Download history: Review all past downloads with search, filtering, and re-download capabilities.",
    "Audio extraction: Download audio-only files in MP3, M4A, or other formats for music and podcast archiving.",
    "Playlist support: Download entire playlists or channels with a single URL and automatic indexing.",
    "Custom arguments: Pass advanced yt-dlp arguments for specialized download scenarios and edge cases.",
    "API access: Trigger downloads programmatically using REST API endpoints for automation and integrations."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
