{
  "name": "ytdl-sub",
  "slug": "ytdl-sub",
  "tagline": null,
  "description": "ytdl-sub is a self-hosted, automation-focused wrapper for yt-dlp that subscribes to channels and playlists, periodically downloading new content according to defined rules.",
  "categories": [
    100
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "2025.12.08",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-08",
    "date_last_commit": "2025-12-08",
    "github_stars": 2616
  },
  "resources": {
    "website": "https://ytdl-sub.readthedocs.io",
    "documentation": "https://github.com/jmbannon/ytdl-sub",
    "source_code": "https://github.com/jmbannon/ytdl-sub",
    "logo": "/icons/ytdl-sub.webp",
    "issues": "https://github.com/jmbannon/ytdl-sub/issues",
    "releases": "https://github.com/jmbannon/ytdl-sub/releases"
  },
  "features": [
    "Subscription automation: Define channels and playlists to monitor and download new content automatically on a schedule.",
    "Rule-based filtering: Set criteria for which videos to download based on title, duration, upload date, or metadata.",
    "Preset configurations: Use pre-built presets for common scenarios like music videos, podcasts, or educational content.",
    "Media server formatting: Organize downloads with naming conventions and folder structures compatible with Plex and Jellyfin.",
    "Incremental downloads: Only fetch new videos since the last run to minimize bandwidth and processing time.",
    "NFO file generation: Create metadata files for media servers with episode numbers, descriptions, and artwork.",
    "Thumbnail management: Download and organize video thumbnails as poster images for media library displays.",
    "Subtitle handling: Automatically download and embed subtitles in preferred languages with fallback options.",
    "Quality presets: Configure default quality settings per subscription to balance file size and video quality.",
    "Dry run mode: Preview what would be downloaded without actually fetching files to test configurations.",
    "YAML configuration: Define all subscriptions and rules in human-readable YAML files for version control.",
    "Notification hooks: Trigger webhooks or scripts when new content is downloaded for integration with other systems."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": true,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
