{
  "name": "ytptube",
  "slug": "ytptube",
  "tagline": null,
  "description": "ytptube is a self-hosted interface and automation tool for downloading and organizing YouTube content, exposing a simple web UI and configuration for recurring downloads.",
  "categories": [
    100
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v1.0.10",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-07",
    "date_last_commit": "2025-12-08",
    "github_stars": 758
  },
  "resources": {
    "website": "https://github.com/arabcoders/ytptube",
    "documentation": "https://github.com/arabcoders/ytptube",
    "source_code": "https://github.com/arabcoders/ytptube",
    "logo": "/icons/ytptube.webp",
    "issues": "https://github.com/arabcoders/ytptube/issues",
    "releases": "https://github.com/arabcoders/ytptube/releases"
  },
  "features": [
    "Channel monitoring: Subscribe to YouTube channels and automatically download new videos as they're published.",
    "Web dashboard: Manage subscriptions, view download history, and configure settings through a clean web interface.",
    "Download scheduling: Set specific times for downloads to run to avoid peak network usage hours.",
    "Quality profiles: Define preferred video quality and format settings per channel or globally.",
    "Storage organization: Automatically organize downloaded videos into folders by channel, date, or custom patterns.",
    "Metadata preservation: Save video descriptions, upload dates, and channel information alongside downloaded files.",
    "Duplicate prevention: Skip videos that have already been downloaded to avoid wasting bandwidth and storage.",
    "Playlist support: Monitor and download entire playlists with automatic updates when new videos are added.",
    "Selective downloads: Filter which videos to download based on title keywords, duration, or upload date.",
    "Bandwidth limiting: Throttle download speeds to prevent saturating network connections during active use.",
    "Notification system: Receive alerts when new videos are downloaded or when errors occur during processing.",
    "API integration: Control downloads and manage subscriptions programmatically using REST API endpoints."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
