{
  "name": "yunohost",
  "slug": "yunohost",
  "tagline": null,
  "description": "YunoHost is a self-hosted server management platform aimed at making self-hosting simple. It offers a web admin panel and app catalog to install, configure, and update many services on a single box.",
  "categories": [
    146
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "debian/13.0.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-06",
    "date_last_commit": "2025-12-11",
    "github_stars": 2743
  },
  "resources": {
    "website": "https://yunohost.org",
    "documentation": "https://github.com/YunoHost/yunohost",
    "source_code": "https://github.com/YunoHost/yunohost",
    "logo": "/icons/yunohost.webp",
    "issues": "https://github.com/YunoHost/yunohost/issues",
    "releases": "https://github.com/YunoHost/yunohost/releases"
  },
  "features": [
    "Application catalog: Install popular self-hosted applications with one click from a curated catalog of tested packages.",
    "Web administration: Manage server settings, users, domains, and applications through an intuitive web interface.",
    "User management: Create accounts with email addresses and control access to installed applications per user.",
    "Domain configuration: Set up multiple domains and subdomains with automatic DNS configuration and SSL certificates.",
    "Automatic backups: Schedule regular backups of applications and data with easy restoration options.",
    "Email server: Run a complete email stack with webmail, SMTP, IMAP, and spam filtering configured automatically.",
    "SSL certificates: Obtain and renew Let's Encrypt certificates automatically for all configured domains.",
    "Single sign-on: Access all installed applications with one set of credentials using integrated LDAP authentication.",
    "Update management: Keep the system and all installed applications up to date with centralized update notifications.",
    "Port management: Automatically handle port forwarding and firewall rules for installed applications.",
    "Command-line tools: Manage the server using CLI commands for advanced configuration and automation.",
    "Multi-architecture support: Deploy on x86, ARM, and Raspberry Pi hardware with consistent functionality."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
