{
  "name": "z-wave-js-ui",
  "slug": "z-wave-js-ui",
  "tagline": null,
  "description": "Z-Wave JS UI is a self-hosted control and management UI for Z-Wave networks using Z-Wave JS. It provides node inclusion, configuration, and diagnostics with dashboards and charts.",
  "categories": [
    76
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v11.8.2",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-30",
    "date_last_commit": "2025-12-09",
    "github_stars": 1157
  },
  "resources": {
    "website": "https://zwave-js.github.io/zwave-js-ui",
    "documentation": "https://github.com/zwave-js/zwave-js-ui",
    "source_code": "https://github.com/zwave-js/zwave-js-ui",
    "logo": "/icons/z-wave-js-ui.webp",
    "issues": "https://github.com/zwave-js/zwave-js-ui/issues",
    "releases": "https://github.com/zwave-js/zwave-js-ui/releases"
  },
  "features": [
    "Node management: Add, remove, and configure Z-Wave devices through an intuitive web interface without command-line tools.",
    "Network visualization: View your Z-Wave mesh network topology with signal strength and routing information.",
    "Device configuration: Modify device parameters and settings with detailed descriptions and validation.",
    "Firmware updates: Update device firmware over-the-air when manufacturers release new versions with bug fixes or features.",
    "Scene control: Create and trigger scenes that control multiple devices simultaneously for automation scenarios.",
    "Association management: Configure device associations for direct communication without controller involvement.",
    "Diagnostic tools: Troubleshoot network issues with ping tests, route analysis, and communication statistics.",
    "MQTT gateway: Expose Z-Wave devices to MQTT for integration with Home Assistant, Node-RED, and other platforms.",
    "Value monitoring: Track device values and states in real-time with historical graphs and logging.",
    "Backup and restore: Export complete network configuration including device settings for disaster recovery.",
    "Security support: Manage S0 and S2 security for encrypted communication with compatible devices.",
    "Healing tools: Optimize network performance by rebuilding routes and updating neighbor information automatically."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
