{
  "name": "zabbix",
  "slug": "zabbix",
  "tagline": null,
  "description": "Zabbix is an enterprise-grade self-hosted monitoring platform for servers, applications, and networks. It collects metrics, sends alerts, and visualizes data on dashboards, with both on-prem and cloud-hosted offerings.",
  "categories": [
    103
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-12",
    "github_stars": 5464
  },
  "resources": {
    "website": "https://www.zabbix.com/",
    "documentation": "https://github.com/zabbix/zabbix",
    "source_code": "https://github.com/zabbix/zabbix",
    "logo": "/icons/zabbix.webp",
    "issues": "https://github.com/zabbix/zabbix/issues",
    "releases": null
  },
  "features": [
    "Agent-based monitoring: Deploy lightweight agents on servers to collect detailed system metrics and application data.",
    "Agentless monitoring: Monitor network devices, services, and applications using SNMP, IPMI, and other protocols without agents.",
    "Custom metrics: Define and collect custom metrics using scripts, APIs, or database queries for specialized monitoring.",
    "Alerting system: Configure multi-level escalations with email, SMS, and webhook notifications based on trigger conditions.",
    "Dashboard builder: Create custom dashboards with graphs, maps, and widgets to visualize infrastructure health.",
    "Template library: Use pre-built monitoring templates for common applications and devices or create custom templates.",
    "Distributed monitoring: Scale to thousands of hosts using proxy servers that aggregate data from remote locations.",
    "Trend analysis: Store historical data and analyze long-term trends with built-in reporting and forecasting.",
    "Network discovery: Automatically detect and add new devices to monitoring using network scanning and SNMP discovery.",
    "SLA reporting: Track service level agreements with uptime calculations and availability reports.",
    "API integration: Automate configuration and data retrieval using comprehensive REST API for external integrations.",
    "High availability: Deploy in clustered configurations with failover support for mission-critical monitoring."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
