{
  "name": "zammad",
  "slug": "zammad",
  "tagline": null,
  "description": "Zammad is a self-hosted helpdesk and ticketing system. It integrates with email, chat, and telephony, supports multi-channel tickets, and exposes a modern web UI and APIs, alongside commercial cloud hosting.",
  "categories": [
    156
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-12-12",
    "github_stars": 5266
  },
  "resources": {
    "website": "https://zammad.org",
    "documentation": "https://github.com/zammad/zammad",
    "source_code": "https://github.com/zammad/zammad",
    "logo": "/icons/zammad.webp",
    "issues": "https://github.com/zammad/zammad/issues",
    "releases": null
  },
  "features": [
    "Multi-channel ticketing: Manage support requests from email, chat, phone, and social media in one unified interface.",
    "Email integration: Convert incoming emails to tickets automatically with threading and attachment handling.",
    "Knowledge base: Build a searchable help center with articles that can be linked to tickets or accessed by customers.",
    "Ticket workflows: Automate ticket routing, assignment, and status changes based on customizable rules and triggers.",
    "Agent collaboration: Add internal notes, mention colleagues, and collaborate on tickets without exposing details to customers.",
    "SLA management: Define and track service level agreements with automatic escalations for overdue tickets.",
    "Customer portal: Provide a self-service interface where customers can submit tickets and track their status.",
    "Reporting dashboard: Analyze ticket volume, response times, and agent performance with built-in analytics.",
    "Text modules: Create reusable response templates for common questions to improve agent efficiency.",
    "Time tracking: Log time spent on tickets for billing, reporting, and workload analysis.",
    "Mobile apps: Access tickets and respond to customers from iOS and Android devices with native applications.",
    "API access: Integrate with external systems and automate ticket creation using comprehensive REST APIs."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
