{
  "name": "zaneops",
  "slug": "zaneops",
  "tagline": "",
  "description": "zane-ops is a self-hosted operations dashboard for monitoring services and deployments. It aggregates status, logs, and metrics into a unified web interface for small teams or homelabs.",
  "categories": [
    146
  ],
  "metadata": {
    "sponsored": false,
    "license": "MIT",
    "version": "v1.12.3",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-10",
    "date_last_commit": "2025-12-09",
    "github_stars": 1188
  },
  "resources": {
    "website": "https://zaneops.dev",
    "documentation": "https://zaneops.dev",
    "source_code": "https://github.com/zane-ops/zane-ops",
    "logo": "/icons/zaneops.webp",
    "issues": "https://github.com/zane-ops/zane-ops/issues",
    "releases": "https://github.com/zane-ops/zane-ops/releases"
  },
  "features": [
    "Service monitoring: Track the health and status of deployed services with real-time availability checks.",
    "Deployment tracking: View deployment history, rollback options, and current versions across all services.",
    "Log aggregation: Collect and search logs from multiple services in a centralized interface with filtering.",
    "Metrics dashboard: Visualize resource usage, request rates, and performance metrics for all monitored services.",
    "Alert configuration: Set up notifications for service failures, performance degradation, or deployment issues.",
    "Container management: Monitor Docker containers and orchestration platforms with detailed resource metrics.",
    "Environment overview: Get a unified view of development, staging, and production environments in one dashboard.",
    "Incident tracking: Document and track incidents with timelines, affected services, and resolution steps.",
    "Team collaboration: Share access with team members and assign responsibilities for service ownership.",
    "API integration: Connect with CI/CD pipelines and deployment tools to automatically update service status.",
    "Custom checks: Define health checks and monitoring rules specific to your application requirements.",
    "Historical data: Review past performance and incidents to identify patterns and improve reliability."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
