{
  "name": "zigbee2mqtt",
  "slug": "zigbee2mqtt",
  "tagline": null,
  "description": "Zigbee2MQTT is a self-hosted bridge that connects Zigbee devices to MQTT, enabling integration with many home automation platforms. It runs as a service with a web dashboard for managing devices and networks.",
  "categories": [
    76
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "2.7.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-06",
    "date_last_commit": "2025-12-10",
    "github_stars": 14338
  },
  "resources": {
    "website": "https://www.zigbee2mqtt.io",
    "documentation": "https://github.com/Koenkk/zigbee2mqtt",
    "source_code": "https://github.com/Koenkk/zigbee2mqtt",
    "logo": "/icons/zigbee2mqtt.webp",
    "issues": "https://github.com/Koenkk/zigbee2mqtt/issues",
    "releases": "https://github.com/Koenkk/zigbee2mqtt/releases"
  },
  "features": [
    "Device pairing: Add Zigbee devices to your network through a simple web interface without proprietary hubs.",
    "MQTT bridge: Expose Zigbee devices to MQTT topics for integration with Home Assistant, Node-RED, and other platforms.",
    "Device management: Configure, rename, and remove devices with detailed information about capabilities and status.",
    "Network visualization: View your Zigbee network topology with signal strength and routing information.",
    "OTA updates: Update device firmware over-the-air directly through the interface when manufacturers release updates.",
    "Group control: Create device groups to control multiple lights or switches simultaneously with one command.",
    "Binding support: Set up direct device-to-device communication for faster response times and offline operation.",
    "Extensive compatibility: Support thousands of Zigbee devices from hundreds of manufacturers with regular updates.",
    "Custom converters: Add support for new or unsupported devices by writing JavaScript converter definitions.",
    "Logging and debugging: Access detailed logs for troubleshooting device issues and network problems.",
    "Backup and restore: Export network configuration and device settings for easy migration or disaster recovery.",
    "Touchlink support: Reset and pair devices using Touchlink commissioning for devices without reset buttons."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
