{
  "name": "ziit",
  "slug": "ziit",
  "tagline": null,
  "description": "Ziit is a self-hosted link-in-bio and profile page generator. It lets users collect links, social profiles, and content into a single customizable landing page hosted on their own infrastructure.",
  "categories": [
    165
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v1.1.1",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-15",
    "date_last_commit": "2025-12-10",
    "github_stars": 174
  },
  "resources": {
    "website": "https://ziit.app",
    "documentation": "https://github.com/0PandaDEV/Ziit",
    "source_code": "https://github.com/0PandaDEV/Ziit",
    "logo": "/icons/ziit.webp",
    "issues": "https://github.com/0PandaDEV/Ziit/issues",
    "releases": "https://github.com/0PandaDEV/Ziit/releases",
    "logo_light": "/icons/ziit-light.webp"
  },
  "features": [
    "Link aggregation: Collect all your important links, social profiles, and content in one customizable landing page.",
    "Custom themes: Personalize your profile page with colors, fonts, and layouts that match your personal brand.",
    "Analytics tracking: Monitor link clicks and visitor statistics to understand which content resonates with your audience.",
    "Social integration: Display links to Twitter, Instagram, LinkedIn, and other social platforms with recognizable icons.",
    "Custom domains: Host your link page on your own domain instead of a shared platform subdomain.",
    "Link scheduling: Set specific dates when links should appear or disappear from your profile automatically.",
    "Priority ordering: Arrange links in custom order to highlight the most important content at the top.",
    "Rich media: Add images, videos, and embedded content alongside text links for engaging presentations.",
    "SEO optimization: Configure meta tags, descriptions, and Open Graph data for better social media sharing.",
    "Mobile responsive: Ensure your link page looks great on all devices with automatic responsive design.",
    "Privacy control: Keep your profile private or public, and optionally require passwords for access.",
    "Export functionality: Download your link configuration for backup or migration to other platforms."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
