{
  "name": "zipcaptions",
  "slug": "zipcaptions",
  "tagline": "",
  "description": "zip-captions is a self-hosted utility that collects and packages subtitle or caption files into zip archives for distribution or backup, often used alongside media automation workflows.",
  "categories": [
    59
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": null,
    "date_app_added": "2025-11-23",
    "date_last_released": null,
    "date_last_commit": "2025-05-20",
    "github_stars": 56
  },
  "resources": {
    "website": "https://zipcaptions.app",
    "documentation": "https://zipcaptions.app",
    "source_code": "https://github.com/jptrsn/zip-captions",
    "logo": "/icons/zipcaptions.webp",
    "issues": "https://github.com/jptrsn/zip-captions/issues",
    "releases": null
  },
  "features": [
    "Subtitle collection: Gather subtitle and caption files from multiple sources into organized collections.",
    "Archive creation: Package collected subtitles into zip files for easy distribution and backup.",
    "Format support: Handle SRT, VTT, ASS, and other common subtitle formats with automatic detection.",
    "Batch processing: Process multiple subtitle files simultaneously to create archives efficiently.",
    "Metadata preservation: Maintain language codes, encoding information, and file structure in archives.",
    "Web interface: Upload and manage subtitle files through a browser-based interface without command-line tools.",
    "Automation integration: Connect with media automation workflows to archive subtitles alongside video downloads.",
    "Language filtering: Select specific subtitle languages to include or exclude from archive creation.",
    "Duplicate detection: Identify and skip duplicate subtitle files to keep archives clean and minimal.",
    "Custom naming: Configure archive naming patterns based on media titles, dates, or custom templates.",
    "Download management: Generate download links for created archives with optional expiration times.",
    "Storage organization: Automatically organize subtitle archives by media type, date, or custom categories."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": false,
    "docker": false,
    "docker_compose": false,
    "helm": false,
    "kubernetes": false,
    "terraform": false
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
