{
  "name": "zoneminder",
  "slug": "zoneminder",
  "tagline": null,
  "description": "ZoneMinder is a self-hosted video surveillance system. It captures, monitors, and analyzes video from cameras, supports motion detection and alerting, and exposes a web UI for configuration and viewing.",
  "categories": [
    107
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-2.0",
    "version": "1.36.36",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-03",
    "date_last_commit": "2025-12-11",
    "github_stars": 5694
  },
  "resources": {
    "website": "http://www.zoneminder.com/",
    "documentation": "https://github.com/ZoneMinder/zoneminder",
    "source_code": "https://github.com/ZoneMinder/zoneminder",
    "logo": "/icons/zoneminder.webp",
    "issues": "https://github.com/ZoneMinder/zoneminder/issues",
    "releases": "https://github.com/ZoneMinder/zoneminder/releases"
  },
  "features": [
    "Camera support: Connect IP cameras, USB webcams, and analog cameras through capture cards with broad protocol support.",
    "Motion detection: Automatically detect movement in camera feeds and trigger recording or alerts based on sensitivity settings.",
    "Continuous recording: Record video continuously or only during motion events to balance storage usage and coverage.",
    "Event management: Review, filter, and export recorded events with timestamps, thumbnails, and motion scores.",
    "Live monitoring: View multiple camera feeds simultaneously in a grid layout with real-time streaming.",
    "Zone configuration: Define specific areas within camera views to monitor while ignoring irrelevant motion.",
    "Alert notifications: Send email or webhook alerts when motion is detected or cameras go offline.",
    "PTZ control: Control pan, tilt, and zoom functions on supported cameras directly from the web interface.",
    "Storage management: Configure retention policies to automatically delete old recordings and manage disk space.",
    "Multi-server support: Distribute camera load across multiple servers and manage them from a central interface.",
    "Mobile access: View live feeds and recorded events from mobile devices using responsive web interface or apps.",
    "API integration: Automate camera control and event retrieval using REST API for home automation systems."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
