{
  "name": "zoraxy",
  "slug": "zoraxy",
  "tagline": null,
  "description": "Zoraxy is a self-hosted reverse proxy, load balancer, and firewall with a friendly web interface. It simplifies routing, SSL, and security rules for homelabs and small deployments.",
  "categories": [
    137
  ],
  "metadata": {
    "sponsored": false,
    "license": "AGPL-3.0",
    "version": "v3.3.0",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-06",
    "date_last_commit": "2025-12-12",
    "github_stars": 4619
  },
  "resources": {
    "website": "https://zoraxy.aroz.org",
    "documentation": "https://github.com/tobychui/zoraxy",
    "source_code": "https://github.com/tobychui/zoraxy",
    "logo": "/icons/zoraxy.webp",
    "issues": "https://github.com/tobychui/zoraxy/issues",
    "releases": "https://github.com/tobychui/zoraxy/releases"
  },
  "features": [
    "Reverse proxy: Route incoming requests to backend services based on domain names and path patterns.",
    "SSL management: Automatically obtain and renew SSL certificates from Let's Encrypt with ACME protocol support.",
    "Load balancing: Distribute traffic across multiple backend servers with health checks and failover capabilities.",
    "Web firewall: Protect services with built-in firewall rules, rate limiting, and IP blocking features.",
    "Access control: Restrict access to services by IP address, geographic location, or authentication requirements.",
    "Web interface: Configure all proxy rules, SSL certificates, and security settings through an intuitive dashboard.",
    "Custom headers: Add, modify, or remove HTTP headers for requests and responses to meet application requirements.",
    "WebSocket support: Proxy WebSocket connections for real-time applications alongside standard HTTP traffic.",
    "Logging and analytics: Monitor traffic patterns, response times, and errors with detailed access logs.",
    "Redirect rules: Set up HTTP to HTTPS redirects and custom URL rewriting rules without backend changes.",
    "Authentication proxy: Add authentication layers to services that don't have built-in user management.",
    "Docker integration: Automatically discover and configure proxies for Docker containers with label-based configuration."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
