{
  "name": "zot-registry",
  "slug": "zot",
  "tagline": null,
  "description": "zot is a self-hosted OCI image registry focused on simplicity, security, and cloud-native workflows. It supports replication, access control, and a minimal web UI and APIs for managing container images.",
  "categories": [
    32
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "v2.1.11",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-11-20",
    "date_last_commit": "2025-12-12",
    "github_stars": 1598
  },
  "resources": {
    "website": "https://zotregistry.dev",
    "documentation": "https://github.com/project-zot/zot",
    "source_code": "https://github.com/project-zot/zot",
    "logo": "/icons/zot.webp",
    "issues": "https://github.com/project-zot/zot/issues",
    "releases": "https://github.com/project-zot/zot/releases"
  },
  "features": [
    "OCI compliance: Store and distribute container images following Open Container Initiative standards for compatibility.",
    "Image replication: Synchronize images between registries for disaster recovery and geographic distribution.",
    "Access control: Define granular permissions for repositories with support for authentication and authorization.",
    "Vulnerability scanning: Integrate with security scanners to identify vulnerabilities in stored container images.",
    "Garbage collection: Automatically remove unused image layers and manifests to reclaim storage space.",
    "Image signing: Support content trust and image signing for verifying image authenticity and integrity.",
    "Web interface: Browse repositories, tags, and image details through a minimal web UI for quick inspection.",
    "API compatibility: Work with Docker CLI, Podman, and other OCI-compliant tools without modifications.",
    "Storage backends: Choose between local filesystem, S3, or other storage backends for image layer storage.",
    "Metrics export: Expose Prometheus metrics for monitoring registry performance and usage patterns.",
    "Webhook notifications: Trigger external systems when images are pushed, deleted, or modified in the registry.",
    "Minimal footprint: Run efficiently with low resource requirements suitable for edge deployments and small teams."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": true,
      "macos": true
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
