{
  "name": "ztnet",
  "slug": "ztnet",
  "tagline": null,
  "description": "ztnet is a self-hosted controller and management UI for ZeroTier networks. It lets administrators manage networks, members, and access rules via a central, easy-to-use web dashboard.",
  "categories": [
    174
  ],
  "metadata": {
    "sponsored": false,
    "license": "GPL-3.0",
    "version": "v0.7.12",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-12-07",
    "date_last_commit": "2025-12-12",
    "github_stars": 997
  },
  "resources": {
    "website": "https://ztnet.network",
    "documentation": "https://github.com/sinamics/ztnet",
    "source_code": "https://github.com/sinamics/ztnet",
    "logo": "/icons/ztnet.webp",
    "issues": "https://github.com/sinamics/ztnet/issues",
    "releases": "https://github.com/sinamics/ztnet/releases"
  },
  "features": [
    "Network management: Create and configure ZeroTier networks with custom IP ranges and routing rules from a web dashboard.",
    "Member authorization: Approve or deny device join requests and manage which devices can access each network.",
    "Access rules: Define flow rules to control traffic between network members with firewall-like policies.",
    "Network monitoring: View connected members, their IP addresses, and connection status in real-time.",
    "Multi-network support: Manage multiple ZeroTier networks from a single controller instance for different use cases.",
    "User accounts: Create accounts for team members with permissions to manage specific networks or view-only access.",
    "Device metadata: Add descriptions and tags to network members for easier identification and organization.",
    "Route configuration: Set up custom routes to bridge ZeroTier networks with physical networks or other subnets.",
    "DNS management: Configure DNS settings for networks to enable name resolution between members.",
    "Audit logging: Track all network changes, member additions, and administrative actions for security compliance.",
    "API access: Automate network management and member provisioning using REST API endpoints.",
    "Backup and restore: Export network configurations for disaster recovery or migration to other controllers."
  ],
  "platform_support": {
    "desktop": {
      "linux": false,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
