{
  "name": "zulip",
  "slug": "zulip",
  "tagline": null,
  "description": "Zulip is a self-hosted team chat platform with threaded conversations, topic-based streams, and extensive integrations. It offers web, desktop, and mobile clients, plus a fully managed cloud service for organizations.",
  "categories": [
    102
  ],
  "metadata": {
    "sponsored": false,
    "license": "Apache-2.0",
    "version": "11.4",
    "date_app_added": "2025-11-23",
    "date_last_released": "2025-10-23",
    "date_last_commit": "2025-12-13",
    "github_stars": 23988
  },
  "resources": {
    "website": "https://zulip.com",
    "documentation": "https://github.com/zulip/zulip",
    "source_code": "https://github.com/zulip/zulip",
    "logo": "/icons/zulip.webp",
    "issues": "https://github.com/zulip/zulip/issues",
    "releases": "https://github.com/zulip/zulip/releases"
  },
  "features": [
    "Threaded conversations: Organize discussions by topic within streams to maintain context and reduce noise.",
    "Stream organization: Create public or private streams for teams, projects, or topics with granular permissions.",
    "Powerful search: Find messages across all conversations with full-text search including filters for streams and topics.",
    "Rich formatting: Compose messages with Markdown, code blocks, LaTeX math, and emoji for expressive communication.",
    "Integrations: Connect with GitHub, Jira, Jenkins, and hundreds of other services using webhooks and bots.",
    "Mobile apps: Access conversations from native iOS and Android apps with full feature parity to the web client.",
    "Desktop clients: Use dedicated desktop applications for Windows, macOS, and Linux with native notifications.",
    "Email integration: Receive message notifications via email and reply directly from your inbox.",
    "Video calls: Start video meetings with integrated Jitsi or BigBlueButton support directly from conversations.",
    "Guest access: Invite external collaborators with limited access to specific streams without full organization membership.",
    "Message editing: Edit sent messages with visible edit history to correct mistakes while maintaining transparency.",
    "Custom emoji: Upload and use custom emoji reactions to add personality and team culture to conversations."
  ],
  "platform_support": {
    "desktop": {
      "linux": true,
      "windows": false,
      "macos": false
    },
    "mobile": {
      "android": false,
      "ios": false
    },
    "web_app": false,
    "browser_extension": false,
    "cli_only": false
  },
  "hosting_options": {
    "self_hosted": false,
    "managed_cloud": false,
    "saas": false
  },
  "interfaces": {
    "cli": false,
    "gui": false,
    "web_ui": false,
    "api": false,
    "tui": false
  },
  "deployment_methods": {
    "script": true,
    "docker": true,
    "docker_compose": true,
    "helm": true,
    "kubernetes": true,
    "terraform": true
  },
  "manifests": {},
  "default_credentials": {
    "username": null,
    "password": null
  },
  "notes": [],
  "repository_status": null
}
